una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Static Memory Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SMC {
	AT91_REG	 SMC_SETUP0; 	/*  Setup Register for CS 0*/
	AT91_REG	 SMC_PULSE0; 	/*  Pulse Register for CS 0*/
	AT91_REG	 SMC_CYCLE0; 	/*  Cycle Register for CS 0*/
	AT91_REG	 SMC_CTRL0; 	/*  Control Register for CS 0*/
	AT91_REG	 SMC_SETUP1; 	/*  Setup Register for CS 1*/
	AT91_REG	 SMC_PULSE1; 	/*  Pulse Register for CS 1*/
	AT91_REG	 SMC_CYCLE1; 	/*  Cycle Register for CS 1*/
	AT91_REG	 SMC_CTRL1; 	/*  Control Register for CS 1*/
	AT91_REG	 SMC_SETUP2; 	/*  Setup Register for CS 2*/
	AT91_REG	 SMC_PULSE2; 	/*  Pulse Register for CS 2*/
	AT91_REG	 SMC_CYCLE2; 	/*  Cycle Register for CS 2*/
	AT91_REG	 SMC_CTRL2; 	/*  Control Register for CS 2*/
	AT91_REG	 SMC_SETUP3; 	/*  Setup Register for CS 3*/
	AT91_REG	 SMC_PULSE3; 	/*  Pulse Register for CS 3*/
	AT91_REG	 SMC_CYCLE3; 	/*  Cycle Register for CS 3*/
	AT91_REG	 SMC_CTRL3; 	/*  Control Register for CS 3*/
	AT91_REG	 SMC_SETUP4; 	/*  Setup Register for CS 4*/
	AT91_REG	 SMC_PULSE4; 	/*  Pulse Register for CS 4*/
	AT91_REG	 SMC_CYCLE4; 	/*  Cycle Register for CS 4*/
	AT91_REG	 SMC_CTRL4; 	/*  Control Register for CS 4*/
	AT91_REG	 SMC_SETUP5; 	/*  Setup Register for CS 5*/
	AT91_REG	 SMC_PULSE5; 	/*  Pulse Register for CS 5*/
	AT91_REG	 SMC_CYCLE5; 	/*  Cycle Register for CS 5*/
	AT91_REG	 SMC_CTRL5; 	/*  Control Register for CS 5*/
	AT91_REG	 SMC_SETUP6; 	/*  Setup Register for CS 6*/
	AT91_REG	 SMC_PULSE6; 	/*  Pulse Register for CS 6*/
	AT91_REG	 SMC_CYCLE6; 	/*  Cycle Register for CS 6*/
	AT91_REG	 SMC_CTRL6; 	/*  Control Register for CS 6*/
	AT91_REG	 SMC_SETUP7; 	/*  Setup Register for CS 7*/
	AT91_REG	 SMC_PULSE7; 	/*  Pulse Register for CS 7*/
	AT91_REG	 SMC_CYCLE7; 	/*  Cycle Register for CS 7*/
	AT91_REG	 SMC_CTRL7; 	/*  Control Register for CS 7*/
} AT91S_SMC, *AT91PS_SMC;

/* -------- SMC_SETUP : (SMC Offset: 0x0) Setup Register for CS x -------- */
#define AT91C_SMC_NWESETUP    ((unsigned int) 0x3F <<  0) /* (SMC) NWE Setup Length*/
#define AT91C_SMC_NCSSETUPWR  ((unsigned int) 0x3F <<  8) /* (SMC) NCS Setup Length in WRite Access*/
#define AT91C_SMC_NRDSETUP    ((unsigned int) 0x3F << 16) /* (SMC) NRD Setup Length*/
#define AT91C_SMC_NCSSETUPRD  ((unsigned int) 0x3F << 24) /* (SMC) NCS Setup Length in ReaD Access*/
/* -------- SMC_PULSE : (SMC Offset: 0x4) Pulse Register for CS x -------- */
#define AT91C_SMC_NWEPULSE    ((unsigned int) 0x7F <<  0) /* (SMC) NWE Pulse Length*/
#define AT91C_SMC_NCSPULSEWR  ((unsigned int) 0x7F <<  8) /* (SMC) NCS Pulse Length in WRite Access*/
#define AT91C_SMC_NRDPULSE    ((unsigned int) 0x7F << 16) /* (SMC) NRD Pulse Length*/
#define AT91C_SMC_NCSPULSERD  ((unsigned int) 0x7F << 24) /* (SMC) NCS Pulse Length in ReaD Access*/
/* -------- SMC_CYC : (SMC Offset: 0x8) Cycle Register for CS x -------- */
#define AT91C_SMC_NWECYCLE    ((unsigned int) 0x1FF <<  0) /* (SMC) Total Write Cycle Length*/
#define AT91C_SMC_NRDCYCLE    ((unsigned int) 0x1FF << 16) /* (SMC) Total Read Cycle Length*/
/* -------- SMC_CTRL : (SMC Offset: 0xc) Control Register for CS x -------- */
#define AT91C_SMC_READMODE    ((unsigned int) 0x1 <<  0) /* (SMC) Read Mode*/
#define AT91C_SMC_WRITEMODE   ((unsigned int) 0x1 <<  1) /* (SMC) Write Mode*/
#define AT91C_SMC_NWAITM      ((unsigned int) 0x3 <<  5) /* (SMC) NWAIT Mode*/
#define 	AT91C_SMC_NWAITM_NWAIT_DISABLE        ((unsigned int) 0x0 <<  5) /* (SMC) External NWAIT disabled.*/
#define 	AT91C_SMC_NWAITM_NWAIT_ENABLE_FROZEN  ((unsigned int) 0x2 <<  5) /* (SMC) External NWAIT enabled in frozen mode.*/
#define 	AT91C_SMC_NWAITM_NWAIT_ENABLE_READY   ((unsigned int) 0x3 <<  5) /* (SMC) External NWAIT enabled in ready mode.*/
#define AT91C_SMC_BAT         ((unsigned int) 0x1 <<  8) /* (SMC) Byte Access Type*/
#define 	AT91C_SMC_BAT_BYTE_SELECT          ((unsigned int) 0x0 <<  8) /* (SMC) Write controled by ncs, nbs0, nbs1, nbs2, nbs3. Read controled by ncs, nrd, nbs0, nbs1, nbs2, nbs3.*/
#define 	AT91C_SMC_BAT_BYTE_WRITE           ((unsigned int) 0x1 <<  8) /* (SMC) Write controled by ncs, nwe0, nwe1, nwe2, nwe3. Read controled by ncs and nrd.*/
#define AT91C_SMC_DBW         ((unsigned int) 0x3 << 12) /* (SMC) Data Bus Width*/
#define 	AT91C_SMC_DBW_WIDTH_EIGTH_BITS     ((unsigned int) 0x0 << 12) /* (SMC) 8 bits.*/
#define 	AT91C_SMC_DBW_WIDTH_SIXTEEN_BITS   ((unsigned int) 0x1 << 12) /* (SMC) 16 bits.*/
#define 	AT91C_SMC_DBW_WIDTH_THIRTY_TWO_BITS ((unsigned int) 0x2 << 12) /* (SMC) 32 bits.*/
#define AT91C_SMC_TDF         ((unsigned int) 0xF << 16) /* (SMC) Data Float Time.*/
#define AT91C_SMC_TDFEN       ((unsigned int) 0x1 << 20) /* (SMC) TDF Enabled.*/
#define AT91C_SMC_PMEN        ((unsigned int) 0x1 << 24) /* (SMC) Page Mode Enabled.*/
#define AT91C_SMC_PS          ((unsigned int) 0x3 << 28) /* (SMC) Page Size*/
#define 	AT91C_SMC_PS_SIZE_FOUR_BYTES      ((unsigned int) 0x0 << 28) /* (SMC) 4 bytes.*/
#define 	AT91C_SMC_PS_SIZE_EIGHT_BYTES     ((unsigned int) 0x1 << 28) /* (SMC) 8 bytes.*/
#define 	AT91C_SMC_PS_SIZE_SIXTEEN_BYTES   ((unsigned int) 0x2 << 28) /* (SMC) 16 bytes.*/
#define 	AT91C_SMC_PS_SIZE_THIRTY_TWO_BYTES ((unsigned int) 0x3 << 28) /* (SMC) 32 bytes.*/
/* -------- SMC_SETUP : (SMC Offset: 0x10) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x14) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x18) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x1c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x20) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x24) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x28) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x2c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x30) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x34) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x38) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x3c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x40) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x44) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x48) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x4c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x50) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x54) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x58) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x5c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x60) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x64) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x68) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x6c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x70) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x74) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x78) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x7c) Control Register for CS x -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR AHB Matrix Interface*/
/* ******************************************************************************/
typedef struct _AT91S_MATRIX {
	AT91_REG	 MATRIX_MCFG0; 	/*  Master Configuration Register 0 : rom*/
	AT91_REG	 MATRIX_MCFG1; 	/*  Master Configuration Register 1 ; htcm*/
	AT91_REG	 MATRIX_MCFG2; 	/*  Master Configuration Register 2 : lcdc*/
	AT91_REG	 MATRIX_MCFG3; 	/*  Master Configuration Register 3 : usb_dev_hs*/
	AT91_REG	 MATRIX_MCFG4; 	/*  Master Configuration Register 4 : ebi*/
	AT91_REG	 MATRIX_MCFG5; 	/*  Master Configuration Register 5 : bridge*/
	AT91_REG	 MATRIX_MCFG6; 	/*  Master Configuration Register 6 */
	AT91_REG	 MATRIX_MCFG7; 	/*  Master Configuration Register 7 */
	AT91_REG	 MATRIX_MCFG8; 	/*  Master Configuration Register 8 */
	AT91_REG	 Reserved0[7]; 	/* */
	AT91_REG	 MATRIX_SCFG0; 	/*  Slave Configuration Register 0 : rom*/
	AT91_REG	 MATRIX_SCFG1; 	/*  Slave Configuration Register 1 : htcm*/
	AT91_REG	 MATRIX_SCFG2; 	/*  Slave Configuration Register 2 : lcdc*/
	AT91_REG	 MATRIX_SCFG3; 	/*  Slave Configuration Register 3 : usb_dev_hs*/
	AT91_REG	 MATRIX_SCFG4; 	/*  Slave Configuration Register 4 ; ebi*/
	AT91_REG	 MATRIX_SCFG5; 	/*  Slave Configuration Register 5 : bridge*/
	AT91_REG	 MATRIX_SCFG6; 	/*  Slave Configuration Register 6*/
	AT91_REG	 MATRIX_SCFG7; 	/*  Slave Configuration Register 7*/
	AT91_REG	 Reserved1[8]; 	/* */
	AT91_REG	 MATRIX_PRAS0; 	/*  PRAS0 : rom*/
	AT91_REG	 MATRIX_PRBS0; 	/*  PRBS0 : rom*/
	AT91_REG	 MATRIX_PRAS1; 	/*  PRAS1 : htcm*/
	AT91_REG	 MATRIX_PRBS1; 	/*  PRBS1 : htcm*/
	AT91_REG	 MATRIX_PRAS2; 	/*  PRAS2 : lcdc*/
	AT91_REG	 MATRIX_PRBS2; 	/*  PRBS2 : lcdc*/
	AT91_REG	 MATRIX_PRAS3; 	/*  PRAS3 : usb_dev_hs*/
	AT91_REG	 MATRIX_PRBS3; 	/*  PRBS3 : usb_dev_hs*/
	AT91_REG	 MATRIX_PRAS4; 	/*  PRAS4 : ebi*/
	AT91_REG	 MATRIX_PRBS4; 	/*  PRBS4 : ebi*/
	AT91_REG	 MATRIX_PRAS5; 	/*  PRAS5 : bridge*/
	AT91_REG	 MATRIX_PRBS5; 	/*  PRBS5 : bridge*/
	AT91_REG	 MATRIX_PRAS6; 	/*  PRAS6*/
	AT91_REG	 MATRIX_PRBS6; 	/*  PRBS6*/
	AT91_REG	 MATRIX_PRAS7; 	/*  PRAS7*/
	AT91_REG	 MATRIX_PRBS7; 	/*  PRBS7*/
	AT91_REG	 Reserved2[16]; 	/* */
	AT91_REG	 MATRIX_MRCR; 	/*  Master Remp Control Register */
} AT91S_MATRIX, *AT91PS_MATRIX;

