una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* -------- PWMC_MR : (PWMC Offset: 0x0) PWMC Mode Register -------- */
#define AT91C_PWMC_DIVA       ((unsigned int) 0xFF <<  0) /* (PWMC) CLKA divide factor.*/
#define AT91C_PWMC_PREA       ((unsigned int) 0xF <<  8) /* (PWMC) Divider Input Clock Prescaler A*/
#define 	AT91C_PWMC_PREA_MCK                  ((unsigned int) 0x0 <<  8) /* (PWMC) */
#define AT91C_PWMC_DIVB       ((unsigned int) 0xFF << 16) /* (PWMC) CLKB divide factor.*/
#define AT91C_PWMC_PREB       ((unsigned int) 0xF << 24) /* (PWMC) Divider Input Clock Prescaler B*/
#define 	AT91C_PWMC_PREB_MCK                  ((unsigned int) 0x0 << 24) /* (PWMC) */
/* -------- PWMC_ENA : (PWMC Offset: 0x4) PWMC Enable Register -------- */
#define AT91C_PWMC_CHID0      ((unsigned int) 0x1 <<  0) /* (PWMC) Channel ID 0*/
#define AT91C_PWMC_CHID1      ((unsigned int) 0x1 <<  1) /* (PWMC) Channel ID 1*/
#define AT91C_PWMC_CHID2      ((unsigned int) 0x1 <<  2) /* (PWMC) Channel ID 2*/
#define AT91C_PWMC_CHID3      ((unsigned int) 0x1 <<  3) /* (PWMC) Channel ID 3*/
#define AT91C_PWMC_CHID4      ((unsigned int) 0x1 <<  4) /* (PWMC) Channel ID 4*/
#define AT91C_PWMC_CHID5      ((unsigned int) 0x1 <<  5) /* (PWMC) Channel ID 5*/
#define AT91C_PWMC_CHID6      ((unsigned int) 0x1 <<  6) /* (PWMC) Channel ID 6*/
#define AT91C_PWMC_CHID7      ((unsigned int) 0x1 <<  7) /* (PWMC) Channel ID 7*/
/* -------- PWMC_DIS : (PWMC Offset: 0x8) PWMC Disable Register -------- */
/* -------- PWMC_SR : (PWMC Offset: 0xc) PWMC Status Register -------- */
/* -------- PWMC_IER : (PWMC Offset: 0x10) PWMC Interrupt Enable Register -------- */
/* -------- PWMC_IDR : (PWMC Offset: 0x14) PWMC Interrupt Disable Register -------- */
/* -------- PWMC_IMR : (PWMC Offset: 0x18) PWMC Interrupt Mask Register -------- */
/* -------- PWMC_ISR : (PWMC Offset: 0x1c) PWMC Interrupt Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Serial Parallel Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SPI {
	AT91_REG	 SPI_CR; 	/* Control Register*/
	AT91_REG	 SPI_MR; 	/* Mode Register*/
	AT91_REG	 SPI_RDR; 	/* Receive Data Register*/
	AT91_REG	 SPI_TDR; 	/* Transmit Data Register*/
	AT91_REG	 SPI_SR; 	/* Status Register*/
	AT91_REG	 SPI_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SPI_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SPI_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved0[4]; 	/* */
	AT91_REG	 SPI_CSR[4]; 	/* Chip Select Register*/
	AT91_REG	 Reserved1[48]; 	/* */
	AT91_REG	 SPI_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 SPI_RCR; 	/* Receive Counter Register*/
	AT91_REG	 SPI_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 SPI_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 SPI_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 SPI_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 SPI_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 SPI_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 SPI_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 SPI_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_SPI, *AT91PS_SPI;

/* -------- SPI_CR : (SPI Offset: 0x0) SPI Control Register -------- */
#define AT91C_SPI_SPIEN       ((unsigned int) 0x1 <<  0) /* (SPI) SPI Enable*/
#define AT91C_SPI_SPIDIS      ((unsigned int) 0x1 <<  1) /* (SPI) SPI Disable*/
#define AT91C_SPI_SWRST       ((unsigned int) 0x1 <<  7) /* (SPI) SPI Software reset*/
#define AT91C_SPI_LASTXFER    ((unsigned int) 0x1 << 24) /* (SPI) SPI Last Transfer*/
/* -------- SPI_MR : (SPI Offset: 0x4) SPI Mode Register -------- */
#define AT91C_SPI_MSTR        ((unsigned int) 0x1 <<  0) /* (SPI) Master/Slave Mode*/
#define AT91C_SPI_PS          ((unsigned int) 0x1 <<  1) /* (SPI) Peripheral Select*/
#define 	AT91C_SPI_PS_FIXED                ((unsigned int) 0x0 <<  1) /* (SPI) Fixed Peripheral Select*/
#define 	AT91C_SPI_PS_VARIABLE             ((unsigned int) 0x1 <<  1) /* (SPI) Variable Peripheral Select*/
#define AT91C_SPI_PCSDEC      ((unsigned int) 0x1 <<  2) /* (SPI) Chip Select Decode*/
#define AT91C_SPI_FDIV        ((unsigned int) 0x1 <<  3) /* (SPI) Clock Selection*/
#define AT91C_SPI_MODFDIS     ((unsigned int) 0x1 <<  4) /* (SPI) Mode Fault Detection*/
#define AT91C_SPI_LLB         ((unsigned int) 0x1 <<  7) /* (SPI) Clock Selection*/
#define AT91C_SPI_PCS         ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select*/
#define AT91C_SPI_DLYBCS      ((unsigned int) 0xFF << 24) /* (SPI) Delay Between Chip Selects*/
/* -------- SPI_RDR : (SPI Offset: 0x8) Receive Data Register -------- */
#define AT91C_SPI_RD          ((unsigned int) 0xFFFF <<  0) /* (SPI) Receive Data*/
#define AT91C_SPI_RPCS        ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select Status*/
/* -------- SPI_TDR : (SPI Offset: 0xc) Transmit Data Register -------- */
#define AT91C_SPI_TD          ((unsigned int) 0xFFFF <<  0) /* (SPI) Transmit Data*/
#define AT91C_SPI_TPCS        ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select Status*/
/* -------- SPI_SR : (SPI Offset: 0x10) Status Register -------- */
#define AT91C_SPI_RDRF        ((unsigned int) 0x1 <<  0) /* (SPI) Receive Data Register Full*/
#define AT91C_SPI_TDRE        ((unsigned int) 0x1 <<  1) /* (SPI) Transmit Data Register Empty*/
#define AT91C_SPI_MODF        ((unsigned int) 0x1 <<  2) /* (SPI) Mode Fault Error*/
#define AT91C_SPI_OVRES       ((unsigned int) 0x1 <<  3) /* (SPI) Overrun Error Status*/
#define AT91C_SPI_ENDRX       ((unsigned int) 0x1 <<  4) /* (SPI) End of Receiver Transfer*/
#define AT91C_SPI_ENDTX       ((unsigned int) 0x1 <<  5) /* (SPI) End of Receiver Transfer*/
#define AT91C_SPI_RXBUFF      ((unsigned int) 0x1 <<  6) /* (SPI) RXBUFF Interrupt*/
#define AT91C_SPI_TXBUFE      ((unsigned int) 0x1 <<  7) /* (SPI) TXBUFE Interrupt*/
#define AT91C_SPI_NSSR        ((unsigned int) 0x1 <<  8) /* (SPI) NSSR Interrupt*/
#define AT91C_SPI_TXEMPTY     ((unsigned int) 0x1 <<  9) /* (SPI) TXEMPTY Interrupt*/
#define AT91C_SPI_SPIENS      ((unsigned int) 0x1 << 16) /* (SPI) Enable Status*/
/* -------- SPI_IER : (SPI Offset: 0x14) Interrupt Enable Register -------- */
/* -------- SPI_IDR : (SPI Offset: 0x18) Interrupt Disable Register -------- */
/* -------- SPI_IMR : (SPI Offset: 0x1c) Interrupt Mask Register -------- */
/* -------- SPI_CSR : (SPI Offset: 0x30) Chip Select Register -------- */
#define AT91C_SPI_CPOL        ((unsigned int) 0x1 <<  0) /* (SPI) Clock Polarity*/
#define AT91C_SPI_NCPHA       ((unsigned int) 0x1 <<  1) /* (SPI) Clock Phase*/
#define AT91C_SPI_CSAAT       ((unsigned int) 0x1 <<  3) /* (SPI) Chip Select Active After Transfer*/
#define AT91C_SPI_BITS        ((unsigned int) 0xF <<  4) /* (SPI) Bits Per Transfer*/
#define 	AT91C_SPI_BITS_8                    ((unsigned int) 0x0 <<  4) /* (SPI) 8 Bits Per transfer*/
#define 	AT91C_SPI_BITS_9                    ((unsigned int) 0x1 <<  4) /* (SPI) 9 Bits Per transfer*/
#define 	AT91C_SPI_BITS_10                   ((unsigned int) 0x2 <<  4) /* (SPI) 10 Bits Per transfer*/
#define 	AT91C_SPI_BITS_11                   ((unsigned int) 0x3 <<  4) /* (SPI) 11 Bits Per transfer*/
#define 	AT91C_SPI_BITS_12                   ((unsigned int) 0x4 <<  4) /* (SPI) 12 Bits Per transfer*/
#define 	AT91C_SPI_BITS_13                   ((unsigned int) 0x5 <<  4) /* (SPI) 13 Bits Per transfer*/
#define 	AT91C_SPI_BITS_14                   ((unsigned int) 0x6 <<  4) /* (SPI) 14 Bits Per transfer*/
#define 	AT91C_SPI_BITS_15                   ((unsigned int) 0x7 <<  4) /* (SPI) 15 Bits Per transfer*/
#define 	AT91C_SPI_BITS_16                   ((unsigned int) 0x8 <<  4) /* (SPI) 16 Bits Per transfer*/
#define AT91C_SPI_SCBR        ((unsigned int) 0xFF <<  8) /* (SPI) Serial Clock Baud Rate*/
#define AT91C_SPI_DLYBS       ((unsigned int) 0xFF << 16) /* (SPI) Delay Before SPCK*/
#define AT91C_SPI_DLYBCT      ((unsigned int) 0xFF << 24) /* (SPI) Delay Between Consecutive Transfers*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR TSADC*/
/* ******************************************************************************/
typedef struct _AT91S_TSADC {
	AT91_REG	 TSADC_CR; 	/* Control Register*/
	AT91_REG	 TSADC_MR; 	/* Mode Register*/
	AT91_REG	 TSADC_TRGR; 	/* Trigger Register*/
	AT91_REG	 TSADC_TSR; 	/* Touch Screen Register*/
	AT91_REG	 TSADC_CHER; 	/* Channel Enable Register*/
	AT91_REG	 TSADC_CHDR; 	/* Channel Disable Register*/
	AT91_REG	 TSADC_CHSR; 	/* Channel Status Register*/
	AT91_REG	 TSADC_SR; 	/* Status Register*/
	AT91_REG	 TSADC_LCDR; 	/* Last Converted Register*/
	AT91_REG	 TSADC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 TSADC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 TSADC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 TSADC_CDR0; 	/* Channel Data Register 0*/
	AT91_REG	 TSADC_CDR1; 	/* Channel Data Register 1*/
	AT91_REG	 TSADC_CDR2; 	/* Channel Data Register 2*/
	AT91_REG	 TSADC_CDR3; 	/* Channel Data Register 3*/
	AT91_REG	 TSADC_CDR4; 	/* Channel Data Register 4*/
	AT91_REG	 TSADC_CDR5; 	/* Channel Data Register 5*/
	AT91_REG	 Reserved0[46]; 	/* */
	AT91_REG	 TSADC_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 TSADC_RCR; 	/* Receive Counter Register*/
	AT91_REG	 TSADC_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 TSADC_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 TSADC_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 TSADC_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 TSADC_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 TSADC_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 TSADC_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 TSADC_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_TSADC, *AT91PS_TSADC;

/* -------- TSADC_CR : (TSADC Offset: 0x0) Control Register -------- */
#define AT91C_TSADC_SWRST     ((unsigned int) 0x1 <<  0) /* (TSADC) Software Reset*/
#define AT91C_TSADC_START     ((unsigned int) 0x1 <<  1) /* (TSADC) Start Conversion*/
/* -------- TSADC_MR : (TSADC Offset: 0x4) Mode Register -------- */
#define AT91C_TSADC_TSAMOD    ((unsigned int) 0x3 <<  0) /* (TSADC) Touch Screen ADC Mode*/
#define 	AT91C_TSADC_TSAMOD_ADC_ONLY_MODE        ((unsigned int) 0x0) /* (TSADC) ADC Mode*/
#define 	AT91C_TSADC_TSAMOD_TS_ONLY_MODE         ((unsigned int) 0x1) /* (TSADC) Touch Screen Only Mode*/
#define AT91C_TSADC_LOWRES    ((unsigned int) 0x1 <<  4) /* (TSADC) ADC Resolution*/
#define AT91C_TSADC_SLEEP     ((unsigned int) 0x1 <<  5) /* (TSADC) Sleep Mode*/
#define AT91C_TSADC_PENDET    ((unsigned int) 0x1 <<  6) /* (TSADC) Pen Detect Selection*/
#define AT91C_TSADC_PRESCAL   ((unsigned int) 0x3F <<  8) /* (TSADC) Prescaler Rate Selection*/
#define AT91C_TSADC_STARTUP   ((unsigned int) 0x7F << 16) /* (TSADC) Startup Time*/
#define AT91C_TSADC_SHTIM     ((unsigned int) 0xF << 24) /* (TSADC) Sample and Hold Time for ADC Channels*/
#define AT91C_TSADC_PENDBC    ((unsigned int) 0xF << 28) /* (TSADC) Pen Detect Debouncing Period*/
/* -------- TSADC_TRGR : (TSADC Offset: 0x8) Trigger Register -------- */
#define AT91C_TSADC_TRGMOD    ((unsigned int) 0x7 <<  0) /* (TSADC) Trigger Mode*/
#define 	AT91C_TSADC_TRGMOD_NO_TRIGGER           ((unsigned int) 0x0) /* (TSADC) No Trigger*/
#define 	AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_RE  ((unsigned int) 0x1) /* (TSADC) External Trigger Rising Edge*/
#define 	AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_FE  ((unsigned int) 0x2) /* (TSADC) External Trigger Falling Edge*/
#define 	AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_AE  ((unsigned int) 0x3) /* (TSADC) External Trigger Any Edge*/
#define 	AT91C_TSADC_TRGMOD_PENDET_TRIGGER       ((unsigned int) 0x4) /* (TSADC) Pen Detect Trigger (only if PENDET is set and in Touch Screen mode only)*/
#define 	AT91C_TSADC_TRGMOD_PERIODIC_TRIGGER     ((unsigned int) 0x5) /* (TSADC) Periodic Trigger (wrt TRGPER)*/
#define 	AT91C_TSADC_TRGMOD_CONT_TRIGGER         ((unsigned int) 0x6) /* (TSADC) Continuous Trigger*/
#define AT91C_TSADC_TRGPER    ((unsigned int) 0xFFFF << 16) /* (TSADC) Trigger Period*/
/* -------- TSADC_TSR : (TSADC Offset: 0xc) Touch Screen Register -------- */
#define AT91C_TSADC_TSSHTIM   ((unsigned int) 0xF << 24) /* (TSADC) Sample and Hold Time for Touch Screen Channels*/
/* -------- TSADC_CHER : (TSADC Offset: 0x10) Channel Enable Register -------- */
#define AT91C_TSADC_CHENA0    ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 Enable*/
#define AT91C_TSADC_CHENA1    ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 Enable*/
#define AT91C_TSADC_CHENA2    ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 Enable*/
#define AT91C_TSADC_CHENA3    ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 Enable*/
#define AT91C_TSADC_CHENA4    ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 Enable*/
#define AT91C_TSADC_CHENA5    ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 Enable*/
/* -------- TSADC_CHDR : (TSADC Offset: 0x14) Channel Disable Register -------- */
#define AT91C_TSADC_CHDIS0    ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 Disable*/
#define AT91C_TSADC_CHDIS1    ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 Disable*/
#define AT91C_TSADC_CHDIS2    ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 Disable*/
#define AT91C_TSADC_CHDIS3    ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 Disable*/
#define AT91C_TSADC_CHDIS4    ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 Disable*/
#define AT91C_TSADC_CHDIS5    ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 Disable*/
/* -------- TSADC_CHSR : (TSADC Offset: 0x18) Channel Status Register -------- */
#define AT91C_TSADC_CHS0      ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 Status*/
#define AT91C_TSADC_CHS1      ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 Status*/
#define AT91C_TSADC_CHS2      ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 Status*/
#define AT91C_TSADC_CHS3      ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 Status*/
#define AT91C_TSADC_CHS4      ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 Status*/
#define AT91C_TSADC_CHS5      ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 Status*/
/* -------- TSADC_SR : (TSADC Offset: 0x1c) Status Register -------- */
#define AT91C_TSADC_EOC0      ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion*/
#define AT91C_TSADC_EOC1      ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion*/
#define AT91C_TSADC_EOC2      ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion*/
#define AT91C_TSADC_EOC3      ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion*/
#define AT91C_TSADC_EOC4      ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion*/
#define AT91C_TSADC_EOC5      ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion*/
#define AT91C_TSADC_OVRE0     ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error*/
#define AT91C_TSADC_OVRE1     ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error*/
#define AT91C_TSADC_OVRE2     ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error*/
#define AT91C_TSADC_OVRE3     ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error*/
#define AT91C_TSADC_OVRE4     ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error*/
#define AT91C_TSADC_OVRE5     ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error*/
#define AT91C_TSADC_DRDY      ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready*/
#define AT91C_TSADC_GOVRE     ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error*/
#define AT91C_TSADC_ENDRX     ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer*/
#define AT91C_TSADC_RXBUFF    ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full*/
#define AT91C_TSADC_PENCNT    ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact*/
#define AT91C_TSADC_NOCNT     ((unsigned int) 0x1 << 21) /* (TSADC) No Contact*/
/* -------- TSADC_LCDR : (TSADC Offset: 0x20) Last Converted Data Register -------- */
#define AT91C_TSADC_LDATA     ((unsigned int) 0x3FF <<  0) /* (TSADC) Last Converted Data*/
/* -------- TSADC_IER : (TSADC Offset: 0x24) Interrupt Enable Register -------- */
#define AT91C_TSADC_IENAEOC0  ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC1  ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC2  ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC3  ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC4  ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC5  ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE0 ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE1 ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE2 ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE3 ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE4 ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE5 ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENADRDY  ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready Interrupt Enable*/
#define AT91C_TSADC_IENAGOVRE ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAENDRX ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer Interrupt Enable*/
#define AT91C_TSADC_IENARXBUFF ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full Interrupt Enable*/
#define AT91C_TSADC_IENAPENCNT ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact Interrupt Enable*/
#define AT91C_TSADC_IENANOCNT ((unsigned int) 0x1 << 21) /* (TSADC) No Contact Interrupt Enable*/
/* -------- TSADC_IDR : (TSADC Offset: 0x28) Interrupt Disable Register -------- */
#define AT91C_TSADC_IDISEOC0  ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC1  ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC2  ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC3  ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC4  ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC5  ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE0 ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE1 ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE2 ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE3 ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE4 ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE5 ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISDRDY  ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready Interrupt Disable*/
#define AT91C_TSADC_IDISGOVRE ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISENDRX ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer Interrupt Disable*/
#define AT91C_TSADC_IDISRXBUFF ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full Interrupt Disable*/
#define AT91C_TSADC_IDISPENCNT ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact Interrupt Disable*/
#define AT91C_TSADC_IDISNOCNT ((unsigned int) 0x1 << 21) /* (TSADC) No Contact Interrupt Disable*/
/* -------- TSADC_IMR : (TSADC Offset: 0x2c) Interrupt Mask Register -------- */
#define AT91C_TSADC_IMSKEOC0  ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC1  ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC2  ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC3  ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC4  ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC5  ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE0 ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE1 ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE2 ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE3 ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE4 ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE5 ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKDRDY  ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready Interrupt Mask*/
#define AT91C_TSADC_IMSKGOVRE ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKENDRX ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer Interrupt Mask*/
#define AT91C_TSADC_IMSKRXBUFF ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full Interrupt Mask*/
#define AT91C_TSADC_IMSKPENCNT ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact Interrupt Mask*/
#define AT91C_TSADC_IMSKNOCNT ((unsigned int) 0x1 << 21) /* (TSADC) No Contact Interrupt Mask*/
/* -------- TSADC_CDR0 : (TSADC Offset: 0x30) Channel 0 Data Register -------- */
#define AT91C_TSADC_DATA0     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 0 Data*/
/* -------- TSADC_CDR1 : (TSADC Offset: 0x34) Channel 1 Data Register -------- */
#define AT91C_TSADC_DATA1     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 1 Data*/
/* -------- TSADC_CDR2 : (TSADC Offset: 0x38) Channel 2 Data Register -------- */
#define AT91C_TSADC_DATA2     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 2 Data*/
/* -------- TSADC_CDR3 : (TSADC Offset: 0x3c) Channel 3 Data Register -------- */
#define AT91C_TSADC_DATA3     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 3 Data*/
/* -------- TSADC_CDR4 : (TSADC Offset: 0x40) Channel 4 Data Register -------- */
#define AT91C_TSADC_DATA4     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 4 Data*/
/* -------- TSADC_CDR5 : (TSADC Offset: 0x44) Channel 5 Data Register -------- */
#define AT91C_TSADC_DATA5     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 5 Data*/

