una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS Enpoint FIFO data register*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS_EPTFIFO {
	AT91_REG	 UDPHS_READEPT0[16384]; 	/* FIFO Endpoint Data Register 0*/
	AT91_REG	 UDPHS_READEPT1[16384]; 	/* FIFO Endpoint Data Register 1*/
	AT91_REG	 UDPHS_READEPT2[16384]; 	/* FIFO Endpoint Data Register 2*/
	AT91_REG	 UDPHS_READEPT3[16384]; 	/* FIFO Endpoint Data Register 3*/
	AT91_REG	 UDPHS_READEPT4[16384]; 	/* FIFO Endpoint Data Register 4*/
	AT91_REG	 UDPHS_READEPT5[16384]; 	/* FIFO Endpoint Data Register 5*/
	AT91_REG	 UDPHS_READEPT6[16384]; 	/* FIFO Endpoint Data Register 6*/
	AT91_REG	 UDPHS_READEPT7[16384]; 	/* FIFO Endpoint Data Register 7*/
	AT91_REG	 UDPHS_READEPT8[16384]; 	/* FIFO Endpoint Data Register 8*/
	AT91_REG	 UDPHS_READEPT9[16384]; 	/* FIFO Endpoint Data Register 9*/
	AT91_REG	 UDPHS_READEPTA[16384]; 	/* FIFO Endpoint Data Register 10*/
	AT91_REG	 UDPHS_READEPTB[16384]; 	/* FIFO Endpoint Data Register 11*/
	AT91_REG	 UDPHS_READEPTC[16384]; 	/* FIFO Endpoint Data Register 12*/
	AT91_REG	 UDPHS_READEPTD[16384]; 	/* FIFO Endpoint Data Register 13*/
	AT91_REG	 UDPHS_READEPTE[16384]; 	/* FIFO Endpoint Data Register 14*/
	AT91_REG	 UDPHS_READEPTF[16384]; 	/* FIFO Endpoint Data Register 15*/
} AT91S_UDPHS_EPTFIFO, *AT91PS_UDPHS_EPTFIFO;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS Endpoint struct*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS_EPT {
	AT91_REG	 UDPHS_EPTCFG; 	/* UDPHS Endpoint Config Register*/
	AT91_REG	 UDPHS_EPTCTLENB; 	/* UDPHS Endpoint Control Enable Register*/
	AT91_REG	 UDPHS_EPTCTLDIS; 	/* UDPHS Endpoint Control Disable Register*/
	AT91_REG	 UDPHS_EPTCTL; 	/* UDPHS Endpoint Control Register*/
	AT91_REG	 Reserved0[1]; 	/* */
	AT91_REG	 UDPHS_EPTSETSTA; 	/* UDPHS Endpoint Set Status Register*/
	AT91_REG	 UDPHS_EPTCLRSTA; 	/* UDPHS Endpoint Clear Status Register*/
	AT91_REG	 UDPHS_EPTSTA; 	/* UDPHS Endpoint Status Register*/
} AT91S_UDPHS_EPT, *AT91PS_UDPHS_EPT;

/* -------- UDPHS_EPTCFG : (UDPHS_EPT Offset: 0x0) UDPHS Endpoint Config Register -------- */
#define AT91C_UDPHS_EPT_SIZE  ((unsigned int) 0x7 <<  0) /* (UDPHS_EPT) Endpoint Size*/
#define 	AT91C_UDPHS_EPT_SIZE_8                    ((unsigned int) 0x0) /* (UDPHS_EPT)    8 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_16                   ((unsigned int) 0x1) /* (UDPHS_EPT)   16 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_32                   ((unsigned int) 0x2) /* (UDPHS_EPT)   32 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_64                   ((unsigned int) 0x3) /* (UDPHS_EPT)   64 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_128                  ((unsigned int) 0x4) /* (UDPHS_EPT)  128 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_256                  ((unsigned int) 0x5) /* (UDPHS_EPT)  256 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_512                  ((unsigned int) 0x6) /* (UDPHS_EPT)  512 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_1024                 ((unsigned int) 0x7) /* (UDPHS_EPT) 1024 bytes*/
#define AT91C_UDPHS_EPT_DIR   ((unsigned int) 0x1 <<  3) /* (UDPHS_EPT) Endpoint Direction 0:OUT, 1:IN*/
#define 	AT91C_UDPHS_EPT_DIR_OUT                  ((unsigned int) 0x0 <<  3) /* (UDPHS_EPT) Direction OUT*/
#define 	AT91C_UDPHS_EPT_DIR_IN                   ((unsigned int) 0x1 <<  3) /* (UDPHS_EPT) Direction IN*/
#define AT91C_UDPHS_EPT_TYPE  ((unsigned int) 0x3 <<  4) /* (UDPHS_EPT) Endpoint Type*/
#define 	AT91C_UDPHS_EPT_TYPE_CTL_EPT              ((unsigned int) 0x0 <<  4) /* (UDPHS_EPT) Control endpoint*/
#define 	AT91C_UDPHS_EPT_TYPE_ISO_EPT              ((unsigned int) 0x1 <<  4) /* (UDPHS_EPT) Isochronous endpoint*/
#define 	AT91C_UDPHS_EPT_TYPE_BUL_EPT              ((unsigned int) 0x2 <<  4) /* (UDPHS_EPT) Bulk endpoint*/
#define 	AT91C_UDPHS_EPT_TYPE_INT_EPT              ((unsigned int) 0x3 <<  4) /* (UDPHS_EPT) Interrupt endpoint*/
#define AT91C_UDPHS_BK_NUMBER ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) Number of Banks*/
#define 	AT91C_UDPHS_BK_NUMBER_0                    ((unsigned int) 0x0 <<  6) /* (UDPHS_EPT) Zero Bank, the EndPoint is not mapped in memory*/
#define 	AT91C_UDPHS_BK_NUMBER_1                    ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) One Bank (Bank0)*/
#define 	AT91C_UDPHS_BK_NUMBER_2                    ((unsigned int) 0x2 <<  6) /* (UDPHS_EPT) Double bank (Ping-Pong : Bank0 / Bank1)*/
#define 	AT91C_UDPHS_BK_NUMBER_3                    ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) Triple Bank (Bank0 / Bank1 / Bank2)*/
#define AT91C_UDPHS_NB_TRANS  ((unsigned int) 0x3 <<  8) /* (UDPHS_EPT) Number Of Transaction per Micro-Frame (High-Bandwidth iso only)*/
#define AT91C_UDPHS_EPT_MAPD  ((unsigned int) 0x1 << 31) /* (UDPHS_EPT) Endpoint Mapped (read only*/
/* -------- UDPHS_EPTCTLENB : (UDPHS_EPT Offset: 0x4) UDPHS Endpoint Control Enable Register -------- */
#define AT91C_UDPHS_EPT_ENABL ((unsigned int) 0x1 <<  0) /* (UDPHS_EPT) Endpoint Enable*/
#define AT91C_UDPHS_AUTO_VALID ((unsigned int) 0x1 <<  1) /* (UDPHS_EPT) Packet Auto-Valid Enable/Disable*/
#define AT91C_UDPHS_INTDIS_DMA ((unsigned int) 0x1 <<  3) /* (UDPHS_EPT) Endpoint Interrupts DMA Request Enable/Disable*/
#define AT91C_UDPHS_NYET_DIS  ((unsigned int) 0x1 <<  4) /* (UDPHS_EPT) NYET Enable/Disable*/
#define AT91C_UDPHS_DATAX_RX  ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) DATAx Interrupt Enable/Disable*/
#define AT91C_UDPHS_MDATA_RX  ((unsigned int) 0x1 <<  7) /* (UDPHS_EPT) MDATA Interrupt Enabled/Disable*/
#define AT91C_UDPHS_ERR_OVFLW ((unsigned int) 0x1 <<  8) /* (UDPHS_EPT) OverFlow Error Interrupt Enable/Disable/Status*/
#define AT91C_UDPHS_RX_BK_RDY ((unsigned int) 0x1 <<  9) /* (UDPHS_EPT) Received OUT Data*/
#define AT91C_UDPHS_TX_COMPLT ((unsigned int) 0x1 << 10) /* (UDPHS_EPT) Transmitted IN Data Complete Interrupt Enable/Disable or Transmitted IN Data Complete (clear)*/
#define AT91C_UDPHS_ERR_TRANS ((unsigned int) 0x1 << 11) /* (UDPHS_EPT) Transaction Error Interrupt Enable/Disable*/
#define AT91C_UDPHS_TX_PK_RDY ((unsigned int) 0x1 << 11) /* (UDPHS_EPT) TX Packet Ready Interrupt Enable/Disable*/
#define AT91C_UDPHS_RX_SETUP  ((unsigned int) 0x1 << 12) /* (UDPHS_EPT) Received SETUP Interrupt Enable/Disable*/
#define AT91C_UDPHS_ERR_FL_ISO ((unsigned int) 0x1 << 12) /* (UDPHS_EPT) Error Flow Clear/Interrupt Enable/Disable*/
#define AT91C_UDPHS_STALL_SNT ((unsigned int) 0x1 << 13) /* (UDPHS_EPT) Stall Sent Clear*/
#define AT91C_UDPHS_ERR_CRISO ((unsigned int) 0x1 << 13) /* (UDPHS_EPT) CRC error / Error NB Trans / Interrupt Enable/Disable*/
#define AT91C_UDPHS_NAK_IN    ((unsigned int) 0x1 << 14) /* (UDPHS_EPT) NAKIN ERROR FLUSH / Clear / Interrupt Enable/Disable*/
#define AT91C_UDPHS_NAK_OUT   ((unsigned int) 0x1 << 15) /* (UDPHS_EPT) NAKOUT / Clear / Interrupt Enable/Disable*/
#define AT91C_UDPHS_BUSY_BANK ((unsigned int) 0x1 << 18) /* (UDPHS_EPT) Busy Bank Interrupt Enable/Disable*/
#define AT91C_UDPHS_SHRT_PCKT ((unsigned int) 0x1 << 31) /* (UDPHS_EPT) Short Packet / Interrupt Enable/Disable*/
/* -------- UDPHS_EPTCTLDIS : (UDPHS_EPT Offset: 0x8) UDPHS Endpoint Control Disable Register -------- */
#define AT91C_UDPHS_EPT_DISABL ((unsigned int) 0x1 <<  0) /* (UDPHS_EPT) Endpoint Disable*/
/* -------- UDPHS_EPTCTL : (UDPHS_EPT Offset: 0xc) UDPHS Endpoint Control Register -------- */
/* -------- UDPHS_EPTSETSTA : (UDPHS_EPT Offset: 0x14) UDPHS Endpoint Set Status Register -------- */
#define AT91C_UDPHS_FRCESTALL ((unsigned int) 0x1 <<  5) /* (UDPHS_EPT) Stall Handshake Request Set/Clear/Status*/
#define AT91C_UDPHS_KILL_BANK ((unsigned int) 0x1 <<  9) /* (UDPHS_EPT) KILL Bank*/
/* -------- UDPHS_EPTCLRSTA : (UDPHS_EPT Offset: 0x18) UDPHS Endpoint Clear Status Register -------- */
#define AT91C_UDPHS_TOGGLESQ  ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) Data Toggle Clear*/
/* -------- UDPHS_EPTSTA : (UDPHS_EPT Offset: 0x1c) UDPHS Endpoint Status Register -------- */
#define AT91C_UDPHS_TOGGLESQ_STA ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) Toggle Sequencing*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_00                   ((unsigned int) 0x0 <<  6) /* (UDPHS_EPT) Data0*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_01                   ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) Data1*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_10                   ((unsigned int) 0x2 <<  6) /* (UDPHS_EPT) Data2 (only for High-Bandwidth Isochronous EndPoint)*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_11                   ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) MData (only for High-Bandwidth Isochronous EndPoint)*/
#define AT91C_UDPHS_CONTROL_DIR ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) */
#define 	AT91C_UDPHS_CONTROL_DIR_00                   ((unsigned int) 0x0 << 16) /* (UDPHS_EPT) Bank 0*/
#define 	AT91C_UDPHS_CONTROL_DIR_01                   ((unsigned int) 0x1 << 16) /* (UDPHS_EPT) Bank 1*/
#define 	AT91C_UDPHS_CONTROL_DIR_10                   ((unsigned int) 0x2 << 16) /* (UDPHS_EPT) Bank 2*/
#define 	AT91C_UDPHS_CONTROL_DIR_11                   ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) Invalid*/
#define AT91C_UDPHS_CURRENT_BANK ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) */
#define 	AT91C_UDPHS_CURRENT_BANK_00                   ((unsigned int) 0x0 << 16) /* (UDPHS_EPT) Bank 0*/
#define 	AT91C_UDPHS_CURRENT_BANK_01                   ((unsigned int) 0x1 << 16) /* (UDPHS_EPT) Bank 1*/
#define 	AT91C_UDPHS_CURRENT_BANK_10                   ((unsigned int) 0x2 << 16) /* (UDPHS_EPT) Bank 2*/
#define 	AT91C_UDPHS_CURRENT_BANK_11                   ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) Invalid*/
#define AT91C_UDPHS_BUSY_BANK_STA ((unsigned int) 0x3 << 18) /* (UDPHS_EPT) Busy Bank Number*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_00                   ((unsigned int) 0x0 << 18) /* (UDPHS_EPT) All banks are free*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_01                   ((unsigned int) 0x1 << 18) /* (UDPHS_EPT) 1 busy bank*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_10                   ((unsigned int) 0x2 << 18) /* (UDPHS_EPT) 2 busy banks*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_11                   ((unsigned int) 0x3 << 18) /* (UDPHS_EPT) 3 busy banks*/
#define AT91C_UDPHS_BYTE_COUNT ((unsigned int) 0x7FF << 20) /* (UDPHS_EPT) UDPHS Byte Count*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS DMA struct*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS_DMA {
	AT91_REG	 UDPHS_DMANXTDSC; 	/* UDPHS DMA Channel Next Descriptor Address*/
	AT91_REG	 UDPHS_DMAADDRESS; 	/* UDPHS DMA Channel Address Register*/
	AT91_REG	 UDPHS_DMACONTROL; 	/* UDPHS DMA Channel Control Register*/
	AT91_REG	 UDPHS_DMASTATUS; 	/* UDPHS DMA Channel Status Register*/
} AT91S_UDPHS_DMA, *AT91PS_UDPHS_DMA;

/* -------- UDPHS_DMANXTDSC : (UDPHS_DMA Offset: 0x0) UDPHS DMA Next Descriptor Address Register -------- */
#define AT91C_UDPHS_NXT_DSC_ADD ((unsigned int) 0xFFFFFFF <<  4) /* (UDPHS_DMA) next Channel Descriptor*/
/* -------- UDPHS_DMAADDRESS : (UDPHS_DMA Offset: 0x4) UDPHS DMA Channel Address Register -------- */
#define AT91C_UDPHS_BUFF_ADD  ((unsigned int) 0x0 <<  0) /* (UDPHS_DMA) starting address of a DMA Channel transfer*/
/* -------- UDPHS_DMACONTROL : (UDPHS_DMA Offset: 0x8) UDPHS DMA Channel Control Register -------- */
#define AT91C_UDPHS_CHANN_ENB ((unsigned int) 0x1 <<  0) /* (UDPHS_DMA) Channel Enabled*/
#define AT91C_UDPHS_LDNXT_DSC ((unsigned int) 0x1 <<  1) /* (UDPHS_DMA) Load Next Channel Transfer Descriptor Enable*/
#define AT91C_UDPHS_END_TR_EN ((unsigned int) 0x1 <<  2) /* (UDPHS_DMA) Buffer Close Input Enable*/
#define AT91C_UDPHS_END_B_EN  ((unsigned int) 0x1 <<  3) /* (UDPHS_DMA) End of DMA Buffer Packet Validation*/
#define AT91C_UDPHS_END_TR_IT ((unsigned int) 0x1 <<  4) /* (UDPHS_DMA) End Of Transfer Interrupt Enable*/
#define AT91C_UDPHS_END_BUFFIT ((unsigned int) 0x1 <<  5) /* (UDPHS_DMA) End Of Channel Buffer Interrupt Enable*/
#define AT91C_UDPHS_DESC_LD_IT ((unsigned int) 0x1 <<  6) /* (UDPHS_DMA) Descriptor Loaded Interrupt Enable*/
#define AT91C_UDPHS_BURST_LCK ((unsigned int) 0x1 <<  7) /* (UDPHS_DMA) Burst Lock Enable*/
#define AT91C_UDPHS_BUFF_LENGTH ((unsigned int) 0xFFFF << 16) /* (UDPHS_DMA) Buffer Byte Length (write only)*/
/* -------- UDPHS_DMASTATUS : (UDPHS_DMA Offset: 0xc) UDPHS DMA Channelx Status Register -------- */
#define AT91C_UDPHS_CHANN_ACT ((unsigned int) 0x1 <<  1) /* (UDPHS_DMA) */
#define AT91C_UDPHS_END_TR_ST ((unsigned int) 0x1 <<  4) /* (UDPHS_DMA) */
#define AT91C_UDPHS_END_BF_ST ((unsigned int) 0x1 <<  5) /* (UDPHS_DMA) */
#define AT91C_UDPHS_DESC_LDST ((unsigned int) 0x1 <<  6) /* (UDPHS_DMA) */
#define AT91C_UDPHS_BUFF_COUNT ((unsigned int) 0xFFFF << 16) /* (UDPHS_DMA) */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS High Speed Device Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS {
	AT91_REG	 UDPHS_CTRL; 	/* UDPHS Control Register*/
	AT91_REG	 UDPHS_FNUM; 	/* UDPHS Frame Number Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 UDPHS_IEN; 	/* UDPHS Interrupt Enable Register*/
	AT91_REG	 UDPHS_INTSTA; 	/* UDPHS Interrupt Status Register*/
	AT91_REG	 UDPHS_CLRINT; 	/* UDPHS Clear Interrupt Register*/
	AT91_REG	 UDPHS_EPTRST; 	/* UDPHS Endpoints Reset Register*/
	AT91_REG	 Reserved1[44]; 	/* */
	AT91_REG	 UDPHS_TSTSOFCNT; 	/* UDPHS Test SOF Counter Register*/
	AT91_REG	 UDPHS_TSTCNTA; 	/* UDPHS Test A Counter Register*/
	AT91_REG	 UDPHS_TSTCNTB; 	/* UDPHS Test B Counter Register*/
	AT91_REG	 UDPHS_TSTMODREG; 	/* UDPHS Test Mode Register*/
	AT91_REG	 UDPHS_TST; 	/* UDPHS Test Register*/
	AT91_REG	 Reserved2[2]; 	/* */
	AT91_REG	 UDPHS_RIPPADDRSIZE; 	/* UDPHS PADDRSIZE Register*/
	AT91_REG	 UDPHS_RIPNAME1; 	/* UDPHS Name1 Register*/
	AT91_REG	 UDPHS_RIPNAME2; 	/* UDPHS Name2 Register*/
	AT91_REG	 UDPHS_IPFEATURES; 	/* UDPHS Features Register*/
	AT91_REG	 UDPHS_IPVERSION; 	/* UDPHS Version Register*/
	AT91S_UDPHS_EPT	 UDPHS_EPT[16]; 	/* UDPHS Endpoint struct*/
	AT91S_UDPHS_DMA	 UDPHS_DMA[8]; 	/* UDPHS DMA channel struct (not use [0])*/
} AT91S_UDPHS, *AT91PS_UDPHS;

