una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* -------- UDPHS_CTRL : (UDPHS Offset: 0x0) UDPHS Control Register -------- */
#define AT91C_UDPHS_DEV_ADDR  ((unsigned int) 0x7F <<  0) /* (UDPHS) UDPHS Address*/
#define AT91C_UDPHS_FADDR_EN  ((unsigned int) 0x1 <<  7) /* (UDPHS) Function Address Enable*/
#define AT91C_UDPHS_EN_UDPHS  ((unsigned int) 0x1 <<  8) /* (UDPHS) UDPHS Enable*/
#define AT91C_UDPHS_DETACH    ((unsigned int) 0x1 <<  9) /* (UDPHS) Detach Command*/
#define AT91C_UDPHS_REWAKEUP  ((unsigned int) 0x1 << 10) /* (UDPHS) Send Remote Wake Up*/
#define AT91C_UDPHS_PULLD_DIS ((unsigned int) 0x1 << 11) /* (UDPHS) PullDown Disable*/
/* -------- UDPHS_FNUM : (UDPHS Offset: 0x4) UDPHS Frame Number Register -------- */
#define AT91C_UDPHS_MICRO_FRAME_NUM ((unsigned int) 0x7 <<  0) /* (UDPHS) Micro Frame Number*/
#define AT91C_UDPHS_FRAME_NUMBER ((unsigned int) 0x7FF <<  3) /* (UDPHS) Frame Number as defined in the Packet Field Formats*/
#define AT91C_UDPHS_FNUM_ERR  ((unsigned int) 0x1 << 31) /* (UDPHS) Frame Number CRC Error*/
/* -------- UDPHS_IEN : (UDPHS Offset: 0x10) UDPHS Interrupt Enable Register -------- */
#define AT91C_UDPHS_DET_SUSPD ((unsigned int) 0x1 <<  1) /* (UDPHS) Suspend Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_MICRO_SOF ((unsigned int) 0x1 <<  2) /* (UDPHS) Micro-SOF Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_IEN_SOF   ((unsigned int) 0x1 <<  3) /* (UDPHS) SOF Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_ENDRESET  ((unsigned int) 0x1 <<  4) /* (UDPHS) End Of Reset Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_WAKE_UP   ((unsigned int) 0x1 <<  5) /* (UDPHS) Wake Up CPU Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_ENDOFRSM  ((unsigned int) 0x1 <<  6) /* (UDPHS) End Of Resume Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_UPSTR_RES ((unsigned int) 0x1 <<  7) /* (UDPHS) Upstream Resume Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_EPT_INT_0 ((unsigned int) 0x1 <<  8) /* (UDPHS) Endpoint 0 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_1 ((unsigned int) 0x1 <<  9) /* (UDPHS) Endpoint 1 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_2 ((unsigned int) 0x1 << 10) /* (UDPHS) Endpoint 2 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_3 ((unsigned int) 0x1 << 11) /* (UDPHS) Endpoint 3 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_4 ((unsigned int) 0x1 << 12) /* (UDPHS) Endpoint 4 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_5 ((unsigned int) 0x1 << 13) /* (UDPHS) Endpoint 5 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_6 ((unsigned int) 0x1 << 14) /* (UDPHS) Endpoint 6 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_7 ((unsigned int) 0x1 << 15) /* (UDPHS) Endpoint 7 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_8 ((unsigned int) 0x1 << 16) /* (UDPHS) Endpoint 8 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_9 ((unsigned int) 0x1 << 17) /* (UDPHS) Endpoint 9 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_10 ((unsigned int) 0x1 << 18) /* (UDPHS) Endpoint 10 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_11 ((unsigned int) 0x1 << 19) /* (UDPHS) Endpoint 11 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_12 ((unsigned int) 0x1 << 20) /* (UDPHS) Endpoint 12 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_13 ((unsigned int) 0x1 << 21) /* (UDPHS) Endpoint 13 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_14 ((unsigned int) 0x1 << 22) /* (UDPHS) Endpoint 14 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_15 ((unsigned int) 0x1 << 23) /* (UDPHS) Endpoint 15 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_1 ((unsigned int) 0x1 << 25) /* (UDPHS) DMA Channel 1 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_2 ((unsigned int) 0x1 << 26) /* (UDPHS) DMA Channel 2 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_3 ((unsigned int) 0x1 << 27) /* (UDPHS) DMA Channel 3 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_4 ((unsigned int) 0x1 << 28) /* (UDPHS) DMA Channel 4 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_5 ((unsigned int) 0x1 << 29) /* (UDPHS) DMA Channel 5 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_6 ((unsigned int) 0x1 << 30) /* (UDPHS) DMA Channel 6 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_7 ((unsigned int) 0x1 << 31) /* (UDPHS) DMA Channel 7 Interrupt Enable/Status*/
/* -------- UDPHS_INTSTA : (UDPHS Offset: 0x14) UDPHS Interrupt Status Register -------- */
#define AT91C_UDPHS_SPEED     ((unsigned int) 0x1 <<  0) /* (UDPHS) Speed Status*/
/* -------- UDPHS_CLRINT : (UDPHS Offset: 0x18) UDPHS Clear Interrupt Register -------- */
/* -------- UDPHS_EPTRST : (UDPHS Offset: 0x1c) UDPHS Endpoints Reset Register -------- */
#define AT91C_UDPHS_RST_EPT_0 ((unsigned int) 0x1 <<  0) /* (UDPHS) Endpoint Reset 0*/
#define AT91C_UDPHS_RST_EPT_1 ((unsigned int) 0x1 <<  1) /* (UDPHS) Endpoint Reset 1*/
#define AT91C_UDPHS_RST_EPT_2 ((unsigned int) 0x1 <<  2) /* (UDPHS) Endpoint Reset 2*/
#define AT91C_UDPHS_RST_EPT_3 ((unsigned int) 0x1 <<  3) /* (UDPHS) Endpoint Reset 3*/
#define AT91C_UDPHS_RST_EPT_4 ((unsigned int) 0x1 <<  4) /* (UDPHS) Endpoint Reset 4*/
#define AT91C_UDPHS_RST_EPT_5 ((unsigned int) 0x1 <<  5) /* (UDPHS) Endpoint Reset 5*/
#define AT91C_UDPHS_RST_EPT_6 ((unsigned int) 0x1 <<  6) /* (UDPHS) Endpoint Reset 6*/
#define AT91C_UDPHS_RST_EPT_7 ((unsigned int) 0x1 <<  7) /* (UDPHS) Endpoint Reset 7*/
#define AT91C_UDPHS_RST_EPT_8 ((unsigned int) 0x1 <<  8) /* (UDPHS) Endpoint Reset 8*/
#define AT91C_UDPHS_RST_EPT_9 ((unsigned int) 0x1 <<  9) /* (UDPHS) Endpoint Reset 9*/
#define AT91C_UDPHS_RST_EPT_10 ((unsigned int) 0x1 << 10) /* (UDPHS) Endpoint Reset 10*/
#define AT91C_UDPHS_RST_EPT_11 ((unsigned int) 0x1 << 11) /* (UDPHS) Endpoint Reset 11*/
#define AT91C_UDPHS_RST_EPT_12 ((unsigned int) 0x1 << 12) /* (UDPHS) Endpoint Reset 12*/
#define AT91C_UDPHS_RST_EPT_13 ((unsigned int) 0x1 << 13) /* (UDPHS) Endpoint Reset 13*/
#define AT91C_UDPHS_RST_EPT_14 ((unsigned int) 0x1 << 14) /* (UDPHS) Endpoint Reset 14*/
#define AT91C_UDPHS_RST_EPT_15 ((unsigned int) 0x1 << 15) /* (UDPHS) Endpoint Reset 15*/
/* -------- UDPHS_TSTSOFCNT : (UDPHS Offset: 0xd0) UDPHS Test SOF Counter Register -------- */
#define AT91C_UDPHS_SOFCNTMAX ((unsigned int) 0x3 <<  0) /* (UDPHS) SOF Counter Max Value*/
#define AT91C_UDPHS_SOFCTLOAD ((unsigned int) 0x1 <<  7) /* (UDPHS) SOF Counter Load*/
/* -------- UDPHS_TSTCNTA : (UDPHS Offset: 0xd4) UDPHS Test A Counter Register -------- */
#define AT91C_UDPHS_CNTAMAX   ((unsigned int) 0x7FFF <<  0) /* (UDPHS) A Counter Max Value*/
#define AT91C_UDPHS_CNTALOAD  ((unsigned int) 0x1 << 15) /* (UDPHS) A Counter Load*/
/* -------- UDPHS_TSTCNTB : (UDPHS Offset: 0xd8) UDPHS Test B Counter Register -------- */
#define AT91C_UDPHS_CNTBMAX   ((unsigned int) 0x7FFF <<  0) /* (UDPHS) B Counter Max Value*/
#define AT91C_UDPHS_CNTBLOAD  ((unsigned int) 0x1 << 15) /* (UDPHS) B Counter Load*/
/* -------- UDPHS_TSTMODREG : (UDPHS Offset: 0xdc) UDPHS Test Mode Register -------- */
#define AT91C_UDPHS_TSTMODE   ((unsigned int) 0x1F <<  1) /* (UDPHS) UDPHS Core TestModeReg*/
/* -------- UDPHS_TST : (UDPHS Offset: 0xe0) UDPHS Test Register -------- */
#define AT91C_UDPHS_SPEED_CFG ((unsigned int) 0x3 <<  0) /* (UDPHS) Speed Configuration*/
#define 	AT91C_UDPHS_SPEED_CFG_NM                   ((unsigned int) 0x0) /* (UDPHS) Normal Mode*/
#define 	AT91C_UDPHS_SPEED_CFG_RS                   ((unsigned int) 0x1) /* (UDPHS) Reserved*/
#define 	AT91C_UDPHS_SPEED_CFG_HS                   ((unsigned int) 0x2) /* (UDPHS) Force High Speed*/
#define 	AT91C_UDPHS_SPEED_CFG_FS                   ((unsigned int) 0x3) /* (UDPHS) Force Full-Speed*/
#define AT91C_UDPHS_TST_J     ((unsigned int) 0x1 <<  2) /* (UDPHS) TestJMode*/
#define AT91C_UDPHS_TST_K     ((unsigned int) 0x1 <<  3) /* (UDPHS) TestKMode*/
#define AT91C_UDPHS_TST_PKT   ((unsigned int) 0x1 <<  4) /* (UDPHS) TestPacketMode*/
#define AT91C_UDPHS_OPMODE2   ((unsigned int) 0x1 <<  5) /* (UDPHS) OpMode2*/
/* -------- UDPHS_RIPPADDRSIZE : (UDPHS Offset: 0xec) UDPHS PADDRSIZE Register -------- */
#define AT91C_UDPHS_IPPADDRSIZE ((unsigned int) 0x0 <<  0) /* (UDPHS) 2^UDPHSDEV_PADDR_SIZE*/
/* -------- UDPHS_RIPNAME1 : (UDPHS Offset: 0xf0) UDPHS Name Register -------- */
#define AT91C_UDPHS_IPNAME1   ((unsigned int) 0x0 <<  0) /* (UDPHS) ASCII string HUSB*/
/* -------- UDPHS_RIPNAME2 : (UDPHS Offset: 0xf4) UDPHS Name Register -------- */
#define AT91C_UDPHS_IPNAME2   ((unsigned int) 0x0 <<  0) /* (UDPHS) ASCII string 2DEV*/
/* -------- UDPHS_IPFEATURES : (UDPHS Offset: 0xf8) UDPHS Features Register -------- */
#define AT91C_UDPHS_EPT_NBR_MAX ((unsigned int) 0xF <<  0) /* (UDPHS) Max Number of Endpoints*/
#define AT91C_UDPHS_DMA_CHANNEL_NBR ((unsigned int) 0x7 <<  4) /* (UDPHS) Number of DMA Channels*/
#define AT91C_UDPHS_DMA_B_SIZ ((unsigned int) 0x1 <<  7) /* (UDPHS) DMA Buffer Size*/
#define AT91C_UDPHS_DMA_FIFO_WORD_DEPTH ((unsigned int) 0xF <<  8) /* (UDPHS) DMA FIFO Depth in words*/
#define AT91C_UDPHS_FIFO_MAX_SIZE ((unsigned int) 0x7 << 12) /* (UDPHS) DPRAM size*/
#define AT91C_UDPHS_BW_DPRAM  ((unsigned int) 0x1 << 15) /* (UDPHS) DPRAM byte write capability*/
#define AT91C_UDPHS_DATAB16_8 ((unsigned int) 0x1 << 16) /* (UDPHS) UTMI DataBus16_8*/
#define AT91C_UDPHS_ISO_EPT_1 ((unsigned int) 0x1 << 17) /* (UDPHS) Endpoint 1 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_2 ((unsigned int) 0x1 << 18) /* (UDPHS) Endpoint 2 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_3 ((unsigned int) 0x1 << 19) /* (UDPHS) Endpoint 3 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_4 ((unsigned int) 0x1 << 20) /* (UDPHS) Endpoint 4 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_5 ((unsigned int) 0x1 << 21) /* (UDPHS) Endpoint 5 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_6 ((unsigned int) 0x1 << 22) /* (UDPHS) Endpoint 6 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_7 ((unsigned int) 0x1 << 23) /* (UDPHS) Endpoint 7 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_8 ((unsigned int) 0x1 << 24) /* (UDPHS) Endpoint 8 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_9 ((unsigned int) 0x1 << 25) /* (UDPHS) Endpoint 9 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_10 ((unsigned int) 0x1 << 26) /* (UDPHS) Endpoint 10 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_11 ((unsigned int) 0x1 << 27) /* (UDPHS) Endpoint 11 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_12 ((unsigned int) 0x1 << 28) /* (UDPHS) Endpoint 12 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_13 ((unsigned int) 0x1 << 29) /* (UDPHS) Endpoint 13 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_14 ((unsigned int) 0x1 << 30) /* (UDPHS) Endpoint 14 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_15 ((unsigned int) 0x1 << 31) /* (UDPHS) Endpoint 15 High Bandwidth Isochronous Capability*/
/* -------- UDPHS_IPVERSION : (UDPHS Offset: 0xfc) UDPHS Version Register -------- */
#define AT91C_UDPHS_VERSION_NUM ((unsigned int) 0xFFFF <<  0) /* (UDPHS) Give the IP version*/
#define AT91C_UDPHS_METAL_FIX_NUM ((unsigned int) 0x7 << 16) /* (UDPHS) Give the number of metal fixes*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR AC97 Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_AC97C {
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AC97C_MR; 	/* Mode Register*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 AC97C_ICA; 	/* Input Channel AssignementRegister*/
	AT91_REG	 AC97C_OCA; 	/* Output Channel Assignement Register*/
	AT91_REG	 Reserved2[2]; 	/* */
	AT91_REG	 AC97C_CARHR; 	/* Channel A Receive Holding Register*/
	AT91_REG	 AC97C_CATHR; 	/* Channel A Transmit Holding Register*/
	AT91_REG	 AC97C_CASR; 	/* Channel A Status Register*/
	AT91_REG	 AC97C_CAMR; 	/* Channel A Mode Register*/
	AT91_REG	 AC97C_CBRHR; 	/* Channel B Receive Holding Register (optional)*/
	AT91_REG	 AC97C_CBTHR; 	/* Channel B Transmit Holding Register (optional)*/
	AT91_REG	 AC97C_CBSR; 	/* Channel B Status Register*/
	AT91_REG	 AC97C_CBMR; 	/* Channel B Mode Register*/
	AT91_REG	 AC97C_CORHR; 	/* COdec Transmit Holding Register*/
	AT91_REG	 AC97C_COTHR; 	/* COdec Transmit Holding Register*/
	AT91_REG	 AC97C_COSR; 	/* CODEC Status Register*/
	AT91_REG	 AC97C_COMR; 	/* CODEC Mask Status Register*/
	AT91_REG	 AC97C_SR; 	/* Status Register*/
	AT91_REG	 AC97C_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 AC97C_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 AC97C_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved3[39]; 	/* */
	AT91_REG	 AC97C_VERSION; 	/* Version Register*/
	AT91_REG	 AC97C_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 AC97C_RCR; 	/* Receive Counter Register*/
	AT91_REG	 AC97C_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 AC97C_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 AC97C_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 AC97C_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 AC97C_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 AC97C_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 AC97C_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 AC97C_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_AC97C, *AT91PS_AC97C;

