una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* -------- LCDC_FRMP1 : (LCDC Offset: 0x8) DMA Frame Pointer 1 Register -------- */
#define AT91C_LCDC_FRMPT1     ((unsigned int) 0x3FFFFF <<  0) /* (LCDC) Frame Pointer Address 1*/
/* -------- LCDC_FRMP2 : (LCDC Offset: 0xc) DMA Frame Pointer 2 Register -------- */
#define AT91C_LCDC_FRMPT2     ((unsigned int) 0x1FFFFF <<  0) /* (LCDC) Frame Pointer Address 2*/
/* -------- LCDC_FRMCFG : (LCDC Offset: 0x18) DMA Frame Config Register -------- */
#define AT91C_LCDC_FRSIZE     ((unsigned int) 0x3FFFFF <<  0) /* (LCDC) FRAME SIZE*/
#define AT91C_LCDC_BLENGTH    ((unsigned int) 0xF << 24) /* (LCDC) BURST LENGTH*/
/* -------- LCDC_DMACON : (LCDC Offset: 0x1c) DMA Control Register -------- */
#define AT91C_LCDC_DMAEN      ((unsigned int) 0x1 <<  0) /* (LCDC) DAM Enable*/
#define AT91C_LCDC_DMARST     ((unsigned int) 0x1 <<  1) /* (LCDC) DMA Reset (WO)*/
#define AT91C_LCDC_DMABUSY    ((unsigned int) 0x1 <<  2) /* (LCDC) DMA Reset (WO)*/
#define AT91C_LCDC_DMAUPDT    ((unsigned int) 0x1 <<  3) /* (LCDC) DMA Configuration Update*/
#define AT91C_LCDC_DMA2DEN    ((unsigned int) 0x1 <<  4) /* (LCDC) 2D Addressing Enable*/
/* -------- LCDC_DMA2DCFG : (LCDC Offset: 0x20) DMA 2D addressing configuration Register -------- */
#define AT91C_LCDC_ADDRINC    ((unsigned int) 0xFFFF <<  0) /* (LCDC) Number of 32b words that the DMA must jump when going to the next line*/
#define AT91C_LCDC_PIXELOFF   ((unsigned int) 0x1F << 24) /* (LCDC) Offset (in bits) of the first pixel of the screen in the memory word which contain it*/
/* -------- LCDC_LCDCON1 : (LCDC Offset: 0x800) LCD Control 1 Register -------- */
#define AT91C_LCDC_BYPASS     ((unsigned int) 0x1 <<  0) /* (LCDC) Bypass lcd_pccklk divider*/
#define AT91C_LCDC_CLKVAL     ((unsigned int) 0x1FF << 12) /* (LCDC) 9-bit Divider for pixel clock frequency*/
#define AT91C_LCDC_LINCNT     ((unsigned int) 0x7FF << 21) /* (LCDC) Line Counter (RO)*/
/* -------- LCDC_LCDCON2 : (LCDC Offset: 0x804) LCD Control 2 Register -------- */
#define AT91C_LCDC_DISTYPE    ((unsigned int) 0x3 <<  0) /* (LCDC) Display Type*/
#define 	AT91C_LCDC_DISTYPE_STNMONO              ((unsigned int) 0x0) /* (LCDC) STN Mono*/
#define 	AT91C_LCDC_DISTYPE_STNCOLOR             ((unsigned int) 0x1) /* (LCDC) STN Color*/
#define 	AT91C_LCDC_DISTYPE_TFT                  ((unsigned int) 0x2) /* (LCDC) TFT*/
#define AT91C_LCDC_SCANMOD    ((unsigned int) 0x1 <<  2) /* (LCDC) Scan Mode*/
#define 	AT91C_LCDC_SCANMOD_SINGLESCAN           ((unsigned int) 0x0 <<  2) /* (LCDC) Single Scan*/
#define 	AT91C_LCDC_SCANMOD_DUALSCAN             ((unsigned int) 0x1 <<  2) /* (LCDC) Dual Scan*/
#define AT91C_LCDC_IFWIDTH    ((unsigned int) 0x3 <<  3) /* (LCDC) Interface Width*/
#define 	AT91C_LCDC_IFWIDTH_FOURBITSWIDTH        ((unsigned int) 0x0 <<  3) /* (LCDC) 4 Bits*/
#define 	AT91C_LCDC_IFWIDTH_EIGTHBITSWIDTH       ((unsigned int) 0x1 <<  3) /* (LCDC) 8 Bits*/
#define 	AT91C_LCDC_IFWIDTH_SIXTEENBITSWIDTH     ((unsigned int) 0x2 <<  3) /* (LCDC) 16 Bits*/
#define AT91C_LCDC_PIXELSIZE  ((unsigned int) 0x7 <<  5) /* (LCDC) Bits per pixel*/
#define 	AT91C_LCDC_PIXELSIZE_ONEBITSPERPIXEL      ((unsigned int) 0x0 <<  5) /* (LCDC) 1 Bits*/
#define 	AT91C_LCDC_PIXELSIZE_TWOBITSPERPIXEL      ((unsigned int) 0x1 <<  5) /* (LCDC) 2 Bits*/
#define 	AT91C_LCDC_PIXELSIZE_FOURBITSPERPIXEL     ((unsigned int) 0x2 <<  5) /* (LCDC) 4 Bits*/
#define 	AT91C_LCDC_PIXELSIZE_EIGTHBITSPERPIXEL    ((unsigned int) 0x3 <<  5) /* (LCDC) 8 Bits*/
#define 	AT91C_LCDC_PIXELSIZE_SIXTEENBITSPERPIXEL  ((unsigned int) 0x4 <<  5) /* (LCDC) 16 Bits*/
#define 	AT91C_LCDC_PIXELSIZE_TWENTYFOURBITSPERPIXEL ((unsigned int) 0x5 <<  5) /* (LCDC) 24 Bits*/
#define AT91C_LCDC_INVVD      ((unsigned int) 0x1 <<  8) /* (LCDC) lcd datas polarity*/
#define 	AT91C_LCDC_INVVD_NORMALPOL            ((unsigned int) 0x0 <<  8) /* (LCDC) Normal Polarity*/
#define 	AT91C_LCDC_INVVD_INVERTEDPOL          ((unsigned int) 0x1 <<  8) /* (LCDC) Inverted Polarity*/
#define AT91C_LCDC_INVFRAME   ((unsigned int) 0x1 <<  9) /* (LCDC) lcd vsync polarity*/
#define 	AT91C_LCDC_INVFRAME_NORMALPOL            ((unsigned int) 0x0 <<  9) /* (LCDC) Normal Polarity*/
#define 	AT91C_LCDC_INVFRAME_INVERTEDPOL          ((unsigned int) 0x1 <<  9) /* (LCDC) Inverted Polarity*/
#define AT91C_LCDC_INVLINE    ((unsigned int) 0x1 << 10) /* (LCDC) lcd hsync polarity*/
#define 	AT91C_LCDC_INVLINE_NORMALPOL            ((unsigned int) 0x0 << 10) /* (LCDC) Normal Polarity*/
#define 	AT91C_LCDC_INVLINE_INVERTEDPOL          ((unsigned int) 0x1 << 10) /* (LCDC) Inverted Polarity*/
#define AT91C_LCDC_INVCLK     ((unsigned int) 0x1 << 11) /* (LCDC) lcd pclk polarity*/
#define 	AT91C_LCDC_INVCLK_NORMALPOL            ((unsigned int) 0x0 << 11) /* (LCDC) Normal Polarity*/
#define 	AT91C_LCDC_INVCLK_INVERTEDPOL          ((unsigned int) 0x1 << 11) /* (LCDC) Inverted Polarity*/
#define AT91C_LCDC_INVDVAL    ((unsigned int) 0x1 << 12) /* (LCDC) lcd dval polarity*/
#define 	AT91C_LCDC_INVDVAL_NORMALPOL            ((unsigned int) 0x0 << 12) /* (LCDC) Normal Polarity*/
#define 	AT91C_LCDC_INVDVAL_INVERTEDPOL          ((unsigned int) 0x1 << 12) /* (LCDC) Inverted Polarity*/
#define AT91C_LCDC_CLKMOD     ((unsigned int) 0x1 << 15) /* (LCDC) lcd pclk Mode*/
#define 	AT91C_LCDC_CLKMOD_ACTIVEONLYDISP       ((unsigned int) 0x0 << 15) /* (LCDC) Active during display period*/
#define 	AT91C_LCDC_CLKMOD_ALWAYSACTIVE         ((unsigned int) 0x1 << 15) /* (LCDC) Always Active*/
#define AT91C_LCDC_MEMOR      ((unsigned int) 0x1 << 31) /* (LCDC) lcd pclk Mode*/
#define 	AT91C_LCDC_MEMOR_BIGIND               ((unsigned int) 0x0 << 31) /* (LCDC) Big Endian*/
#define 	AT91C_LCDC_MEMOR_LITTLEIND            ((unsigned int) 0x1 << 31) /* (LCDC) Little Endian*/
/* -------- LCDC_TIM1 : (LCDC Offset: 0x808) LCDC Timing Config 1 Register -------- */
#define AT91C_LCDC_VFP        ((unsigned int) 0xFF <<  0) /* (LCDC) Vertical Front Porch*/
#define AT91C_LCDC_VBP        ((unsigned int) 0xFF <<  8) /* (LCDC) Vertical Back Porch*/
#define AT91C_LCDC_VPW        ((unsigned int) 0x3F << 16) /* (LCDC) Vertical Synchronization Pulse Width*/
#define AT91C_LCDC_VHDLY      ((unsigned int) 0xF << 24) /* (LCDC) Vertical to Horizontal Delay*/
/* -------- LCDC_TIM2 : (LCDC Offset: 0x80c) LCDC Timing Config 2 Register -------- */
#define AT91C_LCDC_HBP        ((unsigned int) 0xFF <<  0) /* (LCDC) Horizontal Back Porch*/
#define AT91C_LCDC_HPW        ((unsigned int) 0x3F <<  8) /* (LCDC) Horizontal Synchronization Pulse Width*/
#define AT91C_LCDC_HFP        ((unsigned int) 0x3FF << 22) /* (LCDC) Horizontal Front Porch*/
/* -------- LCDC_LCDFRCFG : (LCDC Offset: 0x810) LCD Frame Config Register -------- */
#define AT91C_LCDC_LINEVAL    ((unsigned int) 0x7FF <<  0) /* (LCDC) Vertical Size of LCD Module*/
#define AT91C_LCDC_HOZVAL     ((unsigned int) 0x7FF << 21) /* (LCDC) Horizontal Size of LCD Module*/
/* -------- LCDC_FIFO : (LCDC Offset: 0x814) LCD FIFO Register -------- */
#define AT91C_LCDC_FIFOTH     ((unsigned int) 0xFFFF <<  0) /* (LCDC) FIFO Threshold*/
/* -------- LCDC_MVAL : (LCDC Offset: 0x818) LCD Mode Toggle Rate Value Register -------- */
#define AT91C_LCDC_MVALUE     ((unsigned int) 0xFF <<  0) /* (LCDC) Toggle Rate Value*/
#define AT91C_LCDC_MMODE      ((unsigned int) 0x1 << 31) /* (LCDC) Toggle Rate Sel*/
#define 	AT91C_LCDC_MMODE_EACHFRAME            ((unsigned int) 0x0 << 31) /* (LCDC) Each Frame*/
#define 	AT91C_LCDC_MMODE_MVALDEFINED          ((unsigned int) 0x1 << 31) /* (LCDC) Defined by MVAL*/
/* -------- LCDC_DP1_2 : (LCDC Offset: 0x81c) Dithering Pattern 1/2 -------- */
#define AT91C_LCDC_DP1_2_FIELD ((unsigned int) 0xFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP4_7 : (LCDC Offset: 0x820) Dithering Pattern 4/7 -------- */
#define AT91C_LCDC_DP4_7_FIELD ((unsigned int) 0xFFFFFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP3_5 : (LCDC Offset: 0x824) Dithering Pattern 3/5 -------- */
#define AT91C_LCDC_DP3_5_FIELD ((unsigned int) 0xFFFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP2_3 : (LCDC Offset: 0x828) Dithering Pattern 2/3 -------- */
#define AT91C_LCDC_DP2_3_FIELD ((unsigned int) 0xFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP5_7 : (LCDC Offset: 0x82c) Dithering Pattern 5/7 -------- */
#define AT91C_LCDC_DP5_7_FIELD ((unsigned int) 0xFFFFFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP3_4 : (LCDC Offset: 0x830) Dithering Pattern 3/4 -------- */
#define AT91C_LCDC_DP3_4_FIELD ((unsigned int) 0xFFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP4_5 : (LCDC Offset: 0x834) Dithering Pattern 4/5 -------- */
#define AT91C_LCDC_DP4_5_FIELD ((unsigned int) 0xFFFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_DP6_7 : (LCDC Offset: 0x838) Dithering Pattern 6/7 -------- */
#define AT91C_LCDC_DP6_7_FIELD ((unsigned int) 0xFFFFFFF <<  0) /* (LCDC) Ratio*/
/* -------- LCDC_PWRCON : (LCDC Offset: 0x83c) LCDC Power Control Register -------- */
#define AT91C_LCDC_PWR        ((unsigned int) 0x1 <<  0) /* (LCDC) LCD Module Power Control*/
#define AT91C_LCDC_GUARDT     ((unsigned int) 0x7F <<  1) /* (LCDC) Delay in Frame Period*/
#define AT91C_LCDC_BUSY       ((unsigned int) 0x1 << 31) /* (LCDC) Read Only : 1 indicates that LCDC is busy*/
#define 	AT91C_LCDC_BUSY_LCDNOTBUSY           ((unsigned int) 0x0 << 31) /* (LCDC) LCD is Not Busy*/
#define 	AT91C_LCDC_BUSY_LCDBUSY              ((unsigned int) 0x1 << 31) /* (LCDC) LCD is Busy*/
/* -------- LCDC_CTRSTCON : (LCDC Offset: 0x840) LCDC Contrast Control Register -------- */
#define AT91C_LCDC_PS         ((unsigned int) 0x3 <<  0) /* (LCDC) LCD Contrast Counter Prescaler*/
#define 	AT91C_LCDC_PS_NOTDIVIDED           ((unsigned int) 0x0) /* (LCDC) Counter Freq is System Freq.*/
#define 	AT91C_LCDC_PS_DIVIDEDBYTWO         ((unsigned int) 0x1) /* (LCDC) Counter Freq is System Freq divided by 2.*/
#define 	AT91C_LCDC_PS_DIVIDEDBYFOUR        ((unsigned int) 0x2) /* (LCDC) Counter Freq is System Freq divided by 4.*/
#define 	AT91C_LCDC_PS_DIVIDEDBYEIGHT       ((unsigned int) 0x3) /* (LCDC) Counter Freq is System Freq divided by 8.*/
#define AT91C_LCDC_POL        ((unsigned int) 0x1 <<  2) /* (LCDC) Polarity of output Pulse*/
#define 	AT91C_LCDC_POL_NEGATIVEPULSE        ((unsigned int) 0x0 <<  2) /* (LCDC) Negative Pulse*/
#define 	AT91C_LCDC_POL_POSITIVEPULSE        ((unsigned int) 0x1 <<  2) /* (LCDC) Positive Pulse*/
#define AT91C_LCDC_ENA        ((unsigned int) 0x1 <<  3) /* (LCDC) PWM generator Control*/
#define 	AT91C_LCDC_ENA_PWMGEMDISABLED       ((unsigned int) 0x0 <<  3) /* (LCDC) PWM Generator Disabled*/
#define 	AT91C_LCDC_ENA_PWMGEMENABLED        ((unsigned int) 0x1 <<  3) /* (LCDC) PWM Generator Disabled*/
/* -------- LCDC_CTRSTVAL : (LCDC Offset: 0x844) Contrast Value Register -------- */
#define AT91C_LCDC_CVAL       ((unsigned int) 0xFF <<  0) /* (LCDC) PWM Compare Value*/
/* -------- LCDC_IER : (LCDC Offset: 0x848) LCDC Interrupt Enable Register -------- */
#define AT91C_LCDC_LNI        ((unsigned int) 0x1 <<  0) /* (LCDC) Line Interrupt*/
#define AT91C_LCDC_LSTLNI     ((unsigned int) 0x1 <<  1) /* (LCDC) Last Line Interrupt*/
#define AT91C_LCDC_EOFI       ((unsigned int) 0x1 <<  2) /* (LCDC) End Of Frame Interrupt*/
#define AT91C_LCDC_UFLWI      ((unsigned int) 0x1 <<  4) /* (LCDC) FIFO Underflow Interrupt*/
#define AT91C_LCDC_OWRI       ((unsigned int) 0x1 <<  5) /* (LCDC) Over Write Interrupt*/
#define AT91C_LCDC_MERI       ((unsigned int) 0x1 <<  6) /* (LCDC) Memory Error  Interrupt*/
/* -------- LCDC_IDR : (LCDC Offset: 0x84c) LCDC Interrupt Disable Register -------- */
/* -------- LCDC_IMR : (LCDC Offset: 0x850) LCDC Interrupt Mask Register -------- */
/* -------- LCDC_ISR : (LCDC Offset: 0x854) LCDC Interrupt Status Register -------- */
/* -------- LCDC_ICR : (LCDC Offset: 0x858) LCDC Interrupt Clear Register -------- */
/* -------- LCDC_GPR : (LCDC Offset: 0x85c) LCDC General Purpose Register -------- */
#define AT91C_LCDC_GPRBUS     ((unsigned int) 0xFF <<  0) /* (LCDC) 8 bits available*/
/* -------- LCDC_ITR : (LCDC Offset: 0x860) Interrupts Test Register -------- */
/* -------- LCDC_IRR : (LCDC Offset: 0x864) Interrupts Raw Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR HDMA Channel structure*/
/* ******************************************************************************/
typedef struct _AT91S_HDMA_CH {
	AT91_REG	 HDMA_SADDR; 	/* HDMA Channel Source Address Register*/
	AT91_REG	 HDMA_DADDR; 	/* HDMA Channel Destination Address Register*/
	AT91_REG	 HDMA_DSCR; 	/* HDMA Channel Descriptor Address Register*/
	AT91_REG	 HDMA_CTRLA; 	/* HDMA Channel Control A Register*/
	AT91_REG	 HDMA_CTRLB; 	/* HDMA Channel Control B Register*/
	AT91_REG	 HDMA_CFG; 	/* HDMA Channel Configuration Register*/
	AT91_REG	 HDMA_SPIP; 	/* HDMA Channel Source Picture in Picture Configuration Register*/
	AT91_REG	 HDMA_DPIP; 	/* HDMA Channel Destination Picture in Picture Configuration Register*/
	AT91_REG	 HDMA_BDSCR; 	/* HDMA Reserved*/
	AT91_REG	 HDMA_CADDR; 	/* HDMA Reserved*/
} AT91S_HDMA_CH, *AT91PS_HDMA_CH;

/* -------- HDMA_SADDR : (HDMA_CH Offset: 0x0)  -------- */
#define AT91C_SADDR           ((unsigned int) 0x0 <<  0) /* (HDMA_CH) */
/* -------- HDMA_DADDR : (HDMA_CH Offset: 0x4)  -------- */
#define AT91C_DADDR           ((unsigned int) 0x0 <<  0) /* (HDMA_CH) */
/* -------- HDMA_DSCR : (HDMA_CH Offset: 0x8)  -------- */
#define AT91C_DSCR_IF         ((unsigned int) 0x3 <<  0) /* (HDMA_CH) */
#define AT91C_DSCR            ((unsigned int) 0x3FFFFFFF <<  2) /* (HDMA_CH) */
/* -------- HDMA_CTRLA : (HDMA_CH Offset: 0xc)  -------- */
#define AT91C_BTSIZE          ((unsigned int) 0xFFF <<  0) /* (HDMA_CH) */
#define AT91C_FC              ((unsigned int) 0x7 << 12) /* (HDMA_CH) */
#define AT91C_AUTO            ((unsigned int) 0x1 << 15) /* (HDMA_CH) */
#define AT91C_SCSIZE          ((unsigned int) 0x7 << 16) /* (HDMA_CH) */
#define AT91C_DCSIZE          ((unsigned int) 0x7 << 20) /* (HDMA_CH) */
#define AT91C_SRC_WIDTH       ((unsigned int) 0x3 << 24) /* (HDMA_CH) */
#define AT91C_DST_WIDTH       ((unsigned int) 0x3 << 28) /* (HDMA_CH) */
/* -------- HDMA_CTRLB : (HDMA_CH Offset: 0x10)  -------- */
#define AT91C_SIF             ((unsigned int) 0x3 <<  0) /* (HDMA_CH) */
#define AT91C_DIF             ((unsigned int) 0x3 <<  4) /* (HDMA_CH) */
#define AT91C_SRC_PIP         ((unsigned int) 0x1 <<  8) /* (HDMA_CH) */
#define AT91C_DST_PIP         ((unsigned int) 0x1 << 12) /* (HDMA_CH) */
#define AT91C_SRC_DSCR        ((unsigned int) 0x1 << 16) /* (HDMA_CH) */
#define AT91C_DST_DSCR        ((unsigned int) 0x1 << 20) /* (HDMA_CH) */
#define AT91C_SRC_INCR        ((unsigned int) 0x3 << 24) /* (HDMA_CH) */
#define AT91C_DST_INCR        ((unsigned int) 0x3 << 28) /* (HDMA_CH) */
/* -------- HDMA_CFG : (HDMA_CH Offset: 0x14)  -------- */
#define AT91C_SRC_PER         ((unsigned int) 0xF <<  0) /* (HDMA_CH) */
#define AT91C_DST_PER         ((unsigned int) 0xF <<  4) /* (HDMA_CH) */
#define AT91C_SRC_REP         ((unsigned int) 0x1 <<  8) /* (HDMA_CH) */
#define AT91C_SRC_H2SEL       ((unsigned int) 0x1 <<  9) /* (HDMA_CH) */
#define AT91C_DST_REP         ((unsigned int) 0x1 << 12) /* (HDMA_CH) */
#define AT91C_DST_H2SEL       ((unsigned int) 0x1 << 13) /* (HDMA_CH) */
#define AT91C_LOCK_IF         ((unsigned int) 0x1 << 20) /* (HDMA_CH) */
#define AT91C_LOCK_B          ((unsigned int) 0x1 << 21) /* (HDMA_CH) */
#define AT91C_LOCK_IF_L       ((unsigned int) 0x1 << 22) /* (HDMA_CH) */
#define AT91C_AHB_PROT        ((unsigned int) 0x7 << 24) /* (HDMA_CH) */
/* -------- HDMA_SPIP : (HDMA_CH Offset: 0x18)  -------- */
#define AT91C_SPIP_HOLE       ((unsigned int) 0xFFFF <<  0) /* (HDMA_CH) */
#define AT91C_SPIP_BOUNDARY   ((unsigned int) 0x3FF << 16) /* (HDMA_CH) */
/* -------- HDMA_DPIP : (HDMA_CH Offset: 0x1c)  -------- */
#define AT91C_DPIP_HOLE       ((unsigned int) 0xFFFF <<  0) /* (HDMA_CH) */
#define AT91C_DPIP_BOUNDARY   ((unsigned int) 0x3FF << 16) /* (HDMA_CH) */
/* -------- HDMA_BDSCR : (HDMA_CH Offset: 0x20)  -------- */
/* -------- HDMA_CADDR : (HDMA_CH Offset: 0x24)  -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR HDMA controller*/
/* ******************************************************************************/
typedef struct _AT91S_HDMA {
	AT91_REG	 HDMA_GCFG; 	/* HDMA Global Configuration Register*/
	AT91_REG	 HDMA_EN; 	/* HDMA Controller Enable Register*/
	AT91_REG	 HDMA_SREQ; 	/* HDMA Software Single Request Register*/
	AT91_REG	 HDMA_BREQ; 	/* HDMA Software Chunk Transfer Request Register*/
	AT91_REG	 HDMA_LAST; 	/* HDMA Software Last Transfer Flag Register*/
	AT91_REG	 HDMA_SYNC; 	/* HDMA Request Synchronization Register*/
	AT91_REG	 HDMA_EBCIER; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register*/
	AT91_REG	 HDMA_EBCIDR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register*/
	AT91_REG	 HDMA_EBCIMR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register*/
	AT91_REG	 HDMA_EBCISR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register*/
	AT91_REG	 HDMA_CHER; 	/* HDMA Channel Handler Enable Register*/
	AT91_REG	 HDMA_CHDR; 	/* HDMA Channel Handler Disable Register*/
	AT91_REG	 HDMA_CHSR; 	/* HDMA Channel Handler Status Register*/
	AT91_REG	 HDMA_RSVD0; 	/* HDMA Reserved*/
	AT91_REG	 HDMA_RSVD1; 	/* HDMA Reserved*/
	AT91S_HDMA_CH	 HDMA_CH[2]; 	/* HDMA Channel structure*/
} AT91S_HDMA, *AT91PS_HDMA;

/* -------- HDMA_GCFG : (HDMA Offset: 0x0)  -------- */
#define AT91C_IF0_BIGEND      ((unsigned int) 0x1 <<  0) /* (HDMA) */
#define AT91C_IF1_BIGEND      ((unsigned int) 0x1 <<  1) /* (HDMA) */
#define AT91C_IF2_BIGEND      ((unsigned int) 0x1 <<  2) /* (HDMA) */
#define AT91C_IF3_BIGEND      ((unsigned int) 0x1 <<  3) /* (HDMA) */
#define AT91C_ARB_CFG         ((unsigned int) 0x1 <<  4) /* (HDMA) */
/* -------- HDMA_EN : (HDMA Offset: 0x4)  -------- */
#define AT91C_HDMA_ENABLE     ((unsigned int) 0x1 <<  0) /* (HDMA) */
/* -------- HDMA_SREQ : (HDMA Offset: 0x8)  -------- */
#define AT91C_SOFT_SREQ       ((unsigned int) 0xFFFF <<  0) /* (HDMA) */
/* -------- HDMA_BREQ : (HDMA Offset: 0xc)  -------- */
#define AT91C_SOFT_BREQ       ((unsigned int) 0xFFFF <<  0) /* (HDMA) */
/* -------- HDMA_LAST : (HDMA Offset: 0x10)  -------- */
#define AT91C_SOFT_LAST       ((unsigned int) 0xFFFF <<  0) /* (HDMA) */
/* -------- HDMA_SYNC : (HDMA Offset: 0x14)  -------- */
#define AT91C_SYNC_REQ        ((unsigned int) 0xFFFF <<  0) /* (HDMA) */
/* -------- HDMA_EBCIER : (HDMA Offset: 0x18)  -------- */
#define AT91C_BTC             ((unsigned int) 0xFF <<  0) /* (HDMA) */
#define AT91C_CBTC            ((unsigned int) 0xFF <<  8) /* (HDMA) */
#define AT91C_ERR             ((unsigned int) 0xFF << 16) /* (HDMA) */
/* -------- HDMA_EBCIDR : (HDMA Offset: 0x1c)  -------- */
/* -------- HDMA_EBCIMR : (HDMA Offset: 0x20)  -------- */
/* -------- HDMA_EBCISR : (HDMA Offset: 0x24)  -------- */
/* -------- HDMA_CHER : (HDMA Offset: 0x28)  -------- */
#define AT91C_ENABLE          ((unsigned int) 0xFF <<  0) /* (HDMA) */
#define AT91C_SUSPEND         ((unsigned int) 0xFF <<  8) /* (HDMA) */
#define AT91C_KEEPON          ((unsigned int) 0xFF << 24) /* (HDMA) */
/* -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- */
#define AT91C_RESUME          ((unsigned int) 0xFF <<  8) /* (HDMA) */
/* -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- */
#define AT91C_STALLED         ((unsigned int) 0xFF << 14) /* (HDMA) */
#define AT91C_EMPTY           ((unsigned int) 0xFF << 16) /* (HDMA) */
/* -------- HDMA_RSVD : (HDMA Offset: 0x34)  -------- */
/* -------- HDMA_RSVD : (HDMA Offset: 0x38)  -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* ******************************************************************************/
typedef struct _AT91S_ECC {
	AT91_REG	 ECC_CR; 	/*  ECC reset register*/
	AT91_REG	 ECC_MR; 	/*  ECC Page size register*/
	AT91_REG	 ECC_SR; 	/*  ECC Status register*/
	AT91_REG	 ECC_PR; 	/*  ECC Parity register*/
	AT91_REG	 ECC_NPR; 	/*  ECC Parity N register*/
	AT91_REG	 Reserved0[58]; 	/* */
	AT91_REG	 ECC_VR; 	/*  ECC Version register*/
} AT91S_ECC, *AT91PS_ECC;

/* -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
#define AT91C_ECC_RST         ((unsigned int) 0x1 <<  0) /* (ECC) ECC reset parity*/
/* -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
#define AT91C_ECC_PAGE_SIZE   ((unsigned int) 0x3 <<  0) /* (ECC) Nand Flash page size*/
/* -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
#define AT91C_ECC_RECERR      ((unsigned int) 0x1 <<  0) /* (ECC) ECC error*/
#define AT91C_ECC_ECCERR      ((unsigned int) 0x1 <<  1) /* (ECC) ECC single error*/
#define AT91C_ECC_MULERR      ((unsigned int) 0x1 <<  2) /* (ECC) ECC_MULERR*/
/* -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
#define AT91C_ECC_BITADDR     ((unsigned int) 0xF <<  0) /* (ECC) Bit address error*/
#define AT91C_ECC_WORDADDR    ((unsigned int) 0xFFF <<  4) /* (ECC) address of the failing bit*/
/* -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
#define AT91C_ECC_NPARITY     ((unsigned int) 0xFFFF <<  0) /* (ECC) ECC parity N */
/* -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
#define AT91C_ECC_VR          ((unsigned int) 0xF <<  0) /* (ECC) ECC version register*/

