una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* ******************************************************************************/
/*               REGISTER ADDRESS DEFINITION FOR AT91SAM9RL64*/
/* ******************************************************************************/
/* ========== Register definition for SYS peripheral ========== */
#define AT91C_SYS_SLCKSEL ((AT91_REG *) 	0xFFFFFD50) /* (SYS) Slow Clock Selection Register*/
#define AT91C_SYS_GPBR  ((AT91_REG *) 	0xFFFFFD60) /* (SYS) General Purpose Register*/
/* ========== Register definition for EBI peripheral ========== */
#define AT91C_EBI_DUMMY ((AT91_REG *) 	0xFFFFE800) /* (EBI) Dummy register - Do not use*/
/* ========== Register definition for SDRAMC peripheral ========== */
#define AT91C_SDRAMC_MR ((AT91_REG *) 	0xFFFFEA00) /* (SDRAMC) SDRAM Controller Mode Register*/
#define AT91C_SDRAMC_IMR ((AT91_REG *) 	0xFFFFEA1C) /* (SDRAMC) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRAMC_LPR ((AT91_REG *) 	0xFFFFEA10) /* (SDRAMC) SDRAM Controller Low Power Register*/
#define AT91C_SDRAMC_ISR ((AT91_REG *) 	0xFFFFEA20) /* (SDRAMC) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRAMC_IDR ((AT91_REG *) 	0xFFFFEA18) /* (SDRAMC) SDRAM Controller Interrupt Disable Register*/
#define AT91C_SDRAMC_CR ((AT91_REG *) 	0xFFFFEA08) /* (SDRAMC) SDRAM Controller Configuration Register*/
#define AT91C_SDRAMC_TR ((AT91_REG *) 	0xFFFFEA04) /* (SDRAMC) SDRAM Controller Refresh Timer Register*/
#define AT91C_SDRAMC_MDR ((AT91_REG *) 	0xFFFFEA24) /* (SDRAMC) SDRAM Memory Device Register*/
#define AT91C_SDRAMC_HSR ((AT91_REG *) 	0xFFFFEA0C) /* (SDRAMC) SDRAM Controller High Speed Register*/
#define AT91C_SDRAMC_IER ((AT91_REG *) 	0xFFFFEA14) /* (SDRAMC) SDRAM Controller Interrupt Enable Register*/
/* ========== Register definition for SMC peripheral ========== */
#define AT91C_SMC_CTRL1 ((AT91_REG *) 	0xFFFFEC1C) /* (SMC)  Control Register for CS 1*/
#define AT91C_SMC_PULSE7 ((AT91_REG *) 	0xFFFFEC74) /* (SMC)  Pulse Register for CS 7*/
#define AT91C_SMC_PULSE6 ((AT91_REG *) 	0xFFFFEC64) /* (SMC)  Pulse Register for CS 6*/
#define AT91C_SMC_SETUP4 ((AT91_REG *) 	0xFFFFEC40) /* (SMC)  Setup Register for CS 4*/
#define AT91C_SMC_PULSE3 ((AT91_REG *) 	0xFFFFEC34) /* (SMC)  Pulse Register for CS 3*/
#define AT91C_SMC_CYCLE5 ((AT91_REG *) 	0xFFFFEC58) /* (SMC)  Cycle Register for CS 5*/
#define AT91C_SMC_CYCLE2 ((AT91_REG *) 	0xFFFFEC28) /* (SMC)  Cycle Register for CS 2*/
#define AT91C_SMC_CTRL2 ((AT91_REG *) 	0xFFFFEC2C) /* (SMC)  Control Register for CS 2*/
#define AT91C_SMC_CTRL0 ((AT91_REG *) 	0xFFFFEC0C) /* (SMC)  Control Register for CS 0*/
#define AT91C_SMC_PULSE5 ((AT91_REG *) 	0xFFFFEC54) /* (SMC)  Pulse Register for CS 5*/
#define AT91C_SMC_PULSE1 ((AT91_REG *) 	0xFFFFEC14) /* (SMC)  Pulse Register for CS 1*/
#define AT91C_SMC_PULSE0 ((AT91_REG *) 	0xFFFFEC04) /* (SMC)  Pulse Register for CS 0*/
#define AT91C_SMC_CYCLE7 ((AT91_REG *) 	0xFFFFEC78) /* (SMC)  Cycle Register for CS 7*/
#define AT91C_SMC_CTRL4 ((AT91_REG *) 	0xFFFFEC4C) /* (SMC)  Control Register for CS 4*/
#define AT91C_SMC_CTRL3 ((AT91_REG *) 	0xFFFFEC3C) /* (SMC)  Control Register for CS 3*/
#define AT91C_SMC_SETUP7 ((AT91_REG *) 	0xFFFFEC70) /* (SMC)  Setup Register for CS 7*/
#define AT91C_SMC_CTRL7 ((AT91_REG *) 	0xFFFFEC7C) /* (SMC)  Control Register for CS 7*/
#define AT91C_SMC_SETUP1 ((AT91_REG *) 	0xFFFFEC10) /* (SMC)  Setup Register for CS 1*/
#define AT91C_SMC_CYCLE0 ((AT91_REG *) 	0xFFFFEC08) /* (SMC)  Cycle Register for CS 0*/
#define AT91C_SMC_CTRL5 ((AT91_REG *) 	0xFFFFEC5C) /* (SMC)  Control Register for CS 5*/
#define AT91C_SMC_CYCLE1 ((AT91_REG *) 	0xFFFFEC18) /* (SMC)  Cycle Register for CS 1*/
#define AT91C_SMC_CTRL6 ((AT91_REG *) 	0xFFFFEC6C) /* (SMC)  Control Register for CS 6*/
#define AT91C_SMC_SETUP0 ((AT91_REG *) 	0xFFFFEC00) /* (SMC)  Setup Register for CS 0*/
#define AT91C_SMC_PULSE4 ((AT91_REG *) 	0xFFFFEC44) /* (SMC)  Pulse Register for CS 4*/
#define AT91C_SMC_SETUP5 ((AT91_REG *) 	0xFFFFEC50) /* (SMC)  Setup Register for CS 5*/
#define AT91C_SMC_SETUP2 ((AT91_REG *) 	0xFFFFEC20) /* (SMC)  Setup Register for CS 2*/
#define AT91C_SMC_CYCLE3 ((AT91_REG *) 	0xFFFFEC38) /* (SMC)  Cycle Register for CS 3*/
#define AT91C_SMC_CYCLE6 ((AT91_REG *) 	0xFFFFEC68) /* (SMC)  Cycle Register for CS 6*/
#define AT91C_SMC_SETUP6 ((AT91_REG *) 	0xFFFFEC60) /* (SMC)  Setup Register for CS 6*/
#define AT91C_SMC_CYCLE4 ((AT91_REG *) 	0xFFFFEC48) /* (SMC)  Cycle Register for CS 4*/
#define AT91C_SMC_PULSE2 ((AT91_REG *) 	0xFFFFEC24) /* (SMC)  Pulse Register for CS 2*/
#define AT91C_SMC_SETUP3 ((AT91_REG *) 	0xFFFFEC30) /* (SMC)  Setup Register for CS 3*/
/* ========== Register definition for MATRIX peripheral ========== */
#define AT91C_MATRIX_PRBS4 ((AT91_REG *) 	0xFFFFEEA4) /* (MATRIX)  PRBS4 : ebi*/
#define AT91C_MATRIX_SCFG3 ((AT91_REG *) 	0xFFFFEE4C) /* (MATRIX)  Slave Configuration Register 3 : usb_dev_hs*/
#define AT91C_MATRIX_MCFG6 ((AT91_REG *) 	0xFFFFEE18) /* (MATRIX)  Master Configuration Register 6 */
#define AT91C_MATRIX_PRAS3 ((AT91_REG *) 	0xFFFFEE98) /* (MATRIX)  PRAS3 : usb_dev_hs*/
#define AT91C_MATRIX_PRBS7 ((AT91_REG *) 	0xFFFFEEBC) /* (MATRIX)  PRBS7*/
#define AT91C_MATRIX_PRAS5 ((AT91_REG *) 	0xFFFFEEA8) /* (MATRIX)  PRAS5 : bridge*/
#define AT91C_MATRIX_PRAS0 ((AT91_REG *) 	0xFFFFEE80) /* (MATRIX)  PRAS0 : rom*/
#define AT91C_MATRIX_PRAS2 ((AT91_REG *) 	0xFFFFEE90) /* (MATRIX)  PRAS2 : lcdc*/
#define AT91C_MATRIX_MCFG5 ((AT91_REG *) 	0xFFFFEE14) /* (MATRIX)  Master Configuration Register 5 : bridge*/
#define AT91C_MATRIX_MCFG1 ((AT91_REG *) 	0xFFFFEE04) /* (MATRIX)  Master Configuration Register 1 ; htcm*/
#define AT91C_MATRIX_MRCR ((AT91_REG *) 	0xFFFFEF00) /* (MATRIX)  Master Remp Control Register */
#define AT91C_MATRIX_PRBS2 ((AT91_REG *) 	0xFFFFEE94) /* (MATRIX)  PRBS2 : lcdc*/
#define AT91C_MATRIX_SCFG4 ((AT91_REG *) 	0xFFFFEE50) /* (MATRIX)  Slave Configuration Register 4 ; ebi*/
#define AT91C_MATRIX_SCFG6 ((AT91_REG *) 	0xFFFFEE58) /* (MATRIX)  Slave Configuration Register 6*/
#define AT91C_MATRIX_MCFG0 ((AT91_REG *) 	0xFFFFEE00) /* (MATRIX)  Master Configuration Register 0 : rom*/
#define AT91C_MATRIX_MCFG8 ((AT91_REG *) 	0xFFFFEE20) /* (MATRIX)  Master Configuration Register 8 */
#define AT91C_MATRIX_MCFG7 ((AT91_REG *) 	0xFFFFEE1C) /* (MATRIX)  Master Configuration Register 7 */
#define AT91C_MATRIX_MCFG4 ((AT91_REG *) 	0xFFFFEE10) /* (MATRIX)  Master Configuration Register 4 : ebi*/
#define AT91C_MATRIX_SCFG1 ((AT91_REG *) 	0xFFFFEE44) /* (MATRIX)  Slave Configuration Register 1 : htcm*/
#define AT91C_MATRIX_SCFG7 ((AT91_REG *) 	0xFFFFEE5C) /* (MATRIX)  Slave Configuration Register 7*/
#define AT91C_MATRIX_MCFG2 ((AT91_REG *) 	0xFFFFEE08) /* (MATRIX)  Master Configuration Register 2 : lcdc*/
#define AT91C_MATRIX_PRBS0 ((AT91_REG *) 	0xFFFFEE84) /* (MATRIX)  PRBS0 : rom*/
#define AT91C_MATRIX_PRAS7 ((AT91_REG *) 	0xFFFFEEB8) /* (MATRIX)  PRAS7*/
#define AT91C_MATRIX_SCFG0 ((AT91_REG *) 	0xFFFFEE40) /* (MATRIX)  Slave Configuration Register 0 : rom*/
#define AT91C_MATRIX_PRBS5 ((AT91_REG *) 	0xFFFFEEAC) /* (MATRIX)  PRBS5 : bridge*/
#define AT91C_MATRIX_PRBS3 ((AT91_REG *) 	0xFFFFEE9C) /* (MATRIX)  PRBS3 : usb_dev_hs*/
#define AT91C_MATRIX_PRAS6 ((AT91_REG *) 	0xFFFFEEB0) /* (MATRIX)  PRAS6*/
#define AT91C_MATRIX_MCFG3 ((AT91_REG *) 	0xFFFFEE0C) /* (MATRIX)  Master Configuration Register 3 : usb_dev_hs*/
#define AT91C_MATRIX_PRAS1 ((AT91_REG *) 	0xFFFFEE88) /* (MATRIX)  PRAS1 : htcm*/
#define AT91C_MATRIX_SCFG2 ((AT91_REG *) 	0xFFFFEE48) /* (MATRIX)  Slave Configuration Register 2 : lcdc*/
#define AT91C_MATRIX_PRBS6 ((AT91_REG *) 	0xFFFFEEB4) /* (MATRIX)  PRBS6*/
#define AT91C_MATRIX_PRAS4 ((AT91_REG *) 	0xFFFFEEA0) /* (MATRIX)  PRAS4 : ebi*/
#define AT91C_MATRIX_SCFG5 ((AT91_REG *) 	0xFFFFEE54) /* (MATRIX)  Slave Configuration Register 5 : bridge*/
#define AT91C_MATRIX_PRBS1 ((AT91_REG *) 	0xFFFFEE8C) /* (MATRIX)  PRBS1 : htcm*/
/* ========== Register definition for CCFG peripheral ========== */
#define AT91C_CCFG_MATRIXVERSION ((AT91_REG *) 	0xFFFFEFFC) /* (CCFG)  Version Register*/
#define AT91C_CCFG_TCMR ((AT91_REG *) 	0xFFFFEF14) /* (CCFG)  TCM configuration*/
#define AT91C_CCFG_EBICSA ((AT91_REG *) 	0xFFFFEF20) /* (CCFG)  EBI Chip Select Assignement Register*/
#define AT91C_CCFG_UDPHS ((AT91_REG *) 	0xFFFFEF1C) /* (CCFG)  USB Device HS configuration*/
/* ========== Register definition for AIC peripheral ========== */
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) /* (AIC) IRQ Vector Register*/
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) /* (AIC) Source Mode Register*/
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) /* (AIC) FIQ Vector Register*/
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) /* (AIC) Debug Control Register (Protect)*/
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) /* (AIC) End of Interrupt Command Register*/
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) /* (AIC) Source Vector Register*/
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) /* (AIC) Fast Forcing Status Register*/
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) /* (AIC) Interrupt Clear Command Register*/
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) /* (AIC) Interrupt Status Register*/
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) /* (AIC) Interrupt Mask Register*/
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) /* (AIC) Interrupt Pending Register*/
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) /* (AIC) Fast Forcing Enable Register*/
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) /* (AIC) Interrupt Enable Command Register*/
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) /* (AIC) Interrupt Set Command Register*/
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) /* (AIC) Fast Forcing Disable Register*/
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) /* (AIC) Core Interrupt Status Register*/
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) /* (AIC) Interrupt Disable Command Register*/
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) /* (AIC) Spurious Vector Register*/
/* ========== Register definition for PDC_DBGU peripheral ========== */
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFF30C) /* (PDC_DBGU) Transmit Counter Register*/
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFF310) /* (PDC_DBGU) Receive Next Pointer Register*/
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFF318) /* (PDC_DBGU) Transmit Next Pointer Register*/
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFF308) /* (PDC_DBGU) Transmit Pointer Register*/
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFF300) /* (PDC_DBGU) Receive Pointer Register*/
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFF304) /* (PDC_DBGU) Receive Counter Register*/
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFF314) /* (PDC_DBGU) Receive Next Counter Register*/
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFF320) /* (PDC_DBGU) PDC Transfer Control Register*/
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFF324) /* (PDC_DBGU) PDC Transfer Status Register*/
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFF31C) /* (PDC_DBGU) Transmit Next Counter Register*/
/* ========== Register definition for DBGU peripheral ========== */
#define AT91C_DBGU_EXID ((AT91_REG *) 	0xFFFFF244) /* (DBGU) Chip ID Extension Register*/
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFF220) /* (DBGU) Baud Rate Generator Register*/
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFF20C) /* (DBGU) Interrupt Disable Register*/
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFF214) /* (DBGU) Channel Status Register*/
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0xFFFFF240) /* (DBGU) Chip ID Register*/
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFF204) /* (DBGU) Mode Register*/
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFF210) /* (DBGU) Interrupt Mask Register*/
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFF200) /* (DBGU) Control Register*/
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFF248) /* (DBGU) Force NTRST Register*/
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFF21C) /* (DBGU) Transmitter Holding Register*/
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFF218) /* (DBGU) Receiver Holding Register*/
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFF208) /* (DBGU) Interrupt Enable Register*/
/* ========== Register definition for PIOA peripheral ========== */
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF414) /* (PIOA) Output Disable Registerr*/
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF430) /* (PIOA) Set Output Data Register*/
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF44C) /* (PIOA) Interrupt Status Register*/
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF478) /* (PIOA) AB Select Status Register*/
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF440) /* (PIOA) Interrupt Enable Register*/
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF460) /* (PIOA) Pull-up Disable Register*/
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF448) /* (PIOA) Interrupt Mask Register*/
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF400) /* (PIOA) PIO Enable Register*/
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF424) /* (PIOA) Input Filter Disable Register*/
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF4A4) /* (PIOA) Output Write Disable Register*/
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF458) /* (PIOA) Multi-driver Status Register*/
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF444) /* (PIOA) Interrupt Disable Register*/
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF438) /* (PIOA) Output Data Status Register*/
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF468) /* (PIOA) Pull-up Status Register*/
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF4A8) /* (PIOA) Output Write Status Register*/
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF474) /* (PIOA) Select B Register*/
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF4A0) /* (PIOA) Output Write Enable Register*/
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF420) /* (PIOA) Input Filter Enable Register*/
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF43C) /* (PIOA) Pin Data Status Register*/
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF464) /* (PIOA) Pull-up Enable Register*/
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF418) /* (PIOA) Output Status Register*/
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF470) /* (PIOA) Select A Register*/
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF454) /* (PIOA) Multi-driver Disable Register*/
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF434) /* (PIOA) Clear Output Data Register*/
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF450) /* (PIOA) Multi-driver Enable Register*/
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF404) /* (PIOA) PIO Disable Register*/
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF428) /* (PIOA) Input Filter Status Register*/
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF410) /* (PIOA) Output Enable Register*/
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF408) /* (PIOA) PIO Status Register*/
/* ========== Register definition for PIOB peripheral ========== */
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0xFFFFF6A4) /* (PIOB) Output Write Disable Register*/
#define AT91C_PIOB_MDER ((AT91_REG *) 	0xFFFFF650) /* (PIOB) Multi-driver Enable Register*/
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0xFFFFF668) /* (PIOB) Pull-up Status Register*/
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0xFFFFF648) /* (PIOB) Interrupt Mask Register*/
#define AT91C_PIOB_ASR  ((AT91_REG *) 	0xFFFFF670) /* (PIOB) Select A Register*/
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0xFFFFF660) /* (PIOB) Pull-up Disable Register*/
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0xFFFFF608) /* (PIOB) PIO Status Register*/
#define AT91C_PIOB_IER  ((AT91_REG *) 	0xFFFFF640) /* (PIOB) Interrupt Enable Register*/
#define AT91C_PIOB_CODR ((AT91_REG *) 	0xFFFFF634) /* (PIOB) Clear Output Data Register*/
#define AT91C_PIOB_OWER ((AT91_REG *) 	0xFFFFF6A0) /* (PIOB) Output Write Enable Register*/
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0xFFFFF678) /* (PIOB) AB Select Status Register*/
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0xFFFFF624) /* (PIOB) Input Filter Disable Register*/
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0xFFFFF63C) /* (PIOB) Pin Data Status Register*/
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0xFFFFF644) /* (PIOB) Interrupt Disable Register*/
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0xFFFFF6A8) /* (PIOB) Output Write Status Register*/
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0xFFFFF604) /* (PIOB) PIO Disable Register*/
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0xFFFFF614) /* (PIOB) Output Disable Registerr*/
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0xFFFFF628) /* (PIOB) Input Filter Status Register*/
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0xFFFFF664) /* (PIOB) Pull-up Enable Register*/
#define AT91C_PIOB_SODR ((AT91_REG *) 	0xFFFFF630) /* (PIOB) Set Output Data Register*/
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0xFFFFF64C) /* (PIOB) Interrupt Status Register*/
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0xFFFFF638) /* (PIOB) Output Data Status Register*/
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0xFFFFF618) /* (PIOB) Output Status Register*/
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0xFFFFF658) /* (PIOB) Multi-driver Status Register*/
#define AT91C_PIOB_IFER ((AT91_REG *) 	0xFFFFF620) /* (PIOB) Input Filter Enable Register*/
#define AT91C_PIOB_BSR  ((AT91_REG *) 	0xFFFFF674) /* (PIOB) Select B Register*/
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0xFFFFF654) /* (PIOB) Multi-driver Disable Register*/
#define AT91C_PIOB_OER  ((AT91_REG *) 	0xFFFFF610) /* (PIOB) Output Enable Register*/
#define AT91C_PIOB_PER  ((AT91_REG *) 	0xFFFFF600) /* (PIOB) PIO Enable Register*/
/* ========== Register definition for PIOC peripheral ========== */
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0xFFFFF8A4) /* (PIOC) Output Write Disable Register*/
#define AT91C_PIOC_SODR ((AT91_REG *) 	0xFFFFF830) /* (PIOC) Set Output Data Register*/
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0xFFFFF864) /* (PIOC) Pull-up Enable Register*/
#define AT91C_PIOC_CODR ((AT91_REG *) 	0xFFFFF834) /* (PIOC) Clear Output Data Register*/
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0xFFFFF808) /* (PIOC) PIO Status Register*/
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0xFFFFF804) /* (PIOC) PIO Disable Register*/
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0xFFFFF814) /* (PIOC) Output Disable Registerr*/
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0xFFFFF868) /* (PIOC) Pull-up Status Register*/
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0xFFFFF878) /* (PIOC) AB Select Status Register*/
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0xFFFFF828) /* (PIOC) Input Filter Status Register*/
#define AT91C_PIOC_OER  ((AT91_REG *) 	0xFFFFF810) /* (PIOC) Output Enable Register*/
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0xFFFFF848) /* (PIOC) Interrupt Mask Register*/
#define AT91C_PIOC_ASR  ((AT91_REG *) 	0xFFFFF870) /* (PIOC) Select A Register*/
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0xFFFFF854) /* (PIOC) Multi-driver Disable Register*/
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0xFFFFF8A8) /* (PIOC) Output Write Status Register*/
#define AT91C_PIOC_PER  ((AT91_REG *) 	0xFFFFF800) /* (PIOC) PIO Enable Register*/
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0xFFFFF844) /* (PIOC) Interrupt Disable Register*/
#define AT91C_PIOC_MDER ((AT91_REG *) 	0xFFFFF850) /* (PIOC) Multi-driver Enable Register*/
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0xFFFFF83C) /* (PIOC) Pin Data Status Register*/
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0xFFFFF858) /* (PIOC) Multi-driver Status Register*/
#define AT91C_PIOC_OWER ((AT91_REG *) 	0xFFFFF8A0) /* (PIOC) Output Write Enable Register*/
#define AT91C_PIOC_BSR  ((AT91_REG *) 	0xFFFFF874) /* (PIOC) Select B Register*/
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0xFFFFF860) /* (PIOC) Pull-up Disable Register*/
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0xFFFFF824) /* (PIOC) Input Filter Disable Register*/
#define AT91C_PIOC_IER  ((AT91_REG *) 	0xFFFFF840) /* (PIOC) Interrupt Enable Register*/
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0xFFFFF818) /* (PIOC) Output Status Register*/
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0xFFFFF838) /* (PIOC) Output Data Status Register*/
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0xFFFFF84C) /* (PIOC) Interrupt Status Register*/
#define AT91C_PIOC_IFER ((AT91_REG *) 	0xFFFFF820) /* (PIOC) Input Filter Enable Register*/
/* ========== Register definition for PIOD peripheral ========== */
#define AT91C_PIOD_ODSR ((AT91_REG *) 	0xFFFFFA38) /* (PIOD) Output Data Status Register*/
#define AT91C_PIOD_ABSR ((AT91_REG *) 	0xFFFFFA78) /* (PIOD) AB Select Status Register*/
#define AT91C_PIOD_PSR  ((AT91_REG *) 	0xFFFFFA08) /* (PIOD) PIO Status Register*/
#define AT91C_PIOD_PPUDR ((AT91_REG *) 	0xFFFFFA60) /* (PIOD) Pull-up Disable Register*/
#define AT91C_PIOD_OER  ((AT91_REG *) 	0xFFFFFA10) /* (PIOD) Output Enable Register*/
#define AT91C_PIOD_OWDR ((AT91_REG *) 	0xFFFFFAA4) /* (PIOD) Output Write Disable Register*/
#define AT91C_PIOD_PER  ((AT91_REG *) 	0xFFFFFA00) /* (PIOD) PIO Enable Register*/
#define AT91C_PIOD_IFSR ((AT91_REG *) 	0xFFFFFA28) /* (PIOD) Input Filter Status Register*/
#define AT91C_PIOD_IFER ((AT91_REG *) 	0xFFFFFA20) /* (PIOD) Input Filter Enable Register*/
#define AT91C_PIOD_ODR  ((AT91_REG *) 	0xFFFFFA14) /* (PIOD) Output Disable Registerr*/
#define AT91C_PIOD_PPUSR ((AT91_REG *) 	0xFFFFFA68) /* (PIOD) Pull-up Status Register*/
#define AT91C_PIOD_IFDR ((AT91_REG *) 	0xFFFFFA24) /* (PIOD) Input Filter Disable Register*/
#define AT91C_PIOD_PDSR ((AT91_REG *) 	0xFFFFFA3C) /* (PIOD) Pin Data Status Register*/
#define AT91C_PIOD_PPUER ((AT91_REG *) 	0xFFFFFA64) /* (PIOD) Pull-up Enable Register*/
#define AT91C_PIOD_IDR  ((AT91_REG *) 	0xFFFFFA44) /* (PIOD) Interrupt Disable Register*/
#define AT91C_PIOD_MDDR ((AT91_REG *) 	0xFFFFFA54) /* (PIOD) Multi-driver Disable Register*/
#define AT91C_PIOD_ISR  ((AT91_REG *) 	0xFFFFFA4C) /* (PIOD) Interrupt Status Register*/
#define AT91C_PIOD_OSR  ((AT91_REG *) 	0xFFFFFA18) /* (PIOD) Output Status Register*/
#define AT91C_PIOD_CODR ((AT91_REG *) 	0xFFFFFA34) /* (PIOD) Clear Output Data Register*/
#define AT91C_PIOD_MDSR ((AT91_REG *) 	0xFFFFFA58) /* (PIOD) Multi-driver Status Register*/
#define AT91C_PIOD_PDR  ((AT91_REG *) 	0xFFFFFA04) /* (PIOD) PIO Disable Register*/
#define AT91C_PIOD_IER  ((AT91_REG *) 	0xFFFFFA40) /* (PIOD) Interrupt Enable Register*/
#define AT91C_PIOD_OWSR ((AT91_REG *) 	0xFFFFFAA8) /* (PIOD) Output Write Status Register*/
#define AT91C_PIOD_BSR  ((AT91_REG *) 	0xFFFFFA74) /* (PIOD) Select B Register*/
#define AT91C_PIOD_ASR  ((AT91_REG *) 	0xFFFFFA70) /* (PIOD) Select A Register*/
#define AT91C_PIOD_SODR ((AT91_REG *) 	0xFFFFFA30) /* (PIOD) Set Output Data Register*/
#define AT91C_PIOD_IMR  ((AT91_REG *) 	0xFFFFFA48) /* (PIOD) Interrupt Mask Register*/
#define AT91C_PIOD_OWER ((AT91_REG *) 	0xFFFFFAA0) /* (PIOD) Output Write Enable Register*/
#define AT91C_PIOD_MDER ((AT91_REG *) 	0xFFFFFA50) /* (PIOD) Multi-driver Enable Register*/
/* ========== Register definition for PMC peripheral ========== */
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) /* (PMC) Peripheral Clock Enable Register*/
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) /* (PMC) Programmable Clock Register*/
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) /* (PMC) Master Clock Register*/
#define AT91C_PMC_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (PMC) PLL A Register*/
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) /* (PMC) Peripheral Clock Disable Register*/
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) /* (PMC) System Clock Status Register*/
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0xFFFFFC24) /* (PMC) Main Clock  Frequency Register*/
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) /* (PMC) Interrupt Mask Register*/
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) /* (PMC) Interrupt Enable Register*/
#define AT91C_PMC_UCKR  ((AT91_REG *) 	0xFFFFFC1C) /* (PMC) UTMI Clock Configuration Register*/
