una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFFC0044) /* (SSC0) Interrupt Enable Register*/
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFFC0000) /* (SSC0) Control Register*/
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFFC0010) /* (SSC0) Receive Clock ModeRegister*/
#define AT91C_SSC0_SR   ((AT91_REG *) 	0xFFFC0040) /* (SSC0) Status Register*/
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFFC0034) /* (SSC0) Transmit Sync Holding Register*/
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0xFFFC0004) /* (SSC0) Clock Mode Register*/
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFFC0030) /* (SSC0) Receive Sync Holding Register*/
#define AT91C_SSC0_THR  ((AT91_REG *) 	0xFFFC0024) /* (SSC0) Transmit Holding Register*/
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFFC0014) /* (SSC0) Receive Frame Mode Register*/
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFFC0018) /* (SSC0) Transmit Clock Mode Register*/
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFFC001C) /* (SSC0) Transmit Frame Mode Register*/
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFFC004C) /* (SSC0) Interrupt Mask Register*/
/* ========== Register definition for PDC_SSC1 peripheral ========== */
#define AT91C_SSC1_RNCR ((AT91_REG *) 	0xFFFC4114) /* (PDC_SSC1) Receive Next Counter Register*/
#define AT91C_SSC1_PTCR ((AT91_REG *) 	0xFFFC4120) /* (PDC_SSC1) PDC Transfer Control Register*/
#define AT91C_SSC1_TCR  ((AT91_REG *) 	0xFFFC410C) /* (PDC_SSC1) Transmit Counter Register*/
#define AT91C_SSC1_PTSR ((AT91_REG *) 	0xFFFC4124) /* (PDC_SSC1) PDC Transfer Status Register*/
#define AT91C_SSC1_TNPR ((AT91_REG *) 	0xFFFC4118) /* (PDC_SSC1) Transmit Next Pointer Register*/
#define AT91C_SSC1_RCR  ((AT91_REG *) 	0xFFFC4104) /* (PDC_SSC1) Receive Counter Register*/
#define AT91C_SSC1_RNPR ((AT91_REG *) 	0xFFFC4110) /* (PDC_SSC1) Receive Next Pointer Register*/
#define AT91C_SSC1_RPR  ((AT91_REG *) 	0xFFFC4100) /* (PDC_SSC1) Receive Pointer Register*/
#define AT91C_SSC1_TNCR ((AT91_REG *) 	0xFFFC411C) /* (PDC_SSC1) Transmit Next Counter Register*/
#define AT91C_SSC1_TPR  ((AT91_REG *) 	0xFFFC4108) /* (PDC_SSC1) Transmit Pointer Register*/
/* ========== Register definition for SSC1 peripheral ========== */
#define AT91C_SSC1_IMR  ((AT91_REG *) 	0xFFFC404C) /* (SSC1) Interrupt Mask Register*/
#define AT91C_SSC1_IER  ((AT91_REG *) 	0xFFFC4044) /* (SSC1) Interrupt Enable Register*/
#define AT91C_SSC1_THR  ((AT91_REG *) 	0xFFFC4024) /* (SSC1) Transmit Holding Register*/
#define AT91C_SSC1_RFMR ((AT91_REG *) 	0xFFFC4014) /* (SSC1) Receive Frame Mode Register*/
#define AT91C_SSC1_TFMR ((AT91_REG *) 	0xFFFC401C) /* (SSC1) Transmit Frame Mode Register*/
#define AT91C_SSC1_IDR  ((AT91_REG *) 	0xFFFC4048) /* (SSC1) Interrupt Disable Register*/
#define AT91C_SSC1_RSHR ((AT91_REG *) 	0xFFFC4030) /* (SSC1) Receive Sync Holding Register*/
#define AT91C_SSC1_TCMR ((AT91_REG *) 	0xFFFC4018) /* (SSC1) Transmit Clock Mode Register*/
#define AT91C_SSC1_RHR  ((AT91_REG *) 	0xFFFC4020) /* (SSC1) Receive Holding Register*/
#define AT91C_SSC1_RCMR ((AT91_REG *) 	0xFFFC4010) /* (SSC1) Receive Clock ModeRegister*/
#define AT91C_SSC1_CR   ((AT91_REG *) 	0xFFFC4000) /* (SSC1) Control Register*/
#define AT91C_SSC1_SR   ((AT91_REG *) 	0xFFFC4040) /* (SSC1) Status Register*/
#define AT91C_SSC1_CMR  ((AT91_REG *) 	0xFFFC4004) /* (SSC1) Clock Mode Register*/
#define AT91C_SSC1_TSHR ((AT91_REG *) 	0xFFFC4034) /* (SSC1) Transmit Sync Holding Register*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFC8214) /* (PWMC_CH0) Reserved*/
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFC8210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFC820C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFC8204) /* (PWMC_CH0) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFC8208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFC8200) /* (PWMC_CH0) Channel Mode Register*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFC8228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFC8220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFC8234) /* (PWMC_CH1) Reserved*/
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFC8230) /* (PWMC_CH1) Channel Update Register*/
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFC8224) /* (PWMC_CH1) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFC822C) /* (PWMC_CH1) Channel Counter Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFC824C) /* (PWMC_CH2) Channel Counter Register*/
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFC8250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFC8254) /* (PWMC_CH2) Reserved*/
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFC8244) /* (PWMC_CH2) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFC8240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFC8248) /* (PWMC_CH2) Channel Period Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFC8268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFC826C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFC8264) /* (PWMC_CH3) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFC8270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFC8274) /* (PWMC_CH3) Reserved*/
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFC8260) /* (PWMC_CH3) Channel Mode Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFC8018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFC800C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFC8010) /* (PWMC) PWMC Interrupt Enable Register*/
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFC80FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFC8000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFC8008) /* (PWMC) PWMC Disable Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFC8004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFC8014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFC801C) /* (PWMC) PWMC Interrupt Status Register*/
/* ========== Register definition for PDC_SPI peripheral ========== */
#define AT91C_SPI_PTCR  ((AT91_REG *) 	0xFFFCC120) /* (PDC_SPI) PDC Transfer Control Register*/
#define AT91C_SPI_RNPR  ((AT91_REG *) 	0xFFFCC110) /* (PDC_SPI) Receive Next Pointer Register*/
#define AT91C_SPI_RCR   ((AT91_REG *) 	0xFFFCC104) /* (PDC_SPI) Receive Counter Register*/
#define AT91C_SPI_TPR   ((AT91_REG *) 	0xFFFCC108) /* (PDC_SPI) Transmit Pointer Register*/
#define AT91C_SPI_PTSR  ((AT91_REG *) 	0xFFFCC124) /* (PDC_SPI) PDC Transfer Status Register*/
#define AT91C_SPI_TNCR  ((AT91_REG *) 	0xFFFCC11C) /* (PDC_SPI) Transmit Next Counter Register*/
#define AT91C_SPI_RPR   ((AT91_REG *) 	0xFFFCC100) /* (PDC_SPI) Receive Pointer Register*/
#define AT91C_SPI_TCR   ((AT91_REG *) 	0xFFFCC10C) /* (PDC_SPI) Transmit Counter Register*/
#define AT91C_SPI_RNCR  ((AT91_REG *) 	0xFFFCC114) /* (PDC_SPI) Receive Next Counter Register*/
#define AT91C_SPI_TNPR  ((AT91_REG *) 	0xFFFCC118) /* (PDC_SPI) Transmit Next Pointer Register*/
/* ========== Register definition for SPI peripheral ========== */
#define AT91C_SPI_IER   ((AT91_REG *) 	0xFFFCC014) /* (SPI) Interrupt Enable Register*/
#define AT91C_SPI_RDR   ((AT91_REG *) 	0xFFFCC008) /* (SPI) Receive Data Register*/
#define AT91C_SPI_SR    ((AT91_REG *) 	0xFFFCC010) /* (SPI) Status Register*/
#define AT91C_SPI_IMR   ((AT91_REG *) 	0xFFFCC01C) /* (SPI) Interrupt Mask Register*/
#define AT91C_SPI_TDR   ((AT91_REG *) 	0xFFFCC00C) /* (SPI) Transmit Data Register*/
#define AT91C_SPI_IDR   ((AT91_REG *) 	0xFFFCC018) /* (SPI) Interrupt Disable Register*/
#define AT91C_SPI_CSR   ((AT91_REG *) 	0xFFFCC030) /* (SPI) Chip Select Register*/
#define AT91C_SPI_CR    ((AT91_REG *) 	0xFFFCC000) /* (SPI) Control Register*/
#define AT91C_SPI_MR    ((AT91_REG *) 	0xFFFCC004) /* (SPI) Mode Register*/
/* ========== Register definition for PDC_TSADC peripheral ========== */
#define AT91C_TSADC_RNPR ((AT91_REG *) 	0xFFFD0110) /* (PDC_TSADC) Receive Next Pointer Register*/
#define AT91C_TSADC_RNCR ((AT91_REG *) 	0xFFFD0114) /* (PDC_TSADC) Receive Next Counter Register*/
#define AT91C_TSADC_PTSR ((AT91_REG *) 	0xFFFD0124) /* (PDC_TSADC) PDC Transfer Status Register*/
#define AT91C_TSADC_PTCR ((AT91_REG *) 	0xFFFD0120) /* (PDC_TSADC) PDC Transfer Control Register*/
#define AT91C_TSADC_TCR ((AT91_REG *) 	0xFFFD010C) /* (PDC_TSADC) Transmit Counter Register*/
#define AT91C_TSADC_TNPR ((AT91_REG *) 	0xFFFD0118) /* (PDC_TSADC) Transmit Next Pointer Register*/
#define AT91C_TSADC_RCR ((AT91_REG *) 	0xFFFD0104) /* (PDC_TSADC) Receive Counter Register*/
#define AT91C_TSADC_TPR ((AT91_REG *) 	0xFFFD0108) /* (PDC_TSADC) Transmit Pointer Register*/
#define AT91C_TSADC_TNCR ((AT91_REG *) 	0xFFFD011C) /* (PDC_TSADC) Transmit Next Counter Register*/
#define AT91C_TSADC_RPR ((AT91_REG *) 	0xFFFD0100) /* (PDC_TSADC) Receive Pointer Register*/
/* ========== Register definition for TSADC peripheral ========== */
#define AT91C_TSADC_IER ((AT91_REG *) 	0xFFFD0024) /* (TSADC) Interrupt Enable Register*/
#define AT91C_TSADC_MR  ((AT91_REG *) 	0xFFFD0004) /* (TSADC) Mode Register*/
#define AT91C_TSADC_CDR4 ((AT91_REG *) 	0xFFFD0040) /* (TSADC) Channel Data Register 4*/
#define AT91C_TSADC_CDR2 ((AT91_REG *) 	0xFFFD0038) /* (TSADC) Channel Data Register 2*/
#define AT91C_TSADC_TRGR ((AT91_REG *) 	0xFFFD0008) /* (TSADC) Trigger Register*/
#define AT91C_TSADC_IDR ((AT91_REG *) 	0xFFFD0028) /* (TSADC) Interrupt Disable Register*/
#define AT91C_TSADC_CHER ((AT91_REG *) 	0xFFFD0010) /* (TSADC) Channel Enable Register*/
#define AT91C_TSADC_CDR5 ((AT91_REG *) 	0xFFFD0044) /* (TSADC) Channel Data Register 5*/
#define AT91C_TSADC_CDR3 ((AT91_REG *) 	0xFFFD003C) /* (TSADC) Channel Data Register 3*/
#define AT91C_TSADC_TSR ((AT91_REG *) 	0xFFFD000C) /* (TSADC) Touch Screen Register*/
#define AT91C_TSADC_IMR ((AT91_REG *) 	0xFFFD002C) /* (TSADC) Interrupt Mask Register*/
#define AT91C_TSADC_CR  ((AT91_REG *) 	0xFFFD0000) /* (TSADC) Control Register*/
#define AT91C_TSADC_SR  ((AT91_REG *) 	0xFFFD001C) /* (TSADC) Status Register*/
#define AT91C_TSADC_LCDR ((AT91_REG *) 	0xFFFD0020) /* (TSADC) Last Converted Register*/
#define AT91C_TSADC_CHSR ((AT91_REG *) 	0xFFFD0018) /* (TSADC) Channel Status Register*/
#define AT91C_TSADC_CDR0 ((AT91_REG *) 	0xFFFD0030) /* (TSADC) Channel Data Register 0*/
#define AT91C_TSADC_CHDR ((AT91_REG *) 	0xFFFD0014) /* (TSADC) Channel Disable Register*/
#define AT91C_TSADC_CDR1 ((AT91_REG *) 	0xFFFD0034) /* (TSADC) Channel Data Register 1*/
/* ========== Register definition for UDPHS_EPTFIFO peripheral ========== */
#define AT91C_UDPHS_EPTFIFO_READEPTF ((AT91_REG *) 	0x006F0000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 15*/
#define AT91C_UDPHS_EPTFIFO_READEPT5 ((AT91_REG *) 	0x00650000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5*/
#define AT91C_UDPHS_EPTFIFO_READEPT1 ((AT91_REG *) 	0x00610000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1*/
#define AT91C_UDPHS_EPTFIFO_READEPTE ((AT91_REG *) 	0x006E0000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 14*/
#define AT91C_UDPHS_EPTFIFO_READEPT4 ((AT91_REG *) 	0x00640000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4*/
#define AT91C_UDPHS_EPTFIFO_READEPTD ((AT91_REG *) 	0x006D0000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 13*/
#define AT91C_UDPHS_EPTFIFO_READEPT2 ((AT91_REG *) 	0x00620000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2*/
#define AT91C_UDPHS_EPTFIFO_READEPT6 ((AT91_REG *) 	0x00660000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6*/
#define AT91C_UDPHS_EPTFIFO_READEPT9 ((AT91_REG *) 	0x00690000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 9*/
#define AT91C_UDPHS_EPTFIFO_READEPT0 ((AT91_REG *) 	0x00600000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0*/
#define AT91C_UDPHS_EPTFIFO_READEPTA ((AT91_REG *) 	0x006A0000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 10*/
#define AT91C_UDPHS_EPTFIFO_READEPT3 ((AT91_REG *) 	0x00630000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3*/
#define AT91C_UDPHS_EPTFIFO_READEPTC ((AT91_REG *) 	0x006C0000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 12*/
#define AT91C_UDPHS_EPTFIFO_READEPTB ((AT91_REG *) 	0x006B0000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 11*/
#define AT91C_UDPHS_EPTFIFO_READEPT8 ((AT91_REG *) 	0x00680000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 8*/
#define AT91C_UDPHS_EPTFIFO_READEPT7 ((AT91_REG *) 	0x00670000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 7*/
/* ========== Register definition for UDPHS_EPT_0 peripheral ========== */
#define AT91C_UDPHS_EPT_0_EPTSTA ((AT91_REG *) 	0xFFFD411C) /* (UDPHS_EPT_0) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTLENB ((AT91_REG *) 	0xFFFD4104) /* (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_0_EPTCFG ((AT91_REG *) 	0xFFFD4100) /* (UDPHS_EPT_0) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_0_EPTSETSTA ((AT91_REG *) 	0xFFFD4114) /* (UDPHS_EPT_0) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTLDIS ((AT91_REG *) 	0xFFFD4108) /* (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_0_EPTCLRSTA ((AT91_REG *) 	0xFFFD4118) /* (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTL ((AT91_REG *) 	0xFFFD410C) /* (UDPHS_EPT_0) UDPHS Endpoint Control Register*/
/* ========== Register definition for UDPHS_EPT_1 peripheral ========== */
#define AT91C_UDPHS_EPT_1_EPTCTL ((AT91_REG *) 	0xFFFD412C) /* (UDPHS_EPT_1) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_1_EPTSTA ((AT91_REG *) 	0xFFFD413C) /* (UDPHS_EPT_1) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCTLDIS ((AT91_REG *) 	0xFFFD4128) /* (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_1_EPTCFG ((AT91_REG *) 	0xFFFD4120) /* (UDPHS_EPT_1) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_1_EPTSETSTA ((AT91_REG *) 	0xFFFD4134) /* (UDPHS_EPT_1) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCLRSTA ((AT91_REG *) 	0xFFFD4138) /* (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCTLENB ((AT91_REG *) 	0xFFFD4124) /* (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_2 peripheral ========== */
#define AT91C_UDPHS_EPT_2_EPTCLRSTA ((AT91_REG *) 	0xFFFD4158) /* (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCTLDIS ((AT91_REG *) 	0xFFFD4148) /* (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_2_EPTSETSTA ((AT91_REG *) 	0xFFFD4154) /* (UDPHS_EPT_2) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCFG ((AT91_REG *) 	0xFFFD4140) /* (UDPHS_EPT_2) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_2_EPTCTL ((AT91_REG *) 	0xFFFD414C) /* (UDPHS_EPT_2) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_2_EPTSTA ((AT91_REG *) 	0xFFFD415C) /* (UDPHS_EPT_2) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCTLENB ((AT91_REG *) 	0xFFFD4144) /* (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_3 peripheral ========== */
#define AT91C_UDPHS_EPT_3_EPTSTA ((AT91_REG *) 	0xFFFD417C) /* (UDPHS_EPT_3) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_3_EPTSETSTA ((AT91_REG *) 	0xFFFD4174) /* (UDPHS_EPT_3) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_3_EPTCTL ((AT91_REG *) 	0xFFFD416C) /* (UDPHS_EPT_3) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_3_EPTCTLENB ((AT91_REG *) 	0xFFFD4164) /* (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_3_EPTCLRSTA ((AT91_REG *) 	0xFFFD4178) /* (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_3_EPTCFG ((AT91_REG *) 	0xFFFD4160) /* (UDPHS_EPT_3) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_3_EPTCTLDIS ((AT91_REG *) 	0xFFFD4168) /* (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_4 peripheral ========== */
#define AT91C_UDPHS_EPT_4_EPTCLRSTA ((AT91_REG *) 	0xFFFD4198) /* (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCTL ((AT91_REG *) 	0xFFFD418C) /* (UDPHS_EPT_4) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_4_EPTSTA ((AT91_REG *) 	0xFFFD419C) /* (UDPHS_EPT_4) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCTLENB ((AT91_REG *) 	0xFFFD4184) /* (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_4_EPTCFG ((AT91_REG *) 	0xFFFD4180) /* (UDPHS_EPT_4) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_4_EPTSETSTA ((AT91_REG *) 	0xFFFD4194) /* (UDPHS_EPT_4) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCTLDIS ((AT91_REG *) 	0xFFFD4188) /* (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_5 peripheral ========== */
#define AT91C_UDPHS_EPT_5_EPTSETSTA ((AT91_REG *) 	0xFFFD41B4) /* (UDPHS_EPT_5) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCTLDIS ((AT91_REG *) 	0xFFFD41A8) /* (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_5_EPTCTL ((AT91_REG *) 	0xFFFD41AC) /* (UDPHS_EPT_5) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_5_EPTCTLENB ((AT91_REG *) 	0xFFFD41A4) /* (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_5_EPTCFG ((AT91_REG *) 	0xFFFD41A0) /* (UDPHS_EPT_5) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_5_EPTCLRSTA ((AT91_REG *) 	0xFFFD41B8) /* (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_5_EPTSTA ((AT91_REG *) 	0xFFFD41BC) /* (UDPHS_EPT_5) UDPHS Endpoint Status Register*/
/* ========== Register definition for UDPHS_EPT_6 peripheral ========== */
#define AT91C_UDPHS_EPT_6_EPTCFG ((AT91_REG *) 	0xFFFD41C0) /* (UDPHS_EPT_6) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_6_EPTCLRSTA ((AT91_REG *) 	0xFFFD41D8) /* (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCTL ((AT91_REG *) 	0xFFFD41CC) /* (UDPHS_EPT_6) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_6_EPTCTLDIS ((AT91_REG *) 	0xFFFD41C8) /* (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_6_EPTSTA ((AT91_REG *) 	0xFFFD41DC) /* (UDPHS_EPT_6) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_6_EPTSETSTA ((AT91_REG *) 	0xFFFD41D4) /* (UDPHS_EPT_6) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCTLENB ((AT91_REG *) 	0xFFFD41C4) /* (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_7 peripheral ========== */
#define AT91C_UDPHS_EPT_7_EPTSETSTA ((AT91_REG *) 	0xFFFD41F4) /* (UDPHS_EPT_7) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_7_EPTCTLDIS ((AT91_REG *) 	0xFFFD41E8) /* (UDPHS_EPT_7) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_7_EPTCTLENB ((AT91_REG *) 	0xFFFD41E4) /* (UDPHS_EPT_7) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_7_EPTSTA ((AT91_REG *) 	0xFFFD41FC) /* (UDPHS_EPT_7) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_7_EPTCLRSTA ((AT91_REG *) 	0xFFFD41F8) /* (UDPHS_EPT_7) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_7_EPTCTL ((AT91_REG *) 	0xFFFD41EC) /* (UDPHS_EPT_7) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_7_EPTCFG ((AT91_REG *) 	0xFFFD41E0) /* (UDPHS_EPT_7) UDPHS Endpoint Config Register*/
/* ========== Register definition for UDPHS_EPT_8 peripheral ========== */
#define AT91C_UDPHS_EPT_8_EPTCLRSTA ((AT91_REG *) 	0xFFFD4218) /* (UDPHS_EPT_8) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_8_EPTCTLDIS ((AT91_REG *) 	0xFFFD4208) /* (UDPHS_EPT_8) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_8_EPTSTA ((AT91_REG *) 	0xFFFD421C) /* (UDPHS_EPT_8) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_8_EPTCFG ((AT91_REG *) 	0xFFFD4200) /* (UDPHS_EPT_8) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_8_EPTCTL ((AT91_REG *) 	0xFFFD420C) /* (UDPHS_EPT_8) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_8_EPTSETSTA ((AT91_REG *) 	0xFFFD4214) /* (UDPHS_EPT_8) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_8_EPTCTLENB ((AT91_REG *) 	0xFFFD4204) /* (UDPHS_EPT_8) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_9 peripheral ========== */
#define AT91C_UDPHS_EPT_9_EPTCLRSTA ((AT91_REG *) 	0xFFFD4238) /* (UDPHS_EPT_9) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_9_EPTCTLENB ((AT91_REG *) 	0xFFFD4224) /* (UDPHS_EPT_9) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_9_EPTSTA ((AT91_REG *) 	0xFFFD423C) /* (UDPHS_EPT_9) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_9_EPTSETSTA ((AT91_REG *) 	0xFFFD4234) /* (UDPHS_EPT_9) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_9_EPTCTL ((AT91_REG *) 	0xFFFD422C) /* (UDPHS_EPT_9) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_9_EPTCFG ((AT91_REG *) 	0xFFFD4220) /* (UDPHS_EPT_9) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_9_EPTCTLDIS ((AT91_REG *) 	0xFFFD4228) /* (UDPHS_EPT_9) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_10 peripheral ========== */
#define AT91C_UDPHS_EPT_10_EPTCTL ((AT91_REG *) 	0xFFFD424C) /* (UDPHS_EPT_10) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_10_EPTSETSTA ((AT91_REG *) 	0xFFFD4254) /* (UDPHS_EPT_10) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_10_EPTCFG ((AT91_REG *) 	0xFFFD4240) /* (UDPHS_EPT_10) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_10_EPTCLRSTA ((AT91_REG *) 	0xFFFD4258) /* (UDPHS_EPT_10) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_10_EPTSTA ((AT91_REG *) 	0xFFFD425C) /* (UDPHS_EPT_10) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_10_EPTCTLDIS ((AT91_REG *) 	0xFFFD4248) /* (UDPHS_EPT_10) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_10_EPTCTLENB ((AT91_REG *) 	0xFFFD4244) /* (UDPHS_EPT_10) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_11 peripheral ========== */
#define AT91C_UDPHS_EPT_11_EPTCTL ((AT91_REG *) 	0xFFFD426C) /* (UDPHS_EPT_11) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_11_EPTCFG ((AT91_REG *) 	0xFFFD4260) /* (UDPHS_EPT_11) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_11_EPTSTA ((AT91_REG *) 	0xFFFD427C) /* (UDPHS_EPT_11) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_11_EPTCTLENB ((AT91_REG *) 	0xFFFD4264) /* (UDPHS_EPT_11) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_11_EPTCLRSTA ((AT91_REG *) 	0xFFFD4278) /* (UDPHS_EPT_11) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_11_EPTSETSTA ((AT91_REG *) 	0xFFFD4274) /* (UDPHS_EPT_11) UDPHS Endpoint Set Status Register*/
