una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
#define AT91C_UDPHS_EPT_11_EPTCTLDIS ((AT91_REG *) 	0xFFFD4268) /* (UDPHS_EPT_11) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_12 peripheral ========== */
#define AT91C_UDPHS_EPT_12_EPTCTLENB ((AT91_REG *) 	0xFFFD4284) /* (UDPHS_EPT_12) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_12_EPTSTA ((AT91_REG *) 	0xFFFD429C) /* (UDPHS_EPT_12) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_12_EPTCTLDIS ((AT91_REG *) 	0xFFFD4288) /* (UDPHS_EPT_12) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_12_EPTSETSTA ((AT91_REG *) 	0xFFFD4294) /* (UDPHS_EPT_12) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_12_EPTCLRSTA ((AT91_REG *) 	0xFFFD4298) /* (UDPHS_EPT_12) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_12_EPTCTL ((AT91_REG *) 	0xFFFD428C) /* (UDPHS_EPT_12) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_12_EPTCFG ((AT91_REG *) 	0xFFFD4280) /* (UDPHS_EPT_12) UDPHS Endpoint Config Register*/
/* ========== Register definition for UDPHS_EPT_13 peripheral ========== */
#define AT91C_UDPHS_EPT_13_EPTSETSTA ((AT91_REG *) 	0xFFFD42B4) /* (UDPHS_EPT_13) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_13_EPTCTLENB ((AT91_REG *) 	0xFFFD42A4) /* (UDPHS_EPT_13) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_13_EPTCFG ((AT91_REG *) 	0xFFFD42A0) /* (UDPHS_EPT_13) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_13_EPTSTA ((AT91_REG *) 	0xFFFD42BC) /* (UDPHS_EPT_13) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_13_EPTCLRSTA ((AT91_REG *) 	0xFFFD42B8) /* (UDPHS_EPT_13) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_13_EPTCTLDIS ((AT91_REG *) 	0xFFFD42A8) /* (UDPHS_EPT_13) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_13_EPTCTL ((AT91_REG *) 	0xFFFD42AC) /* (UDPHS_EPT_13) UDPHS Endpoint Control Register*/
/* ========== Register definition for UDPHS_EPT_14 peripheral ========== */
#define AT91C_UDPHS_EPT_14_EPTCFG ((AT91_REG *) 	0xFFFD42C0) /* (UDPHS_EPT_14) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_14_EPTCLRSTA ((AT91_REG *) 	0xFFFD42D8) /* (UDPHS_EPT_14) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_14_EPTCTLENB ((AT91_REG *) 	0xFFFD42C4) /* (UDPHS_EPT_14) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_14_EPTCTL ((AT91_REG *) 	0xFFFD42CC) /* (UDPHS_EPT_14) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_14_EPTSTA ((AT91_REG *) 	0xFFFD42DC) /* (UDPHS_EPT_14) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_14_EPTSETSTA ((AT91_REG *) 	0xFFFD42D4) /* (UDPHS_EPT_14) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_14_EPTCTLDIS ((AT91_REG *) 	0xFFFD42C8) /* (UDPHS_EPT_14) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_15 peripheral ========== */
#define AT91C_UDPHS_EPT_15_EPTCLRSTA ((AT91_REG *) 	0xFFFD42F8) /* (UDPHS_EPT_15) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_15_EPTCTLDIS ((AT91_REG *) 	0xFFFD42E8) /* (UDPHS_EPT_15) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_15_EPTSTA ((AT91_REG *) 	0xFFFD42FC) /* (UDPHS_EPT_15) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_15_EPTCFG ((AT91_REG *) 	0xFFFD42E0) /* (UDPHS_EPT_15) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_15_EPTCTLENB ((AT91_REG *) 	0xFFFD42E4) /* (UDPHS_EPT_15) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_15_EPTCTL ((AT91_REG *) 	0xFFFD42EC) /* (UDPHS_EPT_15) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_15_EPTSETSTA ((AT91_REG *) 	0xFFFD42F4) /* (UDPHS_EPT_15) UDPHS Endpoint Set Status Register*/
/* ========== Register definition for UDPHS_DMA_1 peripheral ========== */
#define AT91C_UDPHS_DMA_1_DMACONTROL ((AT91_REG *) 	0xFFFD4318) /* (UDPHS_DMA_1) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_1_DMAADDRESS ((AT91_REG *) 	0xFFFD4314) /* (UDPHS_DMA_1) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_1_DMASTATUS ((AT91_REG *) 	0xFFFD431C) /* (UDPHS_DMA_1) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_1_DMANXTDSC ((AT91_REG *) 	0xFFFD4310) /* (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address*/
/* ========== Register definition for UDPHS_DMA_2 peripheral ========== */
#define AT91C_UDPHS_DMA_2_DMACONTROL ((AT91_REG *) 	0xFFFD4328) /* (UDPHS_DMA_2) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_2_DMASTATUS ((AT91_REG *) 	0xFFFD432C) /* (UDPHS_DMA_2) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_2_DMANXTDSC ((AT91_REG *) 	0xFFFD4320) /* (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_2_DMAADDRESS ((AT91_REG *) 	0xFFFD4324) /* (UDPHS_DMA_2) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS_DMA_3 peripheral ========== */
#define AT91C_UDPHS_DMA_3_DMACONTROL ((AT91_REG *) 	0xFFFD4338) /* (UDPHS_DMA_3) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_3_DMAADDRESS ((AT91_REG *) 	0xFFFD4334) /* (UDPHS_DMA_3) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_3_DMANXTDSC ((AT91_REG *) 	0xFFFD4330) /* (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_3_DMASTATUS ((AT91_REG *) 	0xFFFD433C) /* (UDPHS_DMA_3) UDPHS DMA Channel Status Register*/
/* ========== Register definition for UDPHS_DMA_4 peripheral ========== */
#define AT91C_UDPHS_DMA_4_DMASTATUS ((AT91_REG *) 	0xFFFD434C) /* (UDPHS_DMA_4) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_4_DMANXTDSC ((AT91_REG *) 	0xFFFD4340) /* (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_4_DMAADDRESS ((AT91_REG *) 	0xFFFD4344) /* (UDPHS_DMA_4) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_4_DMACONTROL ((AT91_REG *) 	0xFFFD4348) /* (UDPHS_DMA_4) UDPHS DMA Channel Control Register*/
/* ========== Register definition for UDPHS_DMA_5 peripheral ========== */
#define AT91C_UDPHS_DMA_5_DMASTATUS ((AT91_REG *) 	0xFFFD435C) /* (UDPHS_DMA_5) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_5_DMACONTROL ((AT91_REG *) 	0xFFFD4358) /* (UDPHS_DMA_5) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_5_DMAADDRESS ((AT91_REG *) 	0xFFFD4354) /* (UDPHS_DMA_5) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_5_DMANXTDSC ((AT91_REG *) 	0xFFFD4350) /* (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address*/
/* ========== Register definition for UDPHS_DMA_6 peripheral ========== */
#define AT91C_UDPHS_DMA_6_DMAADDRESS ((AT91_REG *) 	0xFFFD4364) /* (UDPHS_DMA_6) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_6_DMACONTROL ((AT91_REG *) 	0xFFFD4368) /* (UDPHS_DMA_6) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_6_DMASTATUS ((AT91_REG *) 	0xFFFD436C) /* (UDPHS_DMA_6) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_6_DMANXTDSC ((AT91_REG *) 	0xFFFD4360) /* (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address*/
/* ========== Register definition for UDPHS_DMA_7 peripheral ========== */
#define AT91C_UDPHS_DMA_7_DMANXTDSC ((AT91_REG *) 	0xFFFD4370) /* (UDPHS_DMA_7) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_7_DMAADDRESS ((AT91_REG *) 	0xFFFD4374) /* (UDPHS_DMA_7) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_7_DMASTATUS ((AT91_REG *) 	0xFFFD437C) /* (UDPHS_DMA_7) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_7_DMACONTROL ((AT91_REG *) 	0xFFFD4378) /* (UDPHS_DMA_7) UDPHS DMA Channel Control Register*/
/* ========== Register definition for UDPHS peripheral ========== */
#define AT91C_UDPHS_TSTMODREG ((AT91_REG *) 	0xFFFD40DC) /* (UDPHS) UDPHS Test Mode Register*/
#define AT91C_UDPHS_RIPNAME2 ((AT91_REG *) 	0xFFFD40F4) /* (UDPHS) UDPHS Name2 Register*/
#define AT91C_UDPHS_TSTSOFCNT ((AT91_REG *) 	0xFFFD40D0) /* (UDPHS) UDPHS Test SOF Counter Register*/
#define AT91C_UDPHS_EPTRST ((AT91_REG *) 	0xFFFD401C) /* (UDPHS) UDPHS Endpoints Reset Register*/
#define AT91C_UDPHS_TSTCNTA ((AT91_REG *) 	0xFFFD40D4) /* (UDPHS) UDPHS Test A Counter Register*/
#define AT91C_UDPHS_IEN ((AT91_REG *) 	0xFFFD4010) /* (UDPHS) UDPHS Interrupt Enable Register*/
#define AT91C_UDPHS_TSTCNTB ((AT91_REG *) 	0xFFFD40D8) /* (UDPHS) UDPHS Test B Counter Register*/
#define AT91C_UDPHS_TST ((AT91_REG *) 	0xFFFD40E0) /* (UDPHS) UDPHS Test Register*/
#define AT91C_UDPHS_IPFEATURES ((AT91_REG *) 	0xFFFD40F8) /* (UDPHS) UDPHS Features Register*/
#define AT91C_UDPHS_RIPNAME1 ((AT91_REG *) 	0xFFFD40F0) /* (UDPHS) UDPHS Name1 Register*/
#define AT91C_UDPHS_FNUM ((AT91_REG *) 	0xFFFD4004) /* (UDPHS) UDPHS Frame Number Register*/
#define AT91C_UDPHS_CLRINT ((AT91_REG *) 	0xFFFD4018) /* (UDPHS) UDPHS Clear Interrupt Register*/
#define AT91C_UDPHS_IPVERSION ((AT91_REG *) 	0xFFFD40FC) /* (UDPHS) UDPHS Version Register*/
#define AT91C_UDPHS_RIPPADDRSIZE ((AT91_REG *) 	0xFFFD40EC) /* (UDPHS) UDPHS PADDRSIZE Register*/
#define AT91C_UDPHS_CTRL ((AT91_REG *) 	0xFFFD4000) /* (UDPHS) UDPHS Control Register*/
#define AT91C_UDPHS_INTSTA ((AT91_REG *) 	0xFFFD4014) /* (UDPHS) UDPHS Interrupt Status Register*/
/* ========== Register definition for PDC_AC97C peripheral ========== */
#define AT91C_AC97C_PTSR ((AT91_REG *) 	0xFFFD8124) /* (PDC_AC97C) PDC Transfer Status Register*/
#define AT91C_AC97C_PTCR ((AT91_REG *) 	0xFFFD8120) /* (PDC_AC97C) PDC Transfer Control Register*/
#define AT91C_AC97C_TNPR ((AT91_REG *) 	0xFFFD8118) /* (PDC_AC97C) Transmit Next Pointer Register*/
#define AT91C_AC97C_TNCR ((AT91_REG *) 	0xFFFD811C) /* (PDC_AC97C) Transmit Next Counter Register*/
#define AT91C_AC97C_RNPR ((AT91_REG *) 	0xFFFD8110) /* (PDC_AC97C) Receive Next Pointer Register*/
#define AT91C_AC97C_RNCR ((AT91_REG *) 	0xFFFD8114) /* (PDC_AC97C) Receive Next Counter Register*/
#define AT91C_AC97C_RPR ((AT91_REG *) 	0xFFFD8100) /* (PDC_AC97C) Receive Pointer Register*/
#define AT91C_AC97C_TCR ((AT91_REG *) 	0xFFFD810C) /* (PDC_AC97C) Transmit Counter Register*/
#define AT91C_AC97C_TPR ((AT91_REG *) 	0xFFFD8108) /* (PDC_AC97C) Transmit Pointer Register*/
#define AT91C_AC97C_RCR ((AT91_REG *) 	0xFFFD8104) /* (PDC_AC97C) Receive Counter Register*/
/* ========== Register definition for AC97C peripheral ========== */
#define AT91C_AC97C_CBSR ((AT91_REG *) 	0xFFFD8038) /* (AC97C) Channel B Status Register*/
#define AT91C_AC97C_CBMR ((AT91_REG *) 	0xFFFD803C) /* (AC97C) Channel B Mode Register*/
#define AT91C_AC97C_CBRHR ((AT91_REG *) 	0xFFFD8030) /* (AC97C) Channel B Receive Holding Register (optional)*/
#define AT91C_AC97C_COTHR ((AT91_REG *) 	0xFFFD8044) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_OCA ((AT91_REG *) 	0xFFFD8014) /* (AC97C) Output Channel Assignement Register*/
#define AT91C_AC97C_IMR ((AT91_REG *) 	0xFFFD805C) /* (AC97C) Interrupt Mask Register*/
#define AT91C_AC97C_CORHR ((AT91_REG *) 	0xFFFD8040) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_CBTHR ((AT91_REG *) 	0xFFFD8034) /* (AC97C) Channel B Transmit Holding Register (optional)*/
#define AT91C_AC97C_CARHR ((AT91_REG *) 	0xFFFD8020) /* (AC97C) Channel A Receive Holding Register*/
#define AT91C_AC97C_CASR ((AT91_REG *) 	0xFFFD8028) /* (AC97C) Channel A Status Register*/
#define AT91C_AC97C_IER ((AT91_REG *) 	0xFFFD8054) /* (AC97C) Interrupt Enable Register*/
#define AT91C_AC97C_MR  ((AT91_REG *) 	0xFFFD8008) /* (AC97C) Mode Register*/
#define AT91C_AC97C_COSR ((AT91_REG *) 	0xFFFD8048) /* (AC97C) CODEC Status Register*/
#define AT91C_AC97C_COMR ((AT91_REG *) 	0xFFFD804C) /* (AC97C) CODEC Mask Status Register*/
#define AT91C_AC97C_CATHR ((AT91_REG *) 	0xFFFD8024) /* (AC97C) Channel A Transmit Holding Register*/
#define AT91C_AC97C_ICA ((AT91_REG *) 	0xFFFD8010) /* (AC97C) Input Channel AssignementRegister*/
#define AT91C_AC97C_IDR ((AT91_REG *) 	0xFFFD8058) /* (AC97C) Interrupt Disable Register*/
#define AT91C_AC97C_CAMR ((AT91_REG *) 	0xFFFD802C) /* (AC97C) Channel A Mode Register*/
#define AT91C_AC97C_VERSION ((AT91_REG *) 	0xFFFD80FC) /* (AC97C) Version Register*/
#define AT91C_AC97C_SR  ((AT91_REG *) 	0xFFFD8050) /* (AC97C) Status Register*/
/* ========== Register definition for LCDC peripheral ========== */
#define AT91C_LCDC_MVAL ((AT91_REG *) 	0x00500818) /* (LCDC) LCD Mode Toggle Rate Value Register*/
#define AT91C_LCDC_PWRCON ((AT91_REG *) 	0x0050083C) /* (LCDC) Power Control Register*/
#define AT91C_LCDC_ISR  ((AT91_REG *) 	0x00500854) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_FRMP1 ((AT91_REG *) 	0x00500008) /* (LCDC) DMA Frame Pointer Register 1*/
#define AT91C_LCDC_CTRSTVAL ((AT91_REG *) 	0x00500844) /* (LCDC) Contrast Value Register*/
#define AT91C_LCDC_ICR  ((AT91_REG *) 	0x00500858) /* (LCDC) Interrupt Clear Register*/
#define AT91C_LCDC_TIM1 ((AT91_REG *) 	0x00500808) /* (LCDC) LCD Timing Config 1 Register*/
#define AT91C_LCDC_DMACON ((AT91_REG *) 	0x0050001C) /* (LCDC) DMA Control Register*/
#define AT91C_LCDC_ITR  ((AT91_REG *) 	0x00500860) /* (LCDC) Interrupts Test Register*/
#define AT91C_LCDC_IDR  ((AT91_REG *) 	0x0050084C) /* (LCDC) Interrupt Disable Register*/
#define AT91C_LCDC_DP4_7 ((AT91_REG *) 	0x00500820) /* (LCDC) Dithering Pattern DP4_7 Register*/
#define AT91C_LCDC_DP5_7 ((AT91_REG *) 	0x0050082C) /* (LCDC) Dithering Pattern DP5_7 Register*/
#define AT91C_LCDC_IRR  ((AT91_REG *) 	0x00500864) /* (LCDC) Interrupts Raw Status Register*/
#define AT91C_LCDC_DP3_4 ((AT91_REG *) 	0x00500830) /* (LCDC) Dithering Pattern DP3_4 Register*/
#define AT91C_LCDC_IMR  ((AT91_REG *) 	0x00500850) /* (LCDC) Interrupt Mask Register*/
#define AT91C_LCDC_LCDFRCFG ((AT91_REG *) 	0x00500810) /* (LCDC) LCD Frame Config Register*/
#define AT91C_LCDC_CTRSTCON ((AT91_REG *) 	0x00500840) /* (LCDC) Contrast Control Register*/
#define AT91C_LCDC_DP1_2 ((AT91_REG *) 	0x0050081C) /* (LCDC) Dithering Pattern DP1_2 Register*/
#define AT91C_LCDC_FRMP2 ((AT91_REG *) 	0x0050000C) /* (LCDC) DMA Frame Pointer Register 2*/
#define AT91C_LCDC_LCDCON1 ((AT91_REG *) 	0x00500800) /* (LCDC) LCD Control 1 Register*/
#define AT91C_LCDC_DP4_5 ((AT91_REG *) 	0x00500834) /* (LCDC) Dithering Pattern DP4_5 Register*/
#define AT91C_LCDC_FRMA2 ((AT91_REG *) 	0x00500014) /* (LCDC) DMA Frame Address Register 2*/
#define AT91C_LCDC_BA1  ((AT91_REG *) 	0x00500000) /* (LCDC) DMA Base Address Register 1*/
#define AT91C_LCDC_DMA2DCFG ((AT91_REG *) 	0x00500020) /* (LCDC) DMA 2D addressing configuration*/
#define AT91C_LCDC_LUT_ENTRY ((AT91_REG *) 	0x00500C00) /* (LCDC) LUT Entries Register*/
#define AT91C_LCDC_DP6_7 ((AT91_REG *) 	0x00500838) /* (LCDC) Dithering Pattern DP6_7 Register*/
#define AT91C_LCDC_FRMCFG ((AT91_REG *) 	0x00500018) /* (LCDC) DMA Frame Configuration Register*/
#define AT91C_LCDC_TIM2 ((AT91_REG *) 	0x0050080C) /* (LCDC) LCD Timing Config 2 Register*/
#define AT91C_LCDC_DP3_5 ((AT91_REG *) 	0x00500824) /* (LCDC) Dithering Pattern DP3_5 Register*/
#define AT91C_LCDC_FRMA1 ((AT91_REG *) 	0x00500010) /* (LCDC) DMA Frame Address Register 1*/
#define AT91C_LCDC_IER  ((AT91_REG *) 	0x00500848) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_DP2_3 ((AT91_REG *) 	0x00500828) /* (LCDC) Dithering Pattern DP2_3 Register*/
#define AT91C_LCDC_FIFO ((AT91_REG *) 	0x00500814) /* (LCDC) LCD FIFO Register*/
#define AT91C_LCDC_BA2  ((AT91_REG *) 	0x00500004) /* (LCDC) DMA Base Address Register 2*/
#define AT91C_LCDC_LCDCON2 ((AT91_REG *) 	0x00500804) /* (LCDC) LCD Control 2 Register*/
#define AT91C_LCDC_GPR  ((AT91_REG *) 	0x0050085C) /* (LCDC) General Purpose Register*/
/* ========== Register definition for LCDC_16B_TFT peripheral ========== */
#define AT91C_TFT_MVAL  ((AT91_REG *) 	0x00500818) /* (LCDC_16B_TFT) LCD Mode Toggle Rate Value Register*/
#define AT91C_TFT_PWRCON ((AT91_REG *) 	0x0050083C) /* (LCDC_16B_TFT) Power Control Register*/
#define AT91C_TFT_ISR   ((AT91_REG *) 	0x00500854) /* (LCDC_16B_TFT) Interrupt Enable Register*/
#define AT91C_TFT_FRMP1 ((AT91_REG *) 	0x00500008) /* (LCDC_16B_TFT) DMA Frame Pointer Register 1*/
#define AT91C_TFT_CTRSTVAL ((AT91_REG *) 	0x00500844) /* (LCDC_16B_TFT) Contrast Value Register*/
#define AT91C_TFT_ICR   ((AT91_REG *) 	0x00500858) /* (LCDC_16B_TFT) Interrupt Clear Register*/
#define AT91C_TFT_TIM1  ((AT91_REG *) 	0x00500808) /* (LCDC_16B_TFT) LCD Timing Config 1 Register*/
#define AT91C_TFT_DMACON ((AT91_REG *) 	0x0050001C) /* (LCDC_16B_TFT) DMA Control Register*/
#define AT91C_TFT_ITR   ((AT91_REG *) 	0x00500860) /* (LCDC_16B_TFT) Interrupts Test Register*/
#define AT91C_TFT_IDR   ((AT91_REG *) 	0x0050084C) /* (LCDC_16B_TFT) Interrupt Disable Register*/
#define AT91C_TFT_DP4_7 ((AT91_REG *) 	0x00500820) /* (LCDC_16B_TFT) Dithering Pattern DP4_7 Register*/
#define AT91C_TFT_DP5_7 ((AT91_REG *) 	0x0050082C) /* (LCDC_16B_TFT) Dithering Pattern DP5_7 Register*/
#define AT91C_TFT_IRR   ((AT91_REG *) 	0x00500864) /* (LCDC_16B_TFT) Interrupts Raw Status Register*/
#define AT91C_TFT_DP3_4 ((AT91_REG *) 	0x00500830) /* (LCDC_16B_TFT) Dithering Pattern DP3_4 Register*/
#define AT91C_TFT_IMR   ((AT91_REG *) 	0x00500850) /* (LCDC_16B_TFT) Interrupt Mask Register*/
#define AT91C_TFT_LCDFRCFG ((AT91_REG *) 	0x00500810) /* (LCDC_16B_TFT) LCD Frame Config Register*/
#define AT91C_TFT_CTRSTCON ((AT91_REG *) 	0x00500840) /* (LCDC_16B_TFT) Contrast Control Register*/
#define AT91C_TFT_DP1_2 ((AT91_REG *) 	0x0050081C) /* (LCDC_16B_TFT) Dithering Pattern DP1_2 Register*/
#define AT91C_TFT_FRMP2 ((AT91_REG *) 	0x0050000C) /* (LCDC_16B_TFT) DMA Frame Pointer Register 2*/
#define AT91C_TFT_LCDCON1 ((AT91_REG *) 	0x00500800) /* (LCDC_16B_TFT) LCD Control 1 Register*/
#define AT91C_TFT_DP4_5 ((AT91_REG *) 	0x00500834) /* (LCDC_16B_TFT) Dithering Pattern DP4_5 Register*/
#define AT91C_TFT_FRMA2 ((AT91_REG *) 	0x00500014) /* (LCDC_16B_TFT) DMA Frame Address Register 2*/
#define AT91C_TFT_BA1   ((AT91_REG *) 	0x00500000) /* (LCDC_16B_TFT) DMA Base Address Register 1*/
#define AT91C_TFT_DMA2DCFG ((AT91_REG *) 	0x00500020) /* (LCDC_16B_TFT) DMA 2D addressing configuration*/
#define AT91C_TFT_LUT_ENTRY ((AT91_REG *) 	0x00500C00) /* (LCDC_16B_TFT) LUT Entries Register*/
#define AT91C_TFT_DP6_7 ((AT91_REG *) 	0x00500838) /* (LCDC_16B_TFT) Dithering Pattern DP6_7 Register*/
#define AT91C_TFT_FRMCFG ((AT91_REG *) 	0x00500018) /* (LCDC_16B_TFT) DMA Frame Configuration Register*/
#define AT91C_TFT_TIM2  ((AT91_REG *) 	0x0050080C) /* (LCDC_16B_TFT) LCD Timing Config 2 Register*/
#define AT91C_TFT_DP3_5 ((AT91_REG *) 	0x00500824) /* (LCDC_16B_TFT) Dithering Pattern DP3_5 Register*/
#define AT91C_TFT_FRMA1 ((AT91_REG *) 	0x00500010) /* (LCDC_16B_TFT) DMA Frame Address Register 1*/
#define AT91C_TFT_IER   ((AT91_REG *) 	0x00500848) /* (LCDC_16B_TFT) Interrupt Enable Register*/
#define AT91C_TFT_DP2_3 ((AT91_REG *) 	0x00500828) /* (LCDC_16B_TFT) Dithering Pattern DP2_3 Register*/
#define AT91C_TFT_FIFO  ((AT91_REG *) 	0x00500814) /* (LCDC_16B_TFT) LCD FIFO Register*/
#define AT91C_TFT_BA2   ((AT91_REG *) 	0x00500004) /* (LCDC_16B_TFT) DMA Base Address Register 2*/
#define AT91C_TFT_LCDCON2 ((AT91_REG *) 	0x00500804) /* (LCDC_16B_TFT) LCD Control 2 Register*/
#define AT91C_TFT_GPR   ((AT91_REG *) 	0x0050085C) /* (LCDC_16B_TFT) General Purpose Register*/
/* ========== Register definition for HDMA_CH_0 peripheral ========== */
#define AT91C_HDMA_CH_0_CFG ((AT91_REG *) 	0xFFFFE650) /* (HDMA_CH_0) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_0_CTRLB ((AT91_REG *) 	0xFFFFE64C) /* (HDMA_CH_0) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_0_DADDR ((AT91_REG *) 	0xFFFFE640) /* (HDMA_CH_0) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_0_DPIP ((AT91_REG *) 	0xFFFFE658) /* (HDMA_CH_0) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_0_SPIP ((AT91_REG *) 	0xFFFFE654) /* (HDMA_CH_0) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_0_DSCR ((AT91_REG *) 	0xFFFFE644) /* (HDMA_CH_0) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_0_BDSCR ((AT91_REG *) 	0xFFFFE65C) /* (HDMA_CH_0) HDMA Reserved*/
#define AT91C_HDMA_CH_0_SADDR ((AT91_REG *) 	0xFFFFE63C) /* (HDMA_CH_0) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_0_CTRLA ((AT91_REG *) 	0xFFFFE648) /* (HDMA_CH_0) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_0_CADDR ((AT91_REG *) 	0xFFFFE660) /* (HDMA_CH_0) HDMA Reserved*/
/* ========== Register definition for HDMA_CH_1 peripheral ========== */
#define AT91C_HDMA_CH_1_DADDR ((AT91_REG *) 	0xFFFFE668) /* (HDMA_CH_1) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_1_BDSCR ((AT91_REG *) 	0xFFFFE684) /* (HDMA_CH_1) HDMA Reserved*/
#define AT91C_HDMA_CH_1_CFG ((AT91_REG *) 	0xFFFFE678) /* (HDMA_CH_1) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_1_CTRLB ((AT91_REG *) 	0xFFFFE674) /* (HDMA_CH_1) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_1_SADDR ((AT91_REG *) 	0xFFFFE664) /* (HDMA_CH_1) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_1_CTRLA ((AT91_REG *) 	0xFFFFE670) /* (HDMA_CH_1) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_1_CADDR ((AT91_REG *) 	0xFFFFE688) /* (HDMA_CH_1) HDMA Reserved*/
#define AT91C_HDMA_CH_1_SPIP ((AT91_REG *) 	0xFFFFE67C) /* (HDMA_CH_1) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_1_DSCR ((AT91_REG *) 	0xFFFFE66C) /* (HDMA_CH_1) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_1_DPIP ((AT91_REG *) 	0xFFFFE680) /* (HDMA_CH_1) HDMA Channel Destination Picture in Picture Configuration Register*/
/* ========== Register definition for HDMA peripheral ========== */
#define AT91C_HDMA_CHER ((AT91_REG *) 	0xFFFFE628) /* (HDMA) HDMA Channel Handler Enable Register*/
#define AT91C_HDMA_EN   ((AT91_REG *) 	0xFFFFE604) /* (HDMA) HDMA Controller Enable Register*/
#define AT91C_HDMA_EBCIMR ((AT91_REG *) 	0xFFFFE620) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register*/
#define AT91C_HDMA_BREQ ((AT91_REG *) 	0xFFFFE60C) /* (HDMA) HDMA Software Chunk Transfer Request Register*/
#define AT91C_HDMA_EBCIDR ((AT91_REG *) 	0xFFFFE61C) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register*/
#define AT91C_HDMA_CHDR ((AT91_REG *) 	0xFFFFE62C) /* (HDMA) HDMA Channel Handler Disable Register*/
#define AT91C_HDMA_RSVD0 ((AT91_REG *) 	0xFFFFE634) /* (HDMA) HDMA Reserved*/
#define AT91C_HDMA_SYNC ((AT91_REG *) 	0xFFFFE614) /* (HDMA) HDMA Request Synchronization Register*/
#define AT91C_HDMA_GCFG ((AT91_REG *) 	0xFFFFE600) /* (HDMA) HDMA Global Configuration Register*/
#define AT91C_HDMA_EBCISR ((AT91_REG *) 	0xFFFFE624) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register*/
#define AT91C_HDMA_CHSR ((AT91_REG *) 	0xFFFFE630) /* (HDMA) HDMA Channel Handler Status Register*/
#define AT91C_HDMA_LAST ((AT91_REG *) 	0xFFFFE610) /* (HDMA) HDMA Software Last Transfer Flag Register*/
#define AT91C_HDMA_RSVD1 ((AT91_REG *) 	0xFFFFE638) /* (HDMA) HDMA Reserved*/
#define AT91C_HDMA_SREQ ((AT91_REG *) 	0xFFFFE608) /* (HDMA) HDMA Software Single Request Register*/
#define AT91C_HDMA_EBCIER ((AT91_REG *) 	0xFFFFE618) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register*/
/* ========== Register definition for HECC peripheral ========== */
#define AT91C_HECC_VR   ((AT91_REG *) 	0xFFFFE8FC) /* (HECC)  ECC Version register*/
#define AT91C_HECC_NPR  ((AT91_REG *) 	0xFFFFE810) /* (HECC)  ECC Parity N register*/
#define AT91C_HECC_SR   ((AT91_REG *) 	0xFFFFE808) /* (HECC)  ECC Status register*/
#define AT91C_HECC_PR   ((AT91_REG *) 	0xFFFFE80C) /* (HECC)  ECC Parity register*/
