una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM9RL64*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Controller*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOC   ((unsigned int)  4) /* Parallel IO Controller C*/
#define AT91C_ID_PIOD   ((unsigned int)  5) /* Parallel IO Controller D*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int)  8) /* USART 2*/
#define AT91C_ID_US3    ((unsigned int)  9) /* USART 2*/
#define AT91C_ID_MCI    ((unsigned int) 10) /* Multimedia Card Interface*/
#define AT91C_ID_TWI0   ((unsigned int) 11) /* TWI 0*/
#define AT91C_ID_TWI1   ((unsigned int) 12) /* TWI 1*/
#define AT91C_ID_SPI    ((unsigned int) 13) /* Serial Peripheral Interface*/
#define AT91C_ID_SSC0   ((unsigned int) 14) /* Serial Synchronous Controller 0*/
#define AT91C_ID_SSC1   ((unsigned int) 15) /* Serial Synchronous Controller 1*/
#define AT91C_ID_TC0    ((unsigned int) 16) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 17) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 18) /* Timer Counter 2*/
#define AT91C_ID_PWMC   ((unsigned int) 19) /* Pulse Width Modulation Controller*/
#define AT91C_ID_TSADC  ((unsigned int) 20) /* Touch Screen Controller*/
#define AT91C_ID_HDMA   ((unsigned int) 21) /* HDMA*/
#define AT91C_ID_UDPHS  ((unsigned int) 22) /* USB Device HS*/
#define AT91C_ID_LCDC   ((unsigned int) 23) /* LCD Controller*/
#define AT91C_ID_AC97C  ((unsigned int) 24) /* AC97 Controller*/
#define AT91C_ID_IRQ0   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ALL_INT   ((unsigned int) 0x81FFFFFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM9RL64*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFC000) /* (SYS) Base Address*/
#define AT91C_BASE_EBI       ((AT91PS_EBI) 	0xFFFFE800) /* (EBI) Base Address*/
#define AT91C_BASE_SDRAMC    ((AT91PS_SDRAMC) 	0xFFFFEA00) /* (SDRAMC) Base Address*/
#define AT91C_BASE_SMC       ((AT91PS_SMC) 	0xFFFFEC00) /* (SMC) Base Address*/
#define AT91C_BASE_MATRIX    ((AT91PS_MATRIX) 	0xFFFFEE00) /* (MATRIX) Base Address*/
#define AT91C_BASE_CCFG      ((AT91PS_CCFG) 	0xFFFFEF10) /* (CCFG) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOC) Base Address*/
#define AT91C_BASE_PIOD      ((AT91PS_PIO) 	0xFFFFFA00) /* (PIOD) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC1C) /* (CKGR) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_SHDWC     ((AT91PS_SHDWC) 	0xFFFFFD10) /* (SHDWC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_RTC       ((AT91PS_RTC) 	0xFFFFFE00) /* (RTC) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFFA0000) /* (TCB0) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFFA0040) /* (TCB1) Base Address*/
#define AT91C_BASE_TCB2      ((AT91PS_TCB) 	0xFFFA0080) /* (TCB2) Base Address*/
#define AT91C_BASE_PDC_MCI   ((AT91PS_PDC) 	0xFFFA4100) /* (PDC_MCI) Base Address*/
#define AT91C_BASE_MCI       ((AT91PS_MCI) 	0xFFFA4000) /* (MCI) Base Address*/
#define AT91C_BASE_PDC_TWI0  ((AT91PS_PDC) 	0xFFFA8100) /* (PDC_TWI0) Base Address*/
#define AT91C_BASE_TWI0      ((AT91PS_TWI) 	0xFFFA8000) /* (TWI0) Base Address*/
#define AT91C_BASE_TWI1      ((AT91PS_TWI) 	0xFFFAC000) /* (TWI1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFB0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFB0000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFB4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFB4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFFB8100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFFB8000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_US3   ((AT91PS_PDC) 	0xFFFBC100) /* (PDC_US3) Base Address*/
#define AT91C_BASE_US3       ((AT91PS_USART) 	0xFFFBC000) /* (US3) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFFC0000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_SSC1) Base Address*/
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFFC4000) /* (SSC1) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFC8200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFC8220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFC8240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFC8260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFC8000) /* (PWMC) Base Address*/
#define AT91C_BASE_PDC_SPI   ((AT91PS_PDC) 	0xFFFCC100) /* (PDC_SPI) Base Address*/
#define AT91C_BASE_SPI       ((AT91PS_SPI) 	0xFFFCC000) /* (SPI) Base Address*/
#define AT91C_BASE_PDC_TSADC ((AT91PS_PDC) 	0xFFFD0100) /* (PDC_TSADC) Base Address*/
#define AT91C_BASE_TSADC     ((AT91PS_TSADC) 	0xFFFD0000) /* (TSADC) Base Address*/
#define AT91C_BASE_UDPHS_EPTFIFO ((AT91PS_UDPHS_EPTFIFO) 	0x00600000) /* (UDPHS_EPTFIFO) Base Address*/
#define AT91C_BASE_UDPHS_EPT_0 ((AT91PS_UDPHS_EPT) 	0xFFFD4100) /* (UDPHS_EPT_0) Base Address*/
#define AT91C_BASE_UDPHS_EPT_1 ((AT91PS_UDPHS_EPT) 	0xFFFD4120) /* (UDPHS_EPT_1) Base Address*/
#define AT91C_BASE_UDPHS_EPT_2 ((AT91PS_UDPHS_EPT) 	0xFFFD4140) /* (UDPHS_EPT_2) Base Address*/
#define AT91C_BASE_UDPHS_EPT_3 ((AT91PS_UDPHS_EPT) 	0xFFFD4160) /* (UDPHS_EPT_3) Base Address*/
#define AT91C_BASE_UDPHS_EPT_4 ((AT91PS_UDPHS_EPT) 	0xFFFD4180) /* (UDPHS_EPT_4) Base Address*/
#define AT91C_BASE_UDPHS_EPT_5 ((AT91PS_UDPHS_EPT) 	0xFFFD41A0) /* (UDPHS_EPT_5) Base Address*/
#define AT91C_BASE_UDPHS_EPT_6 ((AT91PS_UDPHS_EPT) 	0xFFFD41C0) /* (UDPHS_EPT_6) Base Address*/
#define AT91C_BASE_UDPHS_EPT_7 ((AT91PS_UDPHS_EPT) 	0xFFFD41E0) /* (UDPHS_EPT_7) Base Address*/
#define AT91C_BASE_UDPHS_EPT_8 ((AT91PS_UDPHS_EPT) 	0xFFFD4200) /* (UDPHS_EPT_8) Base Address*/
#define AT91C_BASE_UDPHS_EPT_9 ((AT91PS_UDPHS_EPT) 	0xFFFD4220) /* (UDPHS_EPT_9) Base Address*/
#define AT91C_BASE_UDPHS_EPT_10 ((AT91PS_UDPHS_EPT) 	0xFFFD4240) /* (UDPHS_EPT_10) Base Address*/
#define AT91C_BASE_UDPHS_EPT_11 ((AT91PS_UDPHS_EPT) 	0xFFFD4260) /* (UDPHS_EPT_11) Base Address*/
#define AT91C_BASE_UDPHS_EPT_12 ((AT91PS_UDPHS_EPT) 	0xFFFD4280) /* (UDPHS_EPT_12) Base Address*/
#define AT91C_BASE_UDPHS_EPT_13 ((AT91PS_UDPHS_EPT) 	0xFFFD42A0) /* (UDPHS_EPT_13) Base Address*/
#define AT91C_BASE_UDPHS_EPT_14 ((AT91PS_UDPHS_EPT) 	0xFFFD42C0) /* (UDPHS_EPT_14) Base Address*/
#define AT91C_BASE_UDPHS_EPT_15 ((AT91PS_UDPHS_EPT) 	0xFFFD42E0) /* (UDPHS_EPT_15) Base Address*/
#define AT91C_BASE_UDPHS_DMA_1 ((AT91PS_UDPHS_DMA) 	0xFFFD4310) /* (UDPHS_DMA_1) Base Address*/
#define AT91C_BASE_UDPHS_DMA_2 ((AT91PS_UDPHS_DMA) 	0xFFFD4320) /* (UDPHS_DMA_2) Base Address*/
#define AT91C_BASE_UDPHS_DMA_3 ((AT91PS_UDPHS_DMA) 	0xFFFD4330) /* (UDPHS_DMA_3) Base Address*/
#define AT91C_BASE_UDPHS_DMA_4 ((AT91PS_UDPHS_DMA) 	0xFFFD4340) /* (UDPHS_DMA_4) Base Address*/
#define AT91C_BASE_UDPHS_DMA_5 ((AT91PS_UDPHS_DMA) 	0xFFFD4350) /* (UDPHS_DMA_5) Base Address*/
#define AT91C_BASE_UDPHS_DMA_6 ((AT91PS_UDPHS_DMA) 	0xFFFD4360) /* (UDPHS_DMA_6) Base Address*/
#define AT91C_BASE_UDPHS_DMA_7 ((AT91PS_UDPHS_DMA) 	0xFFFD4370) /* (UDPHS_DMA_7) Base Address*/
#define AT91C_BASE_UDPHS     ((AT91PS_UDPHS) 	0xFFFD4000) /* (UDPHS) Base Address*/
#define AT91C_BASE_PDC_AC97C ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_AC97C) Base Address*/
#define AT91C_BASE_AC97C     ((AT91PS_AC97C) 	0xFFFD8000) /* (AC97C) Base Address*/
#define AT91C_BASE_LCDC      ((AT91PS_LCDC) 	0x00500000) /* (LCDC) Base Address*/
#define AT91C_BASE_LCDC_16B_TFT ((AT91PS_LCDC) 	0x00500000) /* (LCDC_16B_TFT) Base Address*/
#define AT91C_BASE_HDMA_CH_0 ((AT91PS_HDMA_CH) 	0xFFFFE63C) /* (HDMA_CH_0) Base Address*/
#define AT91C_BASE_HDMA_CH_1 ((AT91PS_HDMA_CH) 	0xFFFFE664) /* (HDMA_CH_1) Base Address*/
#define AT91C_BASE_HDMA      ((AT91PS_HDMA) 	0xFFFFE600) /* (HDMA) Base Address*/
#define AT91C_BASE_HECC      ((AT91PS_ECC) 	0xFFFFE800) /* (HECC) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM9RL64*/
/* ******************************************************************************/
/* ITCM*/
#define AT91C_ITCM 	 ((char *) 	0x00100000) /* Maximum ITCM Area base address*/
#define AT91C_ITCM_SIZE	 ((unsigned int) 0x00010000) /* Maximum ITCM Area size in byte (64 Kbytes)*/
/* DTCM*/
#define AT91C_DTCM 	 ((char *) 	0x00200000) /* Maximum DTCM Area base address*/
#define AT91C_DTCM_SIZE	 ((unsigned int) 0x00010000) /* Maximum DTCM Area size in byte (64 Kbytes)*/
/* IRAM*/
#define AT91C_IRAM 	 ((char *) 	0x00300000) /* Maximum Internal SRAM base address*/
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x00010000) /* Maximum Internal SRAM size in byte (64 Kbytes)*/
/* IRAM_MIN*/
#define AT91C_IRAM_MIN	 ((char *) 	0x00300000) /* Minimum Internal RAM base address*/
#define AT91C_IRAM_MIN_SIZE	 ((unsigned int) 0x00004000) /* Minimum Internal RAM size in byte (16 Kbytes)*/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00400000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00008000) /* Internal ROM size in byte (32 Kbytes)*/
/* EBI_CS0*/
#define AT91C_EBI_CS0	 ((char *) 	0x10000000) /* EBI Chip Select 0 base address*/
#define AT91C_EBI_CS0_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 0 size in byte (262144 Kbytes)*/
/* EBI_CS1*/
#define AT91C_EBI_CS1	 ((char *) 	0x20000000) /* EBI Chip Select 1 base address*/
#define AT91C_EBI_CS1_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_SDRAM*/
#define AT91C_EBI_SDRAM	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_SIZE	 ((unsigned int) 0x10000000) /* SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_SDRAM_16BIT*/
#define AT91C_EBI_SDRAM_16BIT	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)*/
/* EBI_SDRAM_32BIT*/
#define AT91C_EBI_SDRAM_32BIT	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)*/
/* EBI_CS2*/
#define AT91C_EBI_CS2	 ((char *) 	0x30000000) /* EBI Chip Select 2 base address*/
#define AT91C_EBI_CS2_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 2 size in byte (262144 Kbytes)*/
/* EBI_CS3*/
#define AT91C_EBI_CS3	 ((char *) 	0x40000000) /* EBI Chip Select 3 base address*/
#define AT91C_EBI_CS3_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_SM*/
#define AT91C_EBI_SM	 ((char *) 	0x40000000) /* NANDFLASH on EBI Chip Select 3 base address*/
#define AT91C_EBI_SM_SIZE	 ((unsigned int) 0x10000000) /* NANDFLASH on EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_CS4*/
#define AT91C_EBI_CS4	 ((char *) 	0x50000000) /* EBI Chip Select 4 base address*/
#define AT91C_EBI_CS4_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CF0*/
#define AT91C_EBI_CF0	 ((char *) 	0x50000000) /* CompactFlash 0 on EBI Chip Select 4 base address*/
#define AT91C_EBI_CF0_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CS5*/
#define AT91C_EBI_CS5	 ((char *) 	0x60000000) /* EBI Chip Select 5 base address*/
#define AT91C_EBI_CS5_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI_CF1*/
#define AT91C_EBI_CF1	 ((char *) 	0x60000000) /* CompactFlash 1 on EBIChip Select 5 base address*/
#define AT91C_EBI_CF1_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 1 on EBIChip Select 5 size in byte (262144 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

