una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR HDMA Channel structure*/
/* - ******************************************************************************/
/* - -------- HDMA_SADDR : (HDMA_CH Offset: 0x0)  -------- */
AT91C_SADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
/* - -------- HDMA_DADDR : (HDMA_CH Offset: 0x4)  -------- */
AT91C_DADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
/* - -------- HDMA_DSCR : (HDMA_CH Offset: 0x8)  -------- */
AT91C_DSCR_IF             EQU (0x3 <<  0) ;- (HDMA_CH) 
AT91C_DSCR                EQU (0x3FFFFFFF <<  2) ;- (HDMA_CH) 
/* - -------- HDMA_CTRLA : (HDMA_CH Offset: 0xc)  -------- */
AT91C_BTSIZE              EQU (0xFFF <<  0) ;- (HDMA_CH) 
AT91C_FC                  EQU (0x7 << 12) ;- (HDMA_CH) 
AT91C_AUTO                EQU (0x1 << 15) ;- (HDMA_CH) 
AT91C_SCSIZE              EQU (0x7 << 16) ;- (HDMA_CH) 
AT91C_DCSIZE              EQU (0x7 << 20) ;- (HDMA_CH) 
AT91C_SRC_WIDTH           EQU (0x3 << 24) ;- (HDMA_CH) 
AT91C_DST_WIDTH           EQU (0x3 << 28) ;- (HDMA_CH) 
/* - -------- HDMA_CTRLB : (HDMA_CH Offset: 0x10)  -------- */
AT91C_SIF                 EQU (0x3 <<  0) ;- (HDMA_CH) 
AT91C_DIF                 EQU (0x3 <<  4) ;- (HDMA_CH) 
AT91C_SRC_PIP             EQU (0x1 <<  8) ;- (HDMA_CH) 
AT91C_DST_PIP             EQU (0x1 << 12) ;- (HDMA_CH) 
AT91C_SRC_DSCR            EQU (0x1 << 16) ;- (HDMA_CH) 
AT91C_DST_DSCR            EQU (0x1 << 20) ;- (HDMA_CH) 
AT91C_SRC_INCR            EQU (0x3 << 24) ;- (HDMA_CH) 
AT91C_DST_INCR            EQU (0x3 << 28) ;- (HDMA_CH) 
/* - -------- HDMA_CFG : (HDMA_CH Offset: 0x14)  -------- */
AT91C_SRC_PER             EQU (0xF <<  0) ;- (HDMA_CH) 
AT91C_DST_PER             EQU (0xF <<  4) ;- (HDMA_CH) 
AT91C_SRC_REP             EQU (0x1 <<  8) ;- (HDMA_CH) 
AT91C_SRC_H2SEL           EQU (0x1 <<  9) ;- (HDMA_CH) 
AT91C_DST_REP             EQU (0x1 << 12) ;- (HDMA_CH) 
AT91C_DST_H2SEL           EQU (0x1 << 13) ;- (HDMA_CH) 
AT91C_LOCK_IF             EQU (0x1 << 20) ;- (HDMA_CH) 
AT91C_LOCK_B              EQU (0x1 << 21) ;- (HDMA_CH) 
AT91C_LOCK_IF_L           EQU (0x1 << 22) ;- (HDMA_CH) 
AT91C_AHB_PROT            EQU (0x7 << 24) ;- (HDMA_CH) 
/* - -------- HDMA_SPIP : (HDMA_CH Offset: 0x18)  -------- */
AT91C_SPIP_HOLE           EQU (0xFFFF <<  0) ;- (HDMA_CH) 
AT91C_SPIP_BOUNDARY       EQU (0x3FF << 16) ;- (HDMA_CH) 
/* - -------- HDMA_DPIP : (HDMA_CH Offset: 0x1c)  -------- */
AT91C_DPIP_HOLE           EQU (0xFFFF <<  0) ;- (HDMA_CH) 
AT91C_DPIP_BOUNDARY       EQU (0x3FF << 16) ;- (HDMA_CH) 
/* - -------- HDMA_BDSCR : (HDMA_CH Offset: 0x20)  -------- */
/* - -------- HDMA_CADDR : (HDMA_CH Offset: 0x24)  -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR HDMA controller*/
/* - ******************************************************************************/
/* - -------- HDMA_GCFG : (HDMA Offset: 0x0)  -------- */
AT91C_IF0_BIGEND          EQU (0x1 <<  0) ;- (HDMA) 
AT91C_IF1_BIGEND          EQU (0x1 <<  1) ;- (HDMA) 
AT91C_IF2_BIGEND          EQU (0x1 <<  2) ;- (HDMA) 
AT91C_IF3_BIGEND          EQU (0x1 <<  3) ;- (HDMA) 
AT91C_ARB_CFG             EQU (0x1 <<  4) ;- (HDMA) 
/* - -------- HDMA_EN : (HDMA Offset: 0x4)  -------- */
AT91C_HDMA_ENABLE         EQU (0x1 <<  0) ;- (HDMA) 
/* - -------- HDMA_SREQ : (HDMA Offset: 0x8)  -------- */
AT91C_SOFT_SREQ           EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_BREQ : (HDMA Offset: 0xc)  -------- */
AT91C_SOFT_BREQ           EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_LAST : (HDMA Offset: 0x10)  -------- */
AT91C_SOFT_LAST           EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_SYNC : (HDMA Offset: 0x14)  -------- */
AT91C_SYNC_REQ            EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_EBCIER : (HDMA Offset: 0x18)  -------- */
AT91C_BTC                 EQU (0xFF <<  0) ;- (HDMA) 
AT91C_CBTC                EQU (0xFF <<  8) ;- (HDMA) 
AT91C_ERR                 EQU (0xFF << 16) ;- (HDMA) 
/* - -------- HDMA_EBCIDR : (HDMA Offset: 0x1c)  -------- */
/* - -------- HDMA_EBCIMR : (HDMA Offset: 0x20)  -------- */
/* - -------- HDMA_EBCISR : (HDMA Offset: 0x24)  -------- */
/* - -------- HDMA_CHER : (HDMA Offset: 0x28)  -------- */
AT91C_ENABLE              EQU (0xFF <<  0) ;- (HDMA) 
AT91C_SUSPEND             EQU (0xFF <<  8) ;- (HDMA) 
AT91C_KEEPON              EQU (0xFF << 24) ;- (HDMA) 
/* - -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- */
AT91C_RESUME              EQU (0xFF <<  8) ;- (HDMA) 
/* - -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- */
AT91C_STALLED             EQU (0xFF << 14) ;- (HDMA) 
AT91C_EMPTY               EQU (0xFF << 16) ;- (HDMA) 
/* - -------- HDMA_RSVD : (HDMA Offset: 0x34)  -------- */
/* - -------- HDMA_RSVD : (HDMA Offset: 0x38)  -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* - ******************************************************************************/
/* - -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
AT91C_ECC_RST             EQU (0x1 <<  0) ;- (ECC) ECC reset parity
/* - -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
AT91C_ECC_PAGE_SIZE       EQU (0x3 <<  0) ;- (ECC) Nand Flash page size
/* - -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
AT91C_ECC_RECERR          EQU (0x1 <<  0) ;- (ECC) ECC error
AT91C_ECC_ECCERR          EQU (0x1 <<  1) ;- (ECC) ECC single error
AT91C_ECC_MULERR          EQU (0x1 <<  2) ;- (ECC) ECC_MULERR
/* - -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
AT91C_ECC_BITADDR         EQU (0xF <<  0) ;- (ECC) Bit address error
AT91C_ECC_WORDADDR        EQU (0xFFF <<  4) ;- (ECC) address of the failing bit
/* - -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
AT91C_ECC_NPARITY         EQU (0xFFFF <<  0) ;- (ECC) ECC parity N 
/* - -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
AT91C_ECC_VR              EQU (0xF <<  0) ;- (ECC) ECC version register

