una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
AT91C_WDTC_WDMR           EQU (0xFFFFFD44) ;- (WDTC) Watchdog Mode Register
/* - ========== Register definition for RTC peripheral ========== */
AT91C_RTC_VER             EQU (0xFFFFFE2C) ;- (RTC) Valid Entry Register
AT91C_RTC_MR              EQU (0xFFFFFE04) ;- (RTC) Mode Register
AT91C_RTC_IDR             EQU (0xFFFFFE24) ;- (RTC) Interrupt Disable Register
AT91C_RTC_CALALR          EQU (0xFFFFFE14) ;- (RTC) Calendar Alarm Register
AT91C_RTC_IER             EQU (0xFFFFFE20) ;- (RTC) Interrupt Enable Register
AT91C_RTC_TIMALR          EQU (0xFFFFFE10) ;- (RTC) Time Alarm Register
AT91C_RTC_IMR             EQU (0xFFFFFE28) ;- (RTC) Interrupt Mask Register
AT91C_RTC_CR              EQU (0xFFFFFE00) ;- (RTC) Control Register
AT91C_RTC_SCCR            EQU (0xFFFFFE1C) ;- (RTC) Status Clear Command Register
AT91C_RTC_TIMR            EQU (0xFFFFFE08) ;- (RTC) Time Register
AT91C_RTC_SR              EQU (0xFFFFFE18) ;- (RTC) Status Register
AT91C_RTC_CALR            EQU (0xFFFFFE0C) ;- (RTC) Calendar Register
/* - ========== Register definition for TC0 peripheral ========== */
AT91C_TC0_SR              EQU (0xFFFA0020) ;- (TC0) Status Register
AT91C_TC0_RC              EQU (0xFFFA001C) ;- (TC0) Register C
AT91C_TC0_RB              EQU (0xFFFA0018) ;- (TC0) Register B
AT91C_TC0_CCR             EQU (0xFFFA0000) ;- (TC0) Channel Control Register
AT91C_TC0_CMR             EQU (0xFFFA0004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_IER             EQU (0xFFFA0024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_RA              EQU (0xFFFA0014) ;- (TC0) Register A
AT91C_TC0_IDR             EQU (0xFFFA0028) ;- (TC0) Interrupt Disable Register
AT91C_TC0_CV              EQU (0xFFFA0010) ;- (TC0) Counter Value
AT91C_TC0_IMR             EQU (0xFFFA002C) ;- (TC0) Interrupt Mask Register
/* - ========== Register definition for TC1 peripheral ========== */
AT91C_TC1_RB              EQU (0xFFFA0058) ;- (TC1) Register B
AT91C_TC1_CCR             EQU (0xFFFA0040) ;- (TC1) Channel Control Register
AT91C_TC1_IER             EQU (0xFFFA0064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_IDR             EQU (0xFFFA0068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_SR              EQU (0xFFFA0060) ;- (TC1) Status Register
AT91C_TC1_CMR             EQU (0xFFFA0044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_RA              EQU (0xFFFA0054) ;- (TC1) Register A
AT91C_TC1_RC              EQU (0xFFFA005C) ;- (TC1) Register C
AT91C_TC1_IMR             EQU (0xFFFA006C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_CV              EQU (0xFFFA0050) ;- (TC1) Counter Value
/* - ========== Register definition for TC2 peripheral ========== */
AT91C_TC2_CMR             EQU (0xFFFA0084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_CCR             EQU (0xFFFA0080) ;- (TC2) Channel Control Register
AT91C_TC2_CV              EQU (0xFFFA0090) ;- (TC2) Counter Value
AT91C_TC2_RA              EQU (0xFFFA0094) ;- (TC2) Register A
AT91C_TC2_RB              EQU (0xFFFA0098) ;- (TC2) Register B
AT91C_TC2_IDR             EQU (0xFFFA00A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_IMR             EQU (0xFFFA00AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_RC              EQU (0xFFFA009C) ;- (TC2) Register C
AT91C_TC2_IER             EQU (0xFFFA00A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_SR              EQU (0xFFFA00A0) ;- (TC2) Status Register
/* - ========== Register definition for TCB0 peripheral ========== */
AT91C_TCB0_BMR            EQU (0xFFFA00C4) ;- (TCB0) TC Block Mode Register
AT91C_TCB0_BCR            EQU (0xFFFA00C0) ;- (TCB0) TC Block Control Register
/* - ========== Register definition for TCB1 peripheral ========== */
AT91C_TCB1_BMR            EQU (0xFFFA0104) ;- (TCB1) TC Block Mode Register
AT91C_TCB1_BCR            EQU (0xFFFA0100) ;- (TCB1) TC Block Control Register
/* - ========== Register definition for TCB2 peripheral ========== */
AT91C_TCB2_BCR            EQU (0xFFFA0140) ;- (TCB2) TC Block Control Register
AT91C_TCB2_BMR            EQU (0xFFFA0144) ;- (TCB2) TC Block Mode Register
/* - ========== Register definition for PDC_MCI peripheral ========== */
AT91C_MCI_TPR             EQU (0xFFFA4108) ;- (PDC_MCI) Transmit Pointer Register
AT91C_MCI_PTCR            EQU (0xFFFA4120) ;- (PDC_MCI) PDC Transfer Control Register
AT91C_MCI_RNPR            EQU (0xFFFA4110) ;- (PDC_MCI) Receive Next Pointer Register
AT91C_MCI_TNCR            EQU (0xFFFA411C) ;- (PDC_MCI) Transmit Next Counter Register
AT91C_MCI_TCR             EQU (0xFFFA410C) ;- (PDC_MCI) Transmit Counter Register
AT91C_MCI_RCR             EQU (0xFFFA4104) ;- (PDC_MCI) Receive Counter Register
AT91C_MCI_RNCR            EQU (0xFFFA4114) ;- (PDC_MCI) Receive Next Counter Register
AT91C_MCI_TNPR            EQU (0xFFFA4118) ;- (PDC_MCI) Transmit Next Pointer Register
AT91C_MCI_RPR             EQU (0xFFFA4100) ;- (PDC_MCI) Receive Pointer Register
AT91C_MCI_PTSR            EQU (0xFFFA4124) ;- (PDC_MCI) PDC Transfer Status Register
/* - ========== Register definition for MCI peripheral ========== */
AT91C_MCI_IDR             EQU (0xFFFA4048) ;- (MCI) MCI Interrupt Disable Register
AT91C_MCI_MR              EQU (0xFFFA4004) ;- (MCI) MCI Mode Register
AT91C_MCI_VR              EQU (0xFFFA40FC) ;- (MCI) MCI Version Register
AT91C_MCI_IER             EQU (0xFFFA4044) ;- (MCI) MCI Interrupt Enable Register
AT91C_MCI_IMR             EQU (0xFFFA404C) ;- (MCI) MCI Interrupt Mask Register
AT91C_MCI_SR              EQU (0xFFFA4040) ;- (MCI) MCI Status Register
AT91C_MCI_DTOR            EQU (0xFFFA4008) ;- (MCI) MCI Data Timeout Register
AT91C_MCI_CR              EQU (0xFFFA4000) ;- (MCI) MCI Control Register
AT91C_MCI_CMDR            EQU (0xFFFA4014) ;- (MCI) MCI Command Register
AT91C_MCI_SDCR            EQU (0xFFFA400C) ;- (MCI) MCI SD Card Register
AT91C_MCI_BLKR            EQU (0xFFFA4018) ;- (MCI) MCI Block Register
AT91C_MCI_RDR             EQU (0xFFFA4030) ;- (MCI) MCI Receive Data Register
AT91C_MCI_ARGR            EQU (0xFFFA4010) ;- (MCI) MCI Argument Register
AT91C_MCI_TDR             EQU (0xFFFA4034) ;- (MCI) MCI Transmit Data Register
AT91C_MCI_RSPR            EQU (0xFFFA4020) ;- (MCI) MCI Response Register
/* - ========== Register definition for PDC_TWI0 peripheral ========== */
AT91C_TWI0_RNCR           EQU (0xFFFA8114) ;- (PDC_TWI0) Receive Next Counter Register
AT91C_TWI0_TCR            EQU (0xFFFA810C) ;- (PDC_TWI0) Transmit Counter Register
AT91C_TWI0_RCR            EQU (0xFFFA8104) ;- (PDC_TWI0) Receive Counter Register
AT91C_TWI0_TNPR           EQU (0xFFFA8118) ;- (PDC_TWI0) Transmit Next Pointer Register
AT91C_TWI0_RNPR           EQU (0xFFFA8110) ;- (PDC_TWI0) Receive Next Pointer Register
AT91C_TWI0_RPR            EQU (0xFFFA8100) ;- (PDC_TWI0) Receive Pointer Register
AT91C_TWI0_TNCR           EQU (0xFFFA811C) ;- (PDC_TWI0) Transmit Next Counter Register
AT91C_TWI0_TPR            EQU (0xFFFA8108) ;- (PDC_TWI0) Transmit Pointer Register
AT91C_TWI0_PTSR           EQU (0xFFFA8124) ;- (PDC_TWI0) PDC Transfer Status Register
AT91C_TWI0_PTCR           EQU (0xFFFA8120) ;- (PDC_TWI0) PDC Transfer Control Register
/* - ========== Register definition for TWI0 peripheral ========== */
AT91C_TWI0_IDR            EQU (0xFFFA8028) ;- (TWI0) Interrupt Disable Register
AT91C_TWI0_RHR            EQU (0xFFFA8030) ;- (TWI0) Receive Holding Register
AT91C_TWI0_SMR            EQU (0xFFFA8008) ;- (TWI0) Slave Mode Register
AT91C_TWI0_IER            EQU (0xFFFA8024) ;- (TWI0) Interrupt Enable Register
AT91C_TWI0_THR            EQU (0xFFFA8034) ;- (TWI0) Transmit Holding Register
AT91C_TWI0_MMR            EQU (0xFFFA8004) ;- (TWI0) Master Mode Register
AT91C_TWI0_CR             EQU (0xFFFA8000) ;- (TWI0) Control Register
AT91C_TWI0_CWGR           EQU (0xFFFA8010) ;- (TWI0) Clock Waveform Generator Register
AT91C_TWI0_IADR           EQU (0xFFFA800C) ;- (TWI0) Internal Address Register
AT91C_TWI0_IMR            EQU (0xFFFA802C) ;- (TWI0) Interrupt Mask Register
AT91C_TWI0_SR             EQU (0xFFFA8020) ;- (TWI0) Status Register
/* - ========== Register definition for TWI1 peripheral ========== */
AT91C_TWI1_THR            EQU (0xFFFAC034) ;- (TWI1) Transmit Holding Register
AT91C_TWI1_IDR            EQU (0xFFFAC028) ;- (TWI1) Interrupt Disable Register
AT91C_TWI1_SMR            EQU (0xFFFAC008) ;- (TWI1) Slave Mode Register
AT91C_TWI1_CWGR           EQU (0xFFFAC010) ;- (TWI1) Clock Waveform Generator Register
AT91C_TWI1_IADR           EQU (0xFFFAC00C) ;- (TWI1) Internal Address Register
AT91C_TWI1_RHR            EQU (0xFFFAC030) ;- (TWI1) Receive Holding Register
AT91C_TWI1_IER            EQU (0xFFFAC024) ;- (TWI1) Interrupt Enable Register
AT91C_TWI1_MMR            EQU (0xFFFAC004) ;- (TWI1) Master Mode Register
AT91C_TWI1_SR             EQU (0xFFFAC020) ;- (TWI1) Status Register
AT91C_TWI1_IMR            EQU (0xFFFAC02C) ;- (TWI1) Interrupt Mask Register
AT91C_TWI1_CR             EQU (0xFFFAC000) ;- (TWI1) Control Register
/* - ========== Register definition for PDC_US0 peripheral ========== */
AT91C_US0_TCR             EQU (0xFFFB010C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_PTCR            EQU (0xFFFB0120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_RNCR            EQU (0xFFFB0114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_PTSR            EQU (0xFFFB0124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_TNCR            EQU (0xFFFB011C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_RNPR            EQU (0xFFFB0110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_RCR             EQU (0xFFFB0104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_TPR             EQU (0xFFFB0108) ;- (PDC_US0) Transmit Pointer Register
AT91C_US0_TNPR            EQU (0xFFFB0118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_RPR             EQU (0xFFFB0100) ;- (PDC_US0) Receive Pointer Register
/* - ========== Register definition for US0 peripheral ========== */
AT91C_US0_RHR             EQU (0xFFFB0018) ;- (US0) Receiver Holding Register
AT91C_US0_NER             EQU (0xFFFB0044) ;- (US0) Nb Errors Register
AT91C_US0_IER             EQU (0xFFFB0008) ;- (US0) Interrupt Enable Register
AT91C_US0_CR              EQU (0xFFFB0000) ;- (US0) Control Register
AT91C_US0_MAN             EQU (0xFFFB0050) ;- (US0) Manchester Encoder Decoder Register
AT91C_US0_THR             EQU (0xFFFB001C) ;- (US0) Transmitter Holding Register
AT91C_US0_CSR             EQU (0xFFFB0014) ;- (US0) Channel Status Register
AT91C_US0_BRGR            EQU (0xFFFB0020) ;- (US0) Baud Rate Generator Register
AT91C_US0_RTOR            EQU (0xFFFB0024) ;- (US0) Receiver Time-out Register
AT91C_US0_TTGR            EQU (0xFFFB0028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_IDR             EQU (0xFFFB000C) ;- (US0) Interrupt Disable Register
AT91C_US0_MR              EQU (0xFFFB0004) ;- (US0) Mode Register
AT91C_US0_IF              EQU (0xFFFB004C) ;- (US0) IRDA_FILTER Register
AT91C_US0_FIDI            EQU (0xFFFB0040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_IMR             EQU (0xFFFB0010) ;- (US0) Interrupt Mask Register
/* - ========== Register definition for PDC_US1 peripheral ========== */
AT91C_US1_PTCR            EQU (0xFFFB4120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_RCR             EQU (0xFFFB4104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0xFFFB4100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_PTSR            EQU (0xFFFB4124) ;- (PDC_US1) PDC Transfer Status Register
AT91C_US1_TPR             EQU (0xFFFB4108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_TCR             EQU (0xFFFB410C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_RNPR            EQU (0xFFFB4110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TNCR            EQU (0xFFFB411C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RNCR            EQU (0xFFFB4114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_TNPR            EQU (0xFFFB4118) ;- (PDC_US1) Transmit Next Pointer Register
/* - ========== Register definition for US1 peripheral ========== */
AT91C_US1_THR             EQU (0xFFFB401C) ;- (US1) Transmitter Holding Register
AT91C_US1_TTGR            EQU (0xFFFB4028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_BRGR            EQU (0xFFFB4020) ;- (US1) Baud Rate Generator Register
AT91C_US1_IDR             EQU (0xFFFB400C) ;- (US1) Interrupt Disable Register
AT91C_US1_MR              EQU (0xFFFB4004) ;- (US1) Mode Register
AT91C_US1_RTOR            EQU (0xFFFB4024) ;- (US1) Receiver Time-out Register
AT91C_US1_MAN             EQU (0xFFFB4050) ;- (US1) Manchester Encoder Decoder Register
AT91C_US1_CR              EQU (0xFFFB4000) ;- (US1) Control Register
AT91C_US1_IMR             EQU (0xFFFB4010) ;- (US1) Interrupt Mask Register
AT91C_US1_FIDI            EQU (0xFFFB4040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_RHR             EQU (0xFFFB4018) ;- (US1) Receiver Holding Register
AT91C_US1_IER             EQU (0xFFFB4008) ;- (US1) Interrupt Enable Register
AT91C_US1_CSR             EQU (0xFFFB4014) ;- (US1) Channel Status Register
AT91C_US1_IF              EQU (0xFFFB404C) ;- (US1) IRDA_FILTER Register
AT91C_US1_NER             EQU (0xFFFB4044) ;- (US1) Nb Errors Register
/* - ========== Register definition for PDC_US2 peripheral ========== */
AT91C_US2_TNCR            EQU (0xFFFB811C) ;- (PDC_US2) Transmit Next Counter Register
AT91C_US2_RNCR            EQU (0xFFFB8114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_TNPR            EQU (0xFFFB8118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_PTCR            EQU (0xFFFB8120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_TCR             EQU (0xFFFB810C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_RPR             EQU (0xFFFB8100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_TPR             EQU (0xFFFB8108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_RCR             EQU (0xFFFB8104) ;- (PDC_US2) Receive Counter Register
AT91C_US2_PTSR            EQU (0xFFFB8124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_RNPR            EQU (0xFFFB8110) ;- (PDC_US2) Receive Next Pointer Register
/* - ========== Register definition for US2 peripheral ========== */
AT91C_US2_RTOR            EQU (0xFFFB8024) ;- (US2) Receiver Time-out Register
AT91C_US2_CSR             EQU (0xFFFB8014) ;- (US2) Channel Status Register
AT91C_US2_CR              EQU (0xFFFB8000) ;- (US2) Control Register
AT91C_US2_BRGR            EQU (0xFFFB8020) ;- (US2) Baud Rate Generator Register
AT91C_US2_NER             EQU (0xFFFB8044) ;- (US2) Nb Errors Register
AT91C_US2_MAN             EQU (0xFFFB8050) ;- (US2) Manchester Encoder Decoder Register
AT91C_US2_FIDI            EQU (0xFFFB8040) ;- (US2) FI_DI_Ratio Register
AT91C_US2_TTGR            EQU (0xFFFB8028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_RHR             EQU (0xFFFB8018) ;- (US2) Receiver Holding Register
AT91C_US2_IDR             EQU (0xFFFB800C) ;- (US2) Interrupt Disable Register
AT91C_US2_THR             EQU (0xFFFB801C) ;- (US2) Transmitter Holding Register
AT91C_US2_MR              EQU (0xFFFB8004) ;- (US2) Mode Register
AT91C_US2_IMR             EQU (0xFFFB8010) ;- (US2) Interrupt Mask Register
AT91C_US2_IF              EQU (0xFFFB804C) ;- (US2) IRDA_FILTER Register
AT91C_US2_IER             EQU (0xFFFB8008) ;- (US2) Interrupt Enable Register
/* - ========== Register definition for PDC_US3 peripheral ========== */
AT91C_US3_TNPR            EQU (0xFFFBC118) ;- (PDC_US3) Transmit Next Pointer Register
AT91C_US3_TCR             EQU (0xFFFBC10C) ;- (PDC_US3) Transmit Counter Register
AT91C_US3_RNCR            EQU (0xFFFBC114) ;- (PDC_US3) Receive Next Counter Register
AT91C_US3_RPR             EQU (0xFFFBC100) ;- (PDC_US3) Receive Pointer Register
AT91C_US3_TPR             EQU (0xFFFBC108) ;- (PDC_US3) Transmit Pointer Register
AT91C_US3_RCR             EQU (0xFFFBC104) ;- (PDC_US3) Receive Counter Register
AT91C_US3_RNPR            EQU (0xFFFBC110) ;- (PDC_US3) Receive Next Pointer Register
AT91C_US3_PTCR            EQU (0xFFFBC120) ;- (PDC_US3) PDC Transfer Control Register
AT91C_US3_TNCR            EQU (0xFFFBC11C) ;- (PDC_US3) Transmit Next Counter Register
AT91C_US3_PTSR            EQU (0xFFFBC124) ;- (PDC_US3) PDC Transfer Status Register
/* - ========== Register definition for US3 peripheral ========== */
AT91C_US3_IF              EQU (0xFFFBC04C) ;- (US3) IRDA_FILTER Register
AT91C_US3_CSR             EQU (0xFFFBC014) ;- (US3) Channel Status Register
AT91C_US3_TTGR            EQU (0xFFFBC028) ;- (US3) Transmitter Time-guard Register
AT91C_US3_MAN             EQU (0xFFFBC050) ;- (US3) Manchester Encoder Decoder Register
AT91C_US3_CR              EQU (0xFFFBC000) ;- (US3) Control Register
AT91C_US3_THR             EQU (0xFFFBC01C) ;- (US3) Transmitter Holding Register
AT91C_US3_MR              EQU (0xFFFBC004) ;- (US3) Mode Register
AT91C_US3_NER             EQU (0xFFFBC044) ;- (US3) Nb Errors Register
AT91C_US3_IDR             EQU (0xFFFBC00C) ;- (US3) Interrupt Disable Register
AT91C_US3_BRGR            EQU (0xFFFBC020) ;- (US3) Baud Rate Generator Register
AT91C_US3_IMR             EQU (0xFFFBC010) ;- (US3) Interrupt Mask Register
AT91C_US3_FIDI            EQU (0xFFFBC040) ;- (US3) FI_DI_Ratio Register
AT91C_US3_RTOR            EQU (0xFFFBC024) ;- (US3) Receiver Time-out Register
AT91C_US3_IER             EQU (0xFFFBC008) ;- (US3) Interrupt Enable Register
AT91C_US3_RHR             EQU (0xFFFBC018) ;- (US3) Receiver Holding Register
/* - ========== Register definition for PDC_SSC0 peripheral ========== */
AT91C_SSC0_TNPR           EQU (0xFFFC0118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_RNPR           EQU (0xFFFC0110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_TCR            EQU (0xFFFC010C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_PTCR           EQU (0xFFFC0120) ;- (PDC_SSC0) PDC Transfer Control Register
AT91C_SSC0_PTSR           EQU (0xFFFC0124) ;- (PDC_SSC0) PDC Transfer Status Register
AT91C_SSC0_TNCR           EQU (0xFFFC011C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_TPR            EQU (0xFFFC0108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_RCR            EQU (0xFFFC0104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_RPR            EQU (0xFFFC0100) ;- (PDC_SSC0) Receive Pointer Register
AT91C_SSC0_RNCR           EQU (0xFFFC0114) ;- (PDC_SSC0) Receive Next Counter Register
/* - ========== Register definition for SSC0 peripheral ========== */
AT91C_SSC0_IDR            EQU (0xFFFC0048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_RHR            EQU (0xFFFC0020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_IER            EQU (0xFFFC0044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_CR             EQU (0xFFFC0000) ;- (SSC0) Control Register
AT91C_SSC0_RCMR           EQU (0xFFFC0010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_SR             EQU (0xFFFC0040) ;- (SSC0) Status Register
AT91C_SSC0_TSHR           EQU (0xFFFC0034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_CMR            EQU (0xFFFC0004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_RSHR           EQU (0xFFFC0030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_THR            EQU (0xFFFC0024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_RFMR           EQU (0xFFFC0014) ;- (SSC0) Receive Frame Mode Register
AT91C_SSC0_TCMR           EQU (0xFFFC0018) ;- (SSC0) Transmit Clock Mode Register
AT91C_SSC0_TFMR           EQU (0xFFFC001C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_IMR            EQU (0xFFFC004C) ;- (SSC0) Interrupt Mask Register
/* - ========== Register definition for PDC_SSC1 peripheral ========== */
AT91C_SSC1_RNCR           EQU (0xFFFC4114) ;- (PDC_SSC1) Receive Next Counter Register
AT91C_SSC1_PTCR           EQU (0xFFFC4120) ;- (PDC_SSC1) PDC Transfer Control Register
AT91C_SSC1_TCR            EQU (0xFFFC410C) ;- (PDC_SSC1) Transmit Counter Register
AT91C_SSC1_PTSR           EQU (0xFFFC4124) ;- (PDC_SSC1) PDC Transfer Status Register
AT91C_SSC1_TNPR           EQU (0xFFFC4118) ;- (PDC_SSC1) Transmit Next Pointer Register
AT91C_SSC1_RCR            EQU (0xFFFC4104) ;- (PDC_SSC1) Receive Counter Register
AT91C_SSC1_RNPR           EQU (0xFFFC4110) ;- (PDC_SSC1) Receive Next Pointer Register
AT91C_SSC1_RPR            EQU (0xFFFC4100) ;- (PDC_SSC1) Receive Pointer Register
AT91C_SSC1_TNCR           EQU (0xFFFC411C) ;- (PDC_SSC1) Transmit Next Counter Register
AT91C_SSC1_TPR            EQU (0xFFFC4108) ;- (PDC_SSC1) Transmit Pointer Register
/* - ========== Register definition for SSC1 peripheral ========== */
AT91C_SSC1_IMR            EQU (0xFFFC404C) ;- (SSC1) Interrupt Mask Register
AT91C_SSC1_IER            EQU (0xFFFC4044) ;- (SSC1) Interrupt Enable Register
AT91C_SSC1_THR            EQU (0xFFFC4024) ;- (SSC1) Transmit Holding Register
AT91C_SSC1_RFMR           EQU (0xFFFC4014) ;- (SSC1) Receive Frame Mode Register
AT91C_SSC1_TFMR           EQU (0xFFFC401C) ;- (SSC1) Transmit Frame Mode Register
AT91C_SSC1_IDR            EQU (0xFFFC4048) ;- (SSC1) Interrupt Disable Register
AT91C_SSC1_RSHR           EQU (0xFFFC4030) ;- (SSC1) Receive Sync Holding Register
AT91C_SSC1_TCMR           EQU (0xFFFC4018) ;- (SSC1) Transmit Clock Mode Register
AT91C_SSC1_RHR            EQU (0xFFFC4020) ;- (SSC1) Receive Holding Register
AT91C_SSC1_RCMR           EQU (0xFFFC4010) ;- (SSC1) Receive Clock ModeRegister
AT91C_SSC1_CR             EQU (0xFFFC4000) ;- (SSC1) Control Register
AT91C_SSC1_SR             EQU (0xFFFC4040) ;- (SSC1) Status Register
AT91C_SSC1_CMR            EQU (0xFFFC4004) ;- (SSC1) Clock Mode Register
AT91C_SSC1_TSHR           EQU (0xFFFC4034) ;- (SSC1) Transmit Sync Holding Register
/* - ========== Register definition for PWMC_CH0 peripheral ========== */
AT91C_PWMC_CH0_Reserved   EQU (0xFFFC8214) ;- (PWMC_CH0) Reserved
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFC8210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFC820C) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFC8204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFC8208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFC8200) ;- (PWMC_CH0) Channel Mode Register
/* - ========== Register definition for PWMC_CH1 peripheral ========== */
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFC8228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFC8220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_Reserved   EQU (0xFFFC8234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFC8230) ;- (PWMC_CH1) Channel Update Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFC8224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFC822C) ;- (PWMC_CH1) Channel Counter Register
/* - ========== Register definition for PWMC_CH2 peripheral ========== */
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFC824C) ;- (PWMC_CH2) Channel Counter Register
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFC8250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_Reserved   EQU (0xFFFC8254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFC8244) ;- (PWMC_CH2) Channel Duty Cycle Register
AT91C_PWMC_CH2_CMR        EQU (0xFFFC8240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFC8248) ;- (PWMC_CH2) Channel Period Register
/* - ========== Register definition for PWMC_CH3 peripheral ========== */
AT91C_PWMC_CH3_CPRDR      EQU (0xFFFC8268) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_CCNTR      EQU (0xFFFC826C) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CDTYR      EQU (0xFFFC8264) ;- (PWMC_CH3) Channel Duty Cycle Register
