una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
AT91C_PWMC_CH3_CUPDR      EQU (0xFFFC8270) ;- (PWMC_CH3) Channel Update Register
AT91C_PWMC_CH3_Reserved   EQU (0xFFFC8274) ;- (PWMC_CH3) Reserved
AT91C_PWMC_CH3_CMR        EQU (0xFFFC8260) ;- (PWMC_CH3) Channel Mode Register
/* - ========== Register definition for PWMC peripheral ========== */
AT91C_PWMC_IMR            EQU (0xFFFC8018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_SR             EQU (0xFFFC800C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_IER            EQU (0xFFFC8010) ;- (PWMC) PWMC Interrupt Enable Register
AT91C_PWMC_VR             EQU (0xFFFC80FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_MR             EQU (0xFFFC8000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_DIS            EQU (0xFFFC8008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_ENA            EQU (0xFFFC8004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_IDR            EQU (0xFFFC8014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_ISR            EQU (0xFFFC801C) ;- (PWMC) PWMC Interrupt Status Register
/* - ========== Register definition for PDC_SPI peripheral ========== */
AT91C_SPI_PTCR            EQU (0xFFFCC120) ;- (PDC_SPI) PDC Transfer Control Register
AT91C_SPI_RNPR            EQU (0xFFFCC110) ;- (PDC_SPI) Receive Next Pointer Register
AT91C_SPI_RCR             EQU (0xFFFCC104) ;- (PDC_SPI) Receive Counter Register
AT91C_SPI_TPR             EQU (0xFFFCC108) ;- (PDC_SPI) Transmit Pointer Register
AT91C_SPI_PTSR            EQU (0xFFFCC124) ;- (PDC_SPI) PDC Transfer Status Register
AT91C_SPI_TNCR            EQU (0xFFFCC11C) ;- (PDC_SPI) Transmit Next Counter Register
AT91C_SPI_RPR             EQU (0xFFFCC100) ;- (PDC_SPI) Receive Pointer Register
AT91C_SPI_TCR             EQU (0xFFFCC10C) ;- (PDC_SPI) Transmit Counter Register
AT91C_SPI_RNCR            EQU (0xFFFCC114) ;- (PDC_SPI) Receive Next Counter Register
AT91C_SPI_TNPR            EQU (0xFFFCC118) ;- (PDC_SPI) Transmit Next Pointer Register
/* - ========== Register definition for SPI peripheral ========== */
AT91C_SPI_IER             EQU (0xFFFCC014) ;- (SPI) Interrupt Enable Register
AT91C_SPI_RDR             EQU (0xFFFCC008) ;- (SPI) Receive Data Register
AT91C_SPI_SR              EQU (0xFFFCC010) ;- (SPI) Status Register
AT91C_SPI_IMR             EQU (0xFFFCC01C) ;- (SPI) Interrupt Mask Register
AT91C_SPI_TDR             EQU (0xFFFCC00C) ;- (SPI) Transmit Data Register
AT91C_SPI_IDR             EQU (0xFFFCC018) ;- (SPI) Interrupt Disable Register
AT91C_SPI_CSR             EQU (0xFFFCC030) ;- (SPI) Chip Select Register
AT91C_SPI_CR              EQU (0xFFFCC000) ;- (SPI) Control Register
AT91C_SPI_MR              EQU (0xFFFCC004) ;- (SPI) Mode Register
/* - ========== Register definition for PDC_TSADC peripheral ========== */
AT91C_TSADC_RNPR          EQU (0xFFFD0110) ;- (PDC_TSADC) Receive Next Pointer Register
AT91C_TSADC_RNCR          EQU (0xFFFD0114) ;- (PDC_TSADC) Receive Next Counter Register
AT91C_TSADC_PTSR          EQU (0xFFFD0124) ;- (PDC_TSADC) PDC Transfer Status Register
AT91C_TSADC_PTCR          EQU (0xFFFD0120) ;- (PDC_TSADC) PDC Transfer Control Register
AT91C_TSADC_TCR           EQU (0xFFFD010C) ;- (PDC_TSADC) Transmit Counter Register
AT91C_TSADC_TNPR          EQU (0xFFFD0118) ;- (PDC_TSADC) Transmit Next Pointer Register
AT91C_TSADC_RCR           EQU (0xFFFD0104) ;- (PDC_TSADC) Receive Counter Register
AT91C_TSADC_TPR           EQU (0xFFFD0108) ;- (PDC_TSADC) Transmit Pointer Register
AT91C_TSADC_TNCR          EQU (0xFFFD011C) ;- (PDC_TSADC) Transmit Next Counter Register
AT91C_TSADC_RPR           EQU (0xFFFD0100) ;- (PDC_TSADC) Receive Pointer Register
/* - ========== Register definition for TSADC peripheral ========== */
AT91C_TSADC_IER           EQU (0xFFFD0024) ;- (TSADC) Interrupt Enable Register
AT91C_TSADC_MR            EQU (0xFFFD0004) ;- (TSADC) Mode Register
AT91C_TSADC_CDR4          EQU (0xFFFD0040) ;- (TSADC) Channel Data Register 4
AT91C_TSADC_CDR2          EQU (0xFFFD0038) ;- (TSADC) Channel Data Register 2
AT91C_TSADC_TRGR          EQU (0xFFFD0008) ;- (TSADC) Trigger Register
AT91C_TSADC_IDR           EQU (0xFFFD0028) ;- (TSADC) Interrupt Disable Register
AT91C_TSADC_CHER          EQU (0xFFFD0010) ;- (TSADC) Channel Enable Register
AT91C_TSADC_CDR5          EQU (0xFFFD0044) ;- (TSADC) Channel Data Register 5
AT91C_TSADC_CDR3          EQU (0xFFFD003C) ;- (TSADC) Channel Data Register 3
AT91C_TSADC_TSR           EQU (0xFFFD000C) ;- (TSADC) Touch Screen Register
AT91C_TSADC_IMR           EQU (0xFFFD002C) ;- (TSADC) Interrupt Mask Register
AT91C_TSADC_CR            EQU (0xFFFD0000) ;- (TSADC) Control Register
AT91C_TSADC_SR            EQU (0xFFFD001C) ;- (TSADC) Status Register
AT91C_TSADC_LCDR          EQU (0xFFFD0020) ;- (TSADC) Last Converted Register
AT91C_TSADC_CHSR          EQU (0xFFFD0018) ;- (TSADC) Channel Status Register
AT91C_TSADC_CDR0          EQU (0xFFFD0030) ;- (TSADC) Channel Data Register 0
AT91C_TSADC_CHDR          EQU (0xFFFD0014) ;- (TSADC) Channel Disable Register
AT91C_TSADC_CDR1          EQU (0xFFFD0034) ;- (TSADC) Channel Data Register 1
/* - ========== Register definition for UDPHS_EPTFIFO peripheral ========== */
AT91C_UDPHS_EPTFIFO_READEPTF EQU (0x006F0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 15
AT91C_UDPHS_EPTFIFO_READEPT5 EQU (0x00650000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5
AT91C_UDPHS_EPTFIFO_READEPT1 EQU (0x00610000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1
AT91C_UDPHS_EPTFIFO_READEPTE EQU (0x006E0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 14
AT91C_UDPHS_EPTFIFO_READEPT4 EQU (0x00640000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4
AT91C_UDPHS_EPTFIFO_READEPTD EQU (0x006D0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 13
AT91C_UDPHS_EPTFIFO_READEPT2 EQU (0x00620000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2
AT91C_UDPHS_EPTFIFO_READEPT6 EQU (0x00660000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6
AT91C_UDPHS_EPTFIFO_READEPT9 EQU (0x00690000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 9
AT91C_UDPHS_EPTFIFO_READEPT0 EQU (0x00600000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0
AT91C_UDPHS_EPTFIFO_READEPTA EQU (0x006A0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 10
AT91C_UDPHS_EPTFIFO_READEPT3 EQU (0x00630000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3
AT91C_UDPHS_EPTFIFO_READEPTC EQU (0x006C0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 12
AT91C_UDPHS_EPTFIFO_READEPTB EQU (0x006B0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 11
AT91C_UDPHS_EPTFIFO_READEPT8 EQU (0x00680000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 8
AT91C_UDPHS_EPTFIFO_READEPT7 EQU (0x00670000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 7
/* - ========== Register definition for UDPHS_EPT_0 peripheral ========== */
AT91C_UDPHS_EPT_0_EPTSTA  EQU (0xFFFD411C) ;- (UDPHS_EPT_0) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_0_EPTCTLENB EQU (0xFFFD4104) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_0_EPTCFG  EQU (0xFFFD4100) ;- (UDPHS_EPT_0) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_0_EPTSETSTA EQU (0xFFFD4114) ;- (UDPHS_EPT_0) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_0_EPTCTLDIS EQU (0xFFFD4108) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_0_EPTCLRSTA EQU (0xFFFD4118) ;- (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_0_EPTCTL  EQU (0xFFFD410C) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Register
/* - ========== Register definition for UDPHS_EPT_1 peripheral ========== */
AT91C_UDPHS_EPT_1_EPTCTL  EQU (0xFFFD412C) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_1_EPTSTA  EQU (0xFFFD413C) ;- (UDPHS_EPT_1) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_1_EPTCTLDIS EQU (0xFFFD4128) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_1_EPTCFG  EQU (0xFFFD4120) ;- (UDPHS_EPT_1) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_1_EPTSETSTA EQU (0xFFFD4134) ;- (UDPHS_EPT_1) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_1_EPTCLRSTA EQU (0xFFFD4138) ;- (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_1_EPTCTLENB EQU (0xFFFD4124) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_2 peripheral ========== */
AT91C_UDPHS_EPT_2_EPTCLRSTA EQU (0xFFFD4158) ;- (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_2_EPTCTLDIS EQU (0xFFFD4148) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_2_EPTSETSTA EQU (0xFFFD4154) ;- (UDPHS_EPT_2) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_2_EPTCFG  EQU (0xFFFD4140) ;- (UDPHS_EPT_2) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_2_EPTCTL  EQU (0xFFFD414C) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_2_EPTSTA  EQU (0xFFFD415C) ;- (UDPHS_EPT_2) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_2_EPTCTLENB EQU (0xFFFD4144) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_3 peripheral ========== */
AT91C_UDPHS_EPT_3_EPTSTA  EQU (0xFFFD417C) ;- (UDPHS_EPT_3) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_3_EPTSETSTA EQU (0xFFFD4174) ;- (UDPHS_EPT_3) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_3_EPTCTL  EQU (0xFFFD416C) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_3_EPTCTLENB EQU (0xFFFD4164) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_3_EPTCLRSTA EQU (0xFFFD4178) ;- (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_3_EPTCFG  EQU (0xFFFD4160) ;- (UDPHS_EPT_3) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_3_EPTCTLDIS EQU (0xFFFD4168) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_4 peripheral ========== */
AT91C_UDPHS_EPT_4_EPTCLRSTA EQU (0xFFFD4198) ;- (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_4_EPTCTL  EQU (0xFFFD418C) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_4_EPTSTA  EQU (0xFFFD419C) ;- (UDPHS_EPT_4) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_4_EPTCTLENB EQU (0xFFFD4184) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_4_EPTCFG  EQU (0xFFFD4180) ;- (UDPHS_EPT_4) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_4_EPTSETSTA EQU (0xFFFD4194) ;- (UDPHS_EPT_4) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_4_EPTCTLDIS EQU (0xFFFD4188) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_5 peripheral ========== */
AT91C_UDPHS_EPT_5_EPTSETSTA EQU (0xFFFD41B4) ;- (UDPHS_EPT_5) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_5_EPTCTLDIS EQU (0xFFFD41A8) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_5_EPTCTL  EQU (0xFFFD41AC) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_5_EPTCTLENB EQU (0xFFFD41A4) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_5_EPTCFG  EQU (0xFFFD41A0) ;- (UDPHS_EPT_5) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_5_EPTCLRSTA EQU (0xFFFD41B8) ;- (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_5_EPTSTA  EQU (0xFFFD41BC) ;- (UDPHS_EPT_5) UDPHS Endpoint Status Register
/* - ========== Register definition for UDPHS_EPT_6 peripheral ========== */
AT91C_UDPHS_EPT_6_EPTCFG  EQU (0xFFFD41C0) ;- (UDPHS_EPT_6) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_6_EPTCLRSTA EQU (0xFFFD41D8) ;- (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_6_EPTCTL  EQU (0xFFFD41CC) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_6_EPTCTLDIS EQU (0xFFFD41C8) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_6_EPTSTA  EQU (0xFFFD41DC) ;- (UDPHS_EPT_6) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_6_EPTSETSTA EQU (0xFFFD41D4) ;- (UDPHS_EPT_6) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_6_EPTCTLENB EQU (0xFFFD41C4) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_7 peripheral ========== */
AT91C_UDPHS_EPT_7_EPTSETSTA EQU (0xFFFD41F4) ;- (UDPHS_EPT_7) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_7_EPTCTLDIS EQU (0xFFFD41E8) ;- (UDPHS_EPT_7) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_7_EPTCTLENB EQU (0xFFFD41E4) ;- (UDPHS_EPT_7) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_7_EPTSTA  EQU (0xFFFD41FC) ;- (UDPHS_EPT_7) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_7_EPTCLRSTA EQU (0xFFFD41F8) ;- (UDPHS_EPT_7) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_7_EPTCTL  EQU (0xFFFD41EC) ;- (UDPHS_EPT_7) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_7_EPTCFG  EQU (0xFFFD41E0) ;- (UDPHS_EPT_7) UDPHS Endpoint Config Register
/* - ========== Register definition for UDPHS_EPT_8 peripheral ========== */
AT91C_UDPHS_EPT_8_EPTCLRSTA EQU (0xFFFD4218) ;- (UDPHS_EPT_8) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_8_EPTCTLDIS EQU (0xFFFD4208) ;- (UDPHS_EPT_8) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_8_EPTSTA  EQU (0xFFFD421C) ;- (UDPHS_EPT_8) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_8_EPTCFG  EQU (0xFFFD4200) ;- (UDPHS_EPT_8) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_8_EPTCTL  EQU (0xFFFD420C) ;- (UDPHS_EPT_8) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_8_EPTSETSTA EQU (0xFFFD4214) ;- (UDPHS_EPT_8) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_8_EPTCTLENB EQU (0xFFFD4204) ;- (UDPHS_EPT_8) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_9 peripheral ========== */
AT91C_UDPHS_EPT_9_EPTCLRSTA EQU (0xFFFD4238) ;- (UDPHS_EPT_9) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_9_EPTCTLENB EQU (0xFFFD4224) ;- (UDPHS_EPT_9) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_9_EPTSTA  EQU (0xFFFD423C) ;- (UDPHS_EPT_9) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_9_EPTSETSTA EQU (0xFFFD4234) ;- (UDPHS_EPT_9) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_9_EPTCTL  EQU (0xFFFD422C) ;- (UDPHS_EPT_9) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_9_EPTCFG  EQU (0xFFFD4220) ;- (UDPHS_EPT_9) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_9_EPTCTLDIS EQU (0xFFFD4228) ;- (UDPHS_EPT_9) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_10 peripheral ========== */
AT91C_UDPHS_EPT_10_EPTCTL EQU (0xFFFD424C) ;- (UDPHS_EPT_10) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_10_EPTSETSTA EQU (0xFFFD4254) ;- (UDPHS_EPT_10) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_10_EPTCFG EQU (0xFFFD4240) ;- (UDPHS_EPT_10) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_10_EPTCLRSTA EQU (0xFFFD4258) ;- (UDPHS_EPT_10) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_10_EPTSTA EQU (0xFFFD425C) ;- (UDPHS_EPT_10) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_10_EPTCTLDIS EQU (0xFFFD4248) ;- (UDPHS_EPT_10) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_10_EPTCTLENB EQU (0xFFFD4244) ;- (UDPHS_EPT_10) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_11 peripheral ========== */
AT91C_UDPHS_EPT_11_EPTCTL EQU (0xFFFD426C) ;- (UDPHS_EPT_11) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_11_EPTCFG EQU (0xFFFD4260) ;- (UDPHS_EPT_11) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_11_EPTSTA EQU (0xFFFD427C) ;- (UDPHS_EPT_11) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_11_EPTCTLENB EQU (0xFFFD4264) ;- (UDPHS_EPT_11) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_11_EPTCLRSTA EQU (0xFFFD4278) ;- (UDPHS_EPT_11) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_11_EPTSETSTA EQU (0xFFFD4274) ;- (UDPHS_EPT_11) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_11_EPTCTLDIS EQU (0xFFFD4268) ;- (UDPHS_EPT_11) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_12 peripheral ========== */
AT91C_UDPHS_EPT_12_EPTCTLENB EQU (0xFFFD4284) ;- (UDPHS_EPT_12) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_12_EPTSTA EQU (0xFFFD429C) ;- (UDPHS_EPT_12) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_12_EPTCTLDIS EQU (0xFFFD4288) ;- (UDPHS_EPT_12) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_12_EPTSETSTA EQU (0xFFFD4294) ;- (UDPHS_EPT_12) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_12_EPTCLRSTA EQU (0xFFFD4298) ;- (UDPHS_EPT_12) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_12_EPTCTL EQU (0xFFFD428C) ;- (UDPHS_EPT_12) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_12_EPTCFG EQU (0xFFFD4280) ;- (UDPHS_EPT_12) UDPHS Endpoint Config Register
/* - ========== Register definition for UDPHS_EPT_13 peripheral ========== */
AT91C_UDPHS_EPT_13_EPTSETSTA EQU (0xFFFD42B4) ;- (UDPHS_EPT_13) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_13_EPTCTLENB EQU (0xFFFD42A4) ;- (UDPHS_EPT_13) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_13_EPTCFG EQU (0xFFFD42A0) ;- (UDPHS_EPT_13) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_13_EPTSTA EQU (0xFFFD42BC) ;- (UDPHS_EPT_13) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_13_EPTCLRSTA EQU (0xFFFD42B8) ;- (UDPHS_EPT_13) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_13_EPTCTLDIS EQU (0xFFFD42A8) ;- (UDPHS_EPT_13) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_13_EPTCTL EQU (0xFFFD42AC) ;- (UDPHS_EPT_13) UDPHS Endpoint Control Register
/* - ========== Register definition for UDPHS_EPT_14 peripheral ========== */
AT91C_UDPHS_EPT_14_EPTCFG EQU (0xFFFD42C0) ;- (UDPHS_EPT_14) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_14_EPTCLRSTA EQU (0xFFFD42D8) ;- (UDPHS_EPT_14) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_14_EPTCTLENB EQU (0xFFFD42C4) ;- (UDPHS_EPT_14) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_14_EPTCTL EQU (0xFFFD42CC) ;- (UDPHS_EPT_14) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_14_EPTSTA EQU (0xFFFD42DC) ;- (UDPHS_EPT_14) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_14_EPTSETSTA EQU (0xFFFD42D4) ;- (UDPHS_EPT_14) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_14_EPTCTLDIS EQU (0xFFFD42C8) ;- (UDPHS_EPT_14) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_15 peripheral ========== */
AT91C_UDPHS_EPT_15_EPTCLRSTA EQU (0xFFFD42F8) ;- (UDPHS_EPT_15) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_15_EPTCTLDIS EQU (0xFFFD42E8) ;- (UDPHS_EPT_15) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_15_EPTSTA EQU (0xFFFD42FC) ;- (UDPHS_EPT_15) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_15_EPTCFG EQU (0xFFFD42E0) ;- (UDPHS_EPT_15) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_15_EPTCTLENB EQU (0xFFFD42E4) ;- (UDPHS_EPT_15) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_15_EPTCTL EQU (0xFFFD42EC) ;- (UDPHS_EPT_15) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_15_EPTSETSTA EQU (0xFFFD42F4) ;- (UDPHS_EPT_15) UDPHS Endpoint Set Status Register
/* - ========== Register definition for UDPHS_DMA_1 peripheral ========== */
AT91C_UDPHS_DMA_1_DMACONTROL EQU (0xFFFD4318) ;- (UDPHS_DMA_1) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_1_DMAADDRESS EQU (0xFFFD4314) ;- (UDPHS_DMA_1) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_1_DMASTATUS EQU (0xFFFD431C) ;- (UDPHS_DMA_1) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_1_DMANXTDSC EQU (0xFFFD4310) ;- (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address
/* - ========== Register definition for UDPHS_DMA_2 peripheral ========== */
AT91C_UDPHS_DMA_2_DMACONTROL EQU (0xFFFD4328) ;- (UDPHS_DMA_2) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_2_DMASTATUS EQU (0xFFFD432C) ;- (UDPHS_DMA_2) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_2_DMANXTDSC EQU (0xFFFD4320) ;- (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_2_DMAADDRESS EQU (0xFFFD4324) ;- (UDPHS_DMA_2) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS_DMA_3 peripheral ========== */
AT91C_UDPHS_DMA_3_DMACONTROL EQU (0xFFFD4338) ;- (UDPHS_DMA_3) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_3_DMAADDRESS EQU (0xFFFD4334) ;- (UDPHS_DMA_3) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_3_DMANXTDSC EQU (0xFFFD4330) ;- (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_3_DMASTATUS EQU (0xFFFD433C) ;- (UDPHS_DMA_3) UDPHS DMA Channel Status Register
/* - ========== Register definition for UDPHS_DMA_4 peripheral ========== */
AT91C_UDPHS_DMA_4_DMASTATUS EQU (0xFFFD434C) ;- (UDPHS_DMA_4) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_4_DMANXTDSC EQU (0xFFFD4340) ;- (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_4_DMAADDRESS EQU (0xFFFD4344) ;- (UDPHS_DMA_4) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_4_DMACONTROL EQU (0xFFFD4348) ;- (UDPHS_DMA_4) UDPHS DMA Channel Control Register
/* - ========== Register definition for UDPHS_DMA_5 peripheral ========== */
AT91C_UDPHS_DMA_5_DMASTATUS EQU (0xFFFD435C) ;- (UDPHS_DMA_5) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_5_DMACONTROL EQU (0xFFFD4358) ;- (UDPHS_DMA_5) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_5_DMAADDRESS EQU (0xFFFD4354) ;- (UDPHS_DMA_5) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_5_DMANXTDSC EQU (0xFFFD4350) ;- (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address
/* - ========== Register definition for UDPHS_DMA_6 peripheral ========== */
AT91C_UDPHS_DMA_6_DMAADDRESS EQU (0xFFFD4364) ;- (UDPHS_DMA_6) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_6_DMACONTROL EQU (0xFFFD4368) ;- (UDPHS_DMA_6) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_6_DMASTATUS EQU (0xFFFD436C) ;- (UDPHS_DMA_6) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_6_DMANXTDSC EQU (0xFFFD4360) ;- (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address
/* - ========== Register definition for UDPHS_DMA_7 peripheral ========== */
AT91C_UDPHS_DMA_7_DMANXTDSC EQU (0xFFFD4370) ;- (UDPHS_DMA_7) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_7_DMAADDRESS EQU (0xFFFD4374) ;- (UDPHS_DMA_7) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_7_DMASTATUS EQU (0xFFFD437C) ;- (UDPHS_DMA_7) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_7_DMACONTROL EQU (0xFFFD4378) ;- (UDPHS_DMA_7) UDPHS DMA Channel Control Register
/* - ========== Register definition for UDPHS peripheral ========== */
AT91C_UDPHS_TSTMODREG     EQU (0xFFFD40DC) ;- (UDPHS) UDPHS Test Mode Register
AT91C_UDPHS_RIPNAME2      EQU (0xFFFD40F4) ;- (UDPHS) UDPHS Name2 Register
AT91C_UDPHS_TSTSOFCNT     EQU (0xFFFD40D0) ;- (UDPHS) UDPHS Test SOF Counter Register
AT91C_UDPHS_EPTRST        EQU (0xFFFD401C) ;- (UDPHS) UDPHS Endpoints Reset Register
AT91C_UDPHS_TSTCNTA       EQU (0xFFFD40D4) ;- (UDPHS) UDPHS Test A Counter Register
AT91C_UDPHS_IEN           EQU (0xFFFD4010) ;- (UDPHS) UDPHS Interrupt Enable Register
AT91C_UDPHS_TSTCNTB       EQU (0xFFFD40D8) ;- (UDPHS) UDPHS Test B Counter Register
AT91C_UDPHS_TST           EQU (0xFFFD40E0) ;- (UDPHS) UDPHS Test Register
AT91C_UDPHS_IPFEATURES    EQU (0xFFFD40F8) ;- (UDPHS) UDPHS Features Register
AT91C_UDPHS_RIPNAME1      EQU (0xFFFD40F0) ;- (UDPHS) UDPHS Name1 Register
AT91C_UDPHS_FNUM          EQU (0xFFFD4004) ;- (UDPHS) UDPHS Frame Number Register
AT91C_UDPHS_CLRINT        EQU (0xFFFD4018) ;- (UDPHS) UDPHS Clear Interrupt Register
AT91C_UDPHS_IPVERSION     EQU (0xFFFD40FC) ;- (UDPHS) UDPHS Version Register
AT91C_UDPHS_RIPPADDRSIZE  EQU (0xFFFD40EC) ;- (UDPHS) UDPHS PADDRSIZE Register
AT91C_UDPHS_CTRL          EQU (0xFFFD4000) ;- (UDPHS) UDPHS Control Register
AT91C_UDPHS_INTSTA        EQU (0xFFFD4014) ;- (UDPHS) UDPHS Interrupt Status Register
/* - ========== Register definition for PDC_AC97C peripheral ========== */
AT91C_AC97C_PTSR          EQU (0xFFFD8124) ;- (PDC_AC97C) PDC Transfer Status Register
AT91C_AC97C_PTCR          EQU (0xFFFD8120) ;- (PDC_AC97C) PDC Transfer Control Register
AT91C_AC97C_TNPR          EQU (0xFFFD8118) ;- (PDC_AC97C) Transmit Next Pointer Register
