una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
AT91C_AC97C_TNCR          EQU (0xFFFD811C) ;- (PDC_AC97C) Transmit Next Counter Register
AT91C_AC97C_RNPR          EQU (0xFFFD8110) ;- (PDC_AC97C) Receive Next Pointer Register
AT91C_AC97C_RNCR          EQU (0xFFFD8114) ;- (PDC_AC97C) Receive Next Counter Register
AT91C_AC97C_RPR           EQU (0xFFFD8100) ;- (PDC_AC97C) Receive Pointer Register
AT91C_AC97C_TCR           EQU (0xFFFD810C) ;- (PDC_AC97C) Transmit Counter Register
AT91C_AC97C_TPR           EQU (0xFFFD8108) ;- (PDC_AC97C) Transmit Pointer Register
AT91C_AC97C_RCR           EQU (0xFFFD8104) ;- (PDC_AC97C) Receive Counter Register
/* - ========== Register definition for AC97C peripheral ========== */
AT91C_AC97C_CBSR          EQU (0xFFFD8038) ;- (AC97C) Channel B Status Register
AT91C_AC97C_CBMR          EQU (0xFFFD803C) ;- (AC97C) Channel B Mode Register
AT91C_AC97C_CBRHR         EQU (0xFFFD8030) ;- (AC97C) Channel B Receive Holding Register (optional)
AT91C_AC97C_COTHR         EQU (0xFFFD8044) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_OCA           EQU (0xFFFD8014) ;- (AC97C) Output Channel Assignement Register
AT91C_AC97C_IMR           EQU (0xFFFD805C) ;- (AC97C) Interrupt Mask Register
AT91C_AC97C_CORHR         EQU (0xFFFD8040) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_CBTHR         EQU (0xFFFD8034) ;- (AC97C) Channel B Transmit Holding Register (optional)
AT91C_AC97C_CARHR         EQU (0xFFFD8020) ;- (AC97C) Channel A Receive Holding Register
AT91C_AC97C_CASR          EQU (0xFFFD8028) ;- (AC97C) Channel A Status Register
AT91C_AC97C_IER           EQU (0xFFFD8054) ;- (AC97C) Interrupt Enable Register
AT91C_AC97C_MR            EQU (0xFFFD8008) ;- (AC97C) Mode Register
AT91C_AC97C_COSR          EQU (0xFFFD8048) ;- (AC97C) CODEC Status Register
AT91C_AC97C_COMR          EQU (0xFFFD804C) ;- (AC97C) CODEC Mask Status Register
AT91C_AC97C_CATHR         EQU (0xFFFD8024) ;- (AC97C) Channel A Transmit Holding Register
AT91C_AC97C_ICA           EQU (0xFFFD8010) ;- (AC97C) Input Channel AssignementRegister
AT91C_AC97C_IDR           EQU (0xFFFD8058) ;- (AC97C) Interrupt Disable Register
AT91C_AC97C_CAMR          EQU (0xFFFD802C) ;- (AC97C) Channel A Mode Register
AT91C_AC97C_VERSION       EQU (0xFFFD80FC) ;- (AC97C) Version Register
AT91C_AC97C_SR            EQU (0xFFFD8050) ;- (AC97C) Status Register
/* - ========== Register definition for LCDC peripheral ========== */
AT91C_LCDC_MVAL           EQU (0x00500818) ;- (LCDC) LCD Mode Toggle Rate Value Register
AT91C_LCDC_PWRCON         EQU (0x0050083C) ;- (LCDC) Power Control Register
AT91C_LCDC_ISR            EQU (0x00500854) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_FRMP1          EQU (0x00500008) ;- (LCDC) DMA Frame Pointer Register 1
AT91C_LCDC_CTRSTVAL       EQU (0x00500844) ;- (LCDC) Contrast Value Register
AT91C_LCDC_ICR            EQU (0x00500858) ;- (LCDC) Interrupt Clear Register
AT91C_LCDC_TIM1           EQU (0x00500808) ;- (LCDC) LCD Timing Config 1 Register
AT91C_LCDC_DMACON         EQU (0x0050001C) ;- (LCDC) DMA Control Register
AT91C_LCDC_ITR            EQU (0x00500860) ;- (LCDC) Interrupts Test Register
AT91C_LCDC_IDR            EQU (0x0050084C) ;- (LCDC) Interrupt Disable Register
AT91C_LCDC_DP4_7          EQU (0x00500820) ;- (LCDC) Dithering Pattern DP4_7 Register
AT91C_LCDC_DP5_7          EQU (0x0050082C) ;- (LCDC) Dithering Pattern DP5_7 Register
AT91C_LCDC_IRR            EQU (0x00500864) ;- (LCDC) Interrupts Raw Status Register
AT91C_LCDC_DP3_4          EQU (0x00500830) ;- (LCDC) Dithering Pattern DP3_4 Register
AT91C_LCDC_IMR            EQU (0x00500850) ;- (LCDC) Interrupt Mask Register
AT91C_LCDC_LCDFRCFG       EQU (0x00500810) ;- (LCDC) LCD Frame Config Register
AT91C_LCDC_CTRSTCON       EQU (0x00500840) ;- (LCDC) Contrast Control Register
AT91C_LCDC_DP1_2          EQU (0x0050081C) ;- (LCDC) Dithering Pattern DP1_2 Register
AT91C_LCDC_FRMP2          EQU (0x0050000C) ;- (LCDC) DMA Frame Pointer Register 2
AT91C_LCDC_LCDCON1        EQU (0x00500800) ;- (LCDC) LCD Control 1 Register
AT91C_LCDC_DP4_5          EQU (0x00500834) ;- (LCDC) Dithering Pattern DP4_5 Register
AT91C_LCDC_FRMA2          EQU (0x00500014) ;- (LCDC) DMA Frame Address Register 2
AT91C_LCDC_BA1            EQU (0x00500000) ;- (LCDC) DMA Base Address Register 1
AT91C_LCDC_DMA2DCFG       EQU (0x00500020) ;- (LCDC) DMA 2D addressing configuration
AT91C_LCDC_LUT_ENTRY      EQU (0x00500C00) ;- (LCDC) LUT Entries Register
AT91C_LCDC_DP6_7          EQU (0x00500838) ;- (LCDC) Dithering Pattern DP6_7 Register
AT91C_LCDC_FRMCFG         EQU (0x00500018) ;- (LCDC) DMA Frame Configuration Register
AT91C_LCDC_TIM2           EQU (0x0050080C) ;- (LCDC) LCD Timing Config 2 Register
AT91C_LCDC_DP3_5          EQU (0x00500824) ;- (LCDC) Dithering Pattern DP3_5 Register
AT91C_LCDC_FRMA1          EQU (0x00500010) ;- (LCDC) DMA Frame Address Register 1
AT91C_LCDC_IER            EQU (0x00500848) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_DP2_3          EQU (0x00500828) ;- (LCDC) Dithering Pattern DP2_3 Register
AT91C_LCDC_FIFO           EQU (0x00500814) ;- (LCDC) LCD FIFO Register
AT91C_LCDC_BA2            EQU (0x00500004) ;- (LCDC) DMA Base Address Register 2
AT91C_LCDC_LCDCON2        EQU (0x00500804) ;- (LCDC) LCD Control 2 Register
AT91C_LCDC_GPR            EQU (0x0050085C) ;- (LCDC) General Purpose Register
/* - ========== Register definition for LCDC_16B_TFT peripheral ========== */
AT91C_TFT_MVAL            EQU (0x00500818) ;- (LCDC_16B_TFT) LCD Mode Toggle Rate Value Register
AT91C_TFT_PWRCON          EQU (0x0050083C) ;- (LCDC_16B_TFT) Power Control Register
AT91C_TFT_ISR             EQU (0x00500854) ;- (LCDC_16B_TFT) Interrupt Enable Register
AT91C_TFT_FRMP1           EQU (0x00500008) ;- (LCDC_16B_TFT) DMA Frame Pointer Register 1
AT91C_TFT_CTRSTVAL        EQU (0x00500844) ;- (LCDC_16B_TFT) Contrast Value Register
AT91C_TFT_ICR             EQU (0x00500858) ;- (LCDC_16B_TFT) Interrupt Clear Register
AT91C_TFT_TIM1            EQU (0x00500808) ;- (LCDC_16B_TFT) LCD Timing Config 1 Register
AT91C_TFT_DMACON          EQU (0x0050001C) ;- (LCDC_16B_TFT) DMA Control Register
AT91C_TFT_ITR             EQU (0x00500860) ;- (LCDC_16B_TFT) Interrupts Test Register
AT91C_TFT_IDR             EQU (0x0050084C) ;- (LCDC_16B_TFT) Interrupt Disable Register
AT91C_TFT_DP4_7           EQU (0x00500820) ;- (LCDC_16B_TFT) Dithering Pattern DP4_7 Register
AT91C_TFT_DP5_7           EQU (0x0050082C) ;- (LCDC_16B_TFT) Dithering Pattern DP5_7 Register
AT91C_TFT_IRR             EQU (0x00500864) ;- (LCDC_16B_TFT) Interrupts Raw Status Register
AT91C_TFT_DP3_4           EQU (0x00500830) ;- (LCDC_16B_TFT) Dithering Pattern DP3_4 Register
AT91C_TFT_IMR             EQU (0x00500850) ;- (LCDC_16B_TFT) Interrupt Mask Register
AT91C_TFT_LCDFRCFG        EQU (0x00500810) ;- (LCDC_16B_TFT) LCD Frame Config Register
AT91C_TFT_CTRSTCON        EQU (0x00500840) ;- (LCDC_16B_TFT) Contrast Control Register
AT91C_TFT_DP1_2           EQU (0x0050081C) ;- (LCDC_16B_TFT) Dithering Pattern DP1_2 Register
AT91C_TFT_FRMP2           EQU (0x0050000C) ;- (LCDC_16B_TFT) DMA Frame Pointer Register 2
AT91C_TFT_LCDCON1         EQU (0x00500800) ;- (LCDC_16B_TFT) LCD Control 1 Register
AT91C_TFT_DP4_5           EQU (0x00500834) ;- (LCDC_16B_TFT) Dithering Pattern DP4_5 Register
AT91C_TFT_FRMA2           EQU (0x00500014) ;- (LCDC_16B_TFT) DMA Frame Address Register 2
AT91C_TFT_BA1             EQU (0x00500000) ;- (LCDC_16B_TFT) DMA Base Address Register 1
AT91C_TFT_DMA2DCFG        EQU (0x00500020) ;- (LCDC_16B_TFT) DMA 2D addressing configuration
AT91C_TFT_LUT_ENTRY       EQU (0x00500C00) ;- (LCDC_16B_TFT) LUT Entries Register
AT91C_TFT_DP6_7           EQU (0x00500838) ;- (LCDC_16B_TFT) Dithering Pattern DP6_7 Register
AT91C_TFT_FRMCFG          EQU (0x00500018) ;- (LCDC_16B_TFT) DMA Frame Configuration Register
AT91C_TFT_TIM2            EQU (0x0050080C) ;- (LCDC_16B_TFT) LCD Timing Config 2 Register
AT91C_TFT_DP3_5           EQU (0x00500824) ;- (LCDC_16B_TFT) Dithering Pattern DP3_5 Register
AT91C_TFT_FRMA1           EQU (0x00500010) ;- (LCDC_16B_TFT) DMA Frame Address Register 1
AT91C_TFT_IER             EQU (0x00500848) ;- (LCDC_16B_TFT) Interrupt Enable Register
AT91C_TFT_DP2_3           EQU (0x00500828) ;- (LCDC_16B_TFT) Dithering Pattern DP2_3 Register
AT91C_TFT_FIFO            EQU (0x00500814) ;- (LCDC_16B_TFT) LCD FIFO Register
AT91C_TFT_BA2             EQU (0x00500004) ;- (LCDC_16B_TFT) DMA Base Address Register 2
AT91C_TFT_LCDCON2         EQU (0x00500804) ;- (LCDC_16B_TFT) LCD Control 2 Register
AT91C_TFT_GPR             EQU (0x0050085C) ;- (LCDC_16B_TFT) General Purpose Register
/* - ========== Register definition for HDMA_CH_0 peripheral ========== */
AT91C_HDMA_CH_0_CFG       EQU (0xFFFFE650) ;- (HDMA_CH_0) HDMA Channel Configuration Register
AT91C_HDMA_CH_0_CTRLB     EQU (0xFFFFE64C) ;- (HDMA_CH_0) HDMA Channel Control B Register
AT91C_HDMA_CH_0_DADDR     EQU (0xFFFFE640) ;- (HDMA_CH_0) HDMA Channel Destination Address Register
AT91C_HDMA_CH_0_DPIP      EQU (0xFFFFE658) ;- (HDMA_CH_0) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_0_SPIP      EQU (0xFFFFE654) ;- (HDMA_CH_0) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_0_DSCR      EQU (0xFFFFE644) ;- (HDMA_CH_0) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_0_BDSCR     EQU (0xFFFFE65C) ;- (HDMA_CH_0) HDMA Reserved
AT91C_HDMA_CH_0_SADDR     EQU (0xFFFFE63C) ;- (HDMA_CH_0) HDMA Channel Source Address Register
AT91C_HDMA_CH_0_CTRLA     EQU (0xFFFFE648) ;- (HDMA_CH_0) HDMA Channel Control A Register
AT91C_HDMA_CH_0_CADDR     EQU (0xFFFFE660) ;- (HDMA_CH_0) HDMA Reserved
/* - ========== Register definition for HDMA_CH_1 peripheral ========== */
AT91C_HDMA_CH_1_DADDR     EQU (0xFFFFE668) ;- (HDMA_CH_1) HDMA Channel Destination Address Register
AT91C_HDMA_CH_1_BDSCR     EQU (0xFFFFE684) ;- (HDMA_CH_1) HDMA Reserved
AT91C_HDMA_CH_1_CFG       EQU (0xFFFFE678) ;- (HDMA_CH_1) HDMA Channel Configuration Register
AT91C_HDMA_CH_1_CTRLB     EQU (0xFFFFE674) ;- (HDMA_CH_1) HDMA Channel Control B Register
AT91C_HDMA_CH_1_SADDR     EQU (0xFFFFE664) ;- (HDMA_CH_1) HDMA Channel Source Address Register
AT91C_HDMA_CH_1_CTRLA     EQU (0xFFFFE670) ;- (HDMA_CH_1) HDMA Channel Control A Register
AT91C_HDMA_CH_1_CADDR     EQU (0xFFFFE688) ;- (HDMA_CH_1) HDMA Reserved
AT91C_HDMA_CH_1_SPIP      EQU (0xFFFFE67C) ;- (HDMA_CH_1) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_1_DSCR      EQU (0xFFFFE66C) ;- (HDMA_CH_1) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_1_DPIP      EQU (0xFFFFE680) ;- (HDMA_CH_1) HDMA Channel Destination Picture in Picture Configuration Register
/* - ========== Register definition for HDMA peripheral ========== */
AT91C_HDMA_CHER           EQU (0xFFFFE628) ;- (HDMA) HDMA Channel Handler Enable Register
AT91C_HDMA_EN             EQU (0xFFFFE604) ;- (HDMA) HDMA Controller Enable Register
AT91C_HDMA_EBCIMR         EQU (0xFFFFE620) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register
AT91C_HDMA_BREQ           EQU (0xFFFFE60C) ;- (HDMA) HDMA Software Chunk Transfer Request Register
AT91C_HDMA_EBCIDR         EQU (0xFFFFE61C) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register
AT91C_HDMA_CHDR           EQU (0xFFFFE62C) ;- (HDMA) HDMA Channel Handler Disable Register
AT91C_HDMA_RSVD0          EQU (0xFFFFE634) ;- (HDMA) HDMA Reserved
AT91C_HDMA_SYNC           EQU (0xFFFFE614) ;- (HDMA) HDMA Request Synchronization Register
AT91C_HDMA_GCFG           EQU (0xFFFFE600) ;- (HDMA) HDMA Global Configuration Register
AT91C_HDMA_EBCISR         EQU (0xFFFFE624) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register
AT91C_HDMA_CHSR           EQU (0xFFFFE630) ;- (HDMA) HDMA Channel Handler Status Register
AT91C_HDMA_LAST           EQU (0xFFFFE610) ;- (HDMA) HDMA Software Last Transfer Flag Register
AT91C_HDMA_RSVD1          EQU (0xFFFFE638) ;- (HDMA) HDMA Reserved
AT91C_HDMA_SREQ           EQU (0xFFFFE608) ;- (HDMA) HDMA Software Single Request Register
AT91C_HDMA_EBCIER         EQU (0xFFFFE618) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register
/* - ========== Register definition for HECC peripheral ========== */
AT91C_HECC_VR             EQU (0xFFFFE8FC) ;- (HECC)  ECC Version register
AT91C_HECC_NPR            EQU (0xFFFFE810) ;- (HECC)  ECC Parity N register
AT91C_HECC_SR             EQU (0xFFFFE808) ;- (HECC)  ECC Status register
AT91C_HECC_PR             EQU (0xFFFFE80C) ;- (HECC)  ECC Parity register
AT91C_HECC_MR             EQU (0xFFFFE804) ;- (HECC)  ECC Page size register
AT91C_HECC_CR             EQU (0xFFFFE800) ;- (HECC)  ECC reset register

