una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9rl64.h
/* - ******************************************************************************/
/* -               PERIPHERAL ID DEFINITIONS FOR AT91SAM9RL64*/
/* - ******************************************************************************/
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Controller
AT91C_ID_PIOA             EQU ( 2) ;- Parallel IO Controller A
AT91C_ID_PIOB             EQU ( 3) ;- Parallel IO Controller B
AT91C_ID_PIOC             EQU ( 4) ;- Parallel IO Controller C
AT91C_ID_PIOD             EQU ( 5) ;- Parallel IO Controller D
AT91C_ID_US0              EQU ( 6) ;- USART 0
AT91C_ID_US1              EQU ( 7) ;- USART 1
AT91C_ID_US2              EQU ( 8) ;- USART 2
AT91C_ID_US3              EQU ( 9) ;- USART 2
AT91C_ID_MCI              EQU (10) ;- Multimedia Card Interface
AT91C_ID_TWI0             EQU (11) ;- TWI 0
AT91C_ID_TWI1             EQU (12) ;- TWI 1
AT91C_ID_SPI              EQU (13) ;- Serial Peripheral Interface
AT91C_ID_SSC0             EQU (14) ;- Serial Synchronous Controller 0
AT91C_ID_SSC1             EQU (15) ;- Serial Synchronous Controller 1
AT91C_ID_TC0              EQU (16) ;- Timer Counter 0
AT91C_ID_TC1              EQU (17) ;- Timer Counter 1
AT91C_ID_TC2              EQU (18) ;- Timer Counter 2
AT91C_ID_PWMC             EQU (19) ;- Pulse Width Modulation Controller
AT91C_ID_TSADC            EQU (20) ;- Touch Screen Controller
AT91C_ID_HDMA             EQU (21) ;- HDMA
AT91C_ID_UDPHS            EQU (22) ;- USB Device HS
AT91C_ID_LCDC             EQU (23) ;- LCD Controller
AT91C_ID_AC97C            EQU (24) ;- AC97 Controller
AT91C_ID_IRQ0             EQU (31) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ALL_INT             EQU (0x81FFFFFF) ;- ALL VALID INTERRUPTS

/* - ******************************************************************************/
/* -               BASE ADDRESS DEFINITIONS FOR AT91SAM9RL64*/
/* - ******************************************************************************/
AT91C_BASE_SYS            EQU (0xFFFFC000) ;- (SYS) Base Address
AT91C_BASE_EBI            EQU (0xFFFFE800) ;- (EBI) Base Address
AT91C_BASE_SDRAMC         EQU (0xFFFFEA00) ;- (SDRAMC) Base Address
AT91C_BASE_SMC            EQU (0xFFFFEC00) ;- (SMC) Base Address
AT91C_BASE_MATRIX         EQU (0xFFFFEE00) ;- (MATRIX) Base Address
AT91C_BASE_CCFG           EQU (0xFFFFEF10) ;- (CCFG) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFF300) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFF200) ;- (DBGU) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF400) ;- (PIOA) Base Address
AT91C_BASE_PIOB           EQU (0xFFFFF600) ;- (PIOB) Base Address
AT91C_BASE_PIOC           EQU (0xFFFFF800) ;- (PIOC) Base Address
AT91C_BASE_PIOD           EQU (0xFFFFFA00) ;- (PIOD) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC1C) ;- (CKGR) Base Address
AT91C_BASE_RSTC           EQU (0xFFFFFD00) ;- (RSTC) Base Address
AT91C_BASE_SHDWC          EQU (0xFFFFFD10) ;- (SHDWC) Base Address
AT91C_BASE_RTTC           EQU (0xFFFFFD20) ;- (RTTC) Base Address
AT91C_BASE_PITC           EQU (0xFFFFFD30) ;- (PITC) Base Address
AT91C_BASE_WDTC           EQU (0xFFFFFD40) ;- (WDTC) Base Address
AT91C_BASE_RTC            EQU (0xFFFFFE00) ;- (RTC) Base Address
AT91C_BASE_TC0            EQU (0xFFFA0000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0xFFFA0040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0xFFFA0080) ;- (TC2) Base Address
AT91C_BASE_TCB0           EQU (0xFFFA0000) ;- (TCB0) Base Address
AT91C_BASE_TCB1           EQU (0xFFFA0040) ;- (TCB1) Base Address
AT91C_BASE_TCB2           EQU (0xFFFA0080) ;- (TCB2) Base Address
AT91C_BASE_PDC_MCI        EQU (0xFFFA4100) ;- (PDC_MCI) Base Address
AT91C_BASE_MCI            EQU (0xFFFA4000) ;- (MCI) Base Address
AT91C_BASE_PDC_TWI0       EQU (0xFFFA8100) ;- (PDC_TWI0) Base Address
AT91C_BASE_TWI0           EQU (0xFFFA8000) ;- (TWI0) Base Address
AT91C_BASE_TWI1           EQU (0xFFFAC000) ;- (TWI1) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFFB0100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFFB0000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFFB4100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFFB4000) ;- (US1) Base Address
AT91C_BASE_PDC_US2        EQU (0xFFFB8100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0xFFFB8000) ;- (US2) Base Address
AT91C_BASE_PDC_US3        EQU (0xFFFBC100) ;- (PDC_US3) Base Address
AT91C_BASE_US3            EQU (0xFFFBC000) ;- (US3) Base Address
AT91C_BASE_PDC_SSC0       EQU (0xFFFC0100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0xFFFC0000) ;- (SSC0) Base Address
AT91C_BASE_PDC_SSC1       EQU (0xFFFC4100) ;- (PDC_SSC1) Base Address
AT91C_BASE_SSC1           EQU (0xFFFC4000) ;- (SSC1) Base Address
AT91C_BASE_PWMC_CH0       EQU (0xFFFC8200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0xFFFC8220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0xFFFC8240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0xFFFC8260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC           EQU (0xFFFC8000) ;- (PWMC) Base Address
AT91C_BASE_PDC_SPI        EQU (0xFFFCC100) ;- (PDC_SPI) Base Address
AT91C_BASE_SPI            EQU (0xFFFCC000) ;- (SPI) Base Address
AT91C_BASE_PDC_TSADC      EQU (0xFFFD0100) ;- (PDC_TSADC) Base Address
AT91C_BASE_TSADC          EQU (0xFFFD0000) ;- (TSADC) Base Address
AT91C_BASE_UDPHS_EPTFIFO  EQU (0x00600000) ;- (UDPHS_EPTFIFO) Base Address
AT91C_BASE_UDPHS_EPT_0    EQU (0xFFFD4100) ;- (UDPHS_EPT_0) Base Address
AT91C_BASE_UDPHS_EPT_1    EQU (0xFFFD4120) ;- (UDPHS_EPT_1) Base Address
AT91C_BASE_UDPHS_EPT_2    EQU (0xFFFD4140) ;- (UDPHS_EPT_2) Base Address
AT91C_BASE_UDPHS_EPT_3    EQU (0xFFFD4160) ;- (UDPHS_EPT_3) Base Address
AT91C_BASE_UDPHS_EPT_4    EQU (0xFFFD4180) ;- (UDPHS_EPT_4) Base Address
AT91C_BASE_UDPHS_EPT_5    EQU (0xFFFD41A0) ;- (UDPHS_EPT_5) Base Address
AT91C_BASE_UDPHS_EPT_6    EQU (0xFFFD41C0) ;- (UDPHS_EPT_6) Base Address
AT91C_BASE_UDPHS_EPT_7    EQU (0xFFFD41E0) ;- (UDPHS_EPT_7) Base Address
AT91C_BASE_UDPHS_EPT_8    EQU (0xFFFD4200) ;- (UDPHS_EPT_8) Base Address
AT91C_BASE_UDPHS_EPT_9    EQU (0xFFFD4220) ;- (UDPHS_EPT_9) Base Address
AT91C_BASE_UDPHS_EPT_10   EQU (0xFFFD4240) ;- (UDPHS_EPT_10) Base Address
AT91C_BASE_UDPHS_EPT_11   EQU (0xFFFD4260) ;- (UDPHS_EPT_11) Base Address
AT91C_BASE_UDPHS_EPT_12   EQU (0xFFFD4280) ;- (UDPHS_EPT_12) Base Address
AT91C_BASE_UDPHS_EPT_13   EQU (0xFFFD42A0) ;- (UDPHS_EPT_13) Base Address
AT91C_BASE_UDPHS_EPT_14   EQU (0xFFFD42C0) ;- (UDPHS_EPT_14) Base Address
AT91C_BASE_UDPHS_EPT_15   EQU (0xFFFD42E0) ;- (UDPHS_EPT_15) Base Address
AT91C_BASE_UDPHS_DMA_1    EQU (0xFFFD4310) ;- (UDPHS_DMA_1) Base Address
AT91C_BASE_UDPHS_DMA_2    EQU (0xFFFD4320) ;- (UDPHS_DMA_2) Base Address
AT91C_BASE_UDPHS_DMA_3    EQU (0xFFFD4330) ;- (UDPHS_DMA_3) Base Address
AT91C_BASE_UDPHS_DMA_4    EQU (0xFFFD4340) ;- (UDPHS_DMA_4) Base Address
AT91C_BASE_UDPHS_DMA_5    EQU (0xFFFD4350) ;- (UDPHS_DMA_5) Base Address
AT91C_BASE_UDPHS_DMA_6    EQU (0xFFFD4360) ;- (UDPHS_DMA_6) Base Address
AT91C_BASE_UDPHS_DMA_7    EQU (0xFFFD4370) ;- (UDPHS_DMA_7) Base Address
AT91C_BASE_UDPHS          EQU (0xFFFD4000) ;- (UDPHS) Base Address
AT91C_BASE_PDC_AC97C      EQU (0xFFFD8100) ;- (PDC_AC97C) Base Address
AT91C_BASE_AC97C          EQU (0xFFFD8000) ;- (AC97C) Base Address
AT91C_BASE_LCDC           EQU (0x00500000) ;- (LCDC) Base Address
AT91C_BASE_LCDC_16B_TFT   EQU (0x00500000) ;- (LCDC_16B_TFT) Base Address
AT91C_BASE_HDMA_CH_0      EQU (0xFFFFE63C) ;- (HDMA_CH_0) Base Address
AT91C_BASE_HDMA_CH_1      EQU (0xFFFFE664) ;- (HDMA_CH_1) Base Address
AT91C_BASE_HDMA           EQU (0xFFFFE600) ;- (HDMA) Base Address
AT91C_BASE_HECC           EQU (0xFFFFE800) ;- (HECC) Base Address

